{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Blocksensor",
  "signals:con-input": "Eingang",
  "signals:con-output": "Ausgang",
  "signals:con-target": "Ziel",
  "signals:con-source": "Quelle",
  "signalslink:block-entitysensor-*": "Entitätensensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Fehlerzustand",
  "signals:con-output1": "Ausgang 1",
  "signals:con-output2": "Ausgang 2",
  "signals:con-output1-config": "Ausgang-Setup 1",
  "signals:test": "Wir testen Übersetzungen in der KI-Stunde.",
  "signals:con-output2-config": "Ausgang-Setup 2",
  "signalslink:entitysensor-charged": "Aufgeladen. {0} Einheiten hinzugefügt. Das maximale Aufladelimit beträgt {1} Einheiten.",
  "signalslink:entitysensor-already-fully-charged": "Dieses Gerät ist bereits vollständig aufgeladen.",
  "signalslink:blockinfo-charge": "Ladung: {0}/{1} Einheiten ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Bei der aktuellen Abdeckung ({0} Blöcke) kann es arbeiten: ~{1} Tage",
  "signalslink:blockinfo-charge-empty": "Ladung: Leer – benötigt Temporal Gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink – Erweiterung des Mods Signals",
  "signalslink:block-managedchute-*": "Gesteuertes Rohr",
  "signalslink:block-managedwallchute-wood-*": "Gesteuertes Rohr in Holz",
  "signalslink:block-managedwallchute-rock-*": "Gesteuertes Rohr in Stein",
  "signalslink:block-managedwallchute-cobble-*": "Gesteuertes Rohr in Pflaster",
  "signalslink:managedchute-conditions": "Bedingungen",
  "signalslink:managedchute-info-unlimited": "Transportiert dauerhaft",
  "signalslink:managedchute-info-remaining": "Transportiert {0}",
  "signalslink:block-handbooktitle-signalslink": "Signalfunktionen",
  "signalslink:block-handbooktext-blocksensor": "Der Blocksensor erkennt die Anwesenheit eines Blocks auf der ausgewählten benachbarten Position und liefert je nach Typ bzw. Eingangssignal am Ausgang Informationen über seinen Zustand oder die Belegung von Slots.<br><font size=\"20\" color=\"6082B6\">Derzeit unterstützte Blöcke sind:</font><br><strong>Amboss</strong> – Wenn ein ausreichend heißer Barren zum Schmieden auf dem Amboss liegt, ist am Ausgang Signal 1. Andernfalls sendet er Signal 0.<br><strong>Türen, Tore, Luken</strong> – Bei Türen und Toren muss der Block am Boden auf der Scharnierseite überwacht werden. Ist der Block geöffnet, ist am Ausgang Signal 1, ist er geschlossen, Signal 0.<br><strong>Truhe oder allgemein ein Behälter oder beliebige Blöcke mit Inventarslots</strong> (z. B. Feuerstelle, Fass, Trog usw.). Am Ausgang ist ein Signal entsprechend dem Eingangssignal.<br>Das Eingangssignal bestimmt, welcher Slot gescannt werden soll.<br>Signal 1–14 bestimmt die Slots 0–13. Der Ausgang ist die Füllstandsinfo des Slots relativ zur maximalen Stapelkapazität des Gegenstands im Slot, umgerechnet in ein Signal 0–15.<br>Signal 15 bedeutet, dass der Sensor die Gesamtfüllung aller Slots erkennen soll, z. B. einer ganzen Truhe.<br><strong>Ein anderer Block, nicht oben aufgeführt</strong> – Ist im überwachten Raum nichts (Luft), ist am Ausgang Signal 0. Ist dort Wasser, ist am Ausgang 2 (Süßwasser) oder 3 (Salzwasser). Ist dort irgendein anderer Block, ist am Ausgang Signal 1.<br>",
  "signalslink:block-handbooktext-entitysensor": "Der Entitätensensor erkennt die Anwesenheit von Entitäten (Spielern, Tieren, Wildtieren oder Monstern) im markierten Bereich und kann an den Ausgängen Informationen über ihre Anzahl, ihren Typ oder ihren Zustand liefern. Für den Betrieb benötigt der Sensor eine Aufladung mit einem oder mehreren Temporal Gears. Die Verbrauchsrate hängt von der Größe des überwachten Bereichs ab.<br><strong>Eingänge x, y, z</strong> bestimmen die Größe des überwachten Bereichs in Blöcken.<br>Am Ausgang <strong>Fehler</strong> ist Signal 1, wenn der Sensor entladen ist, sonst 0.<br>Die Eingänge <strong>Ausgang-Setup 1</strong> und <strong>Ausgang-Setup 2</strong> bestimmen, welche Informationen an den Ausgängen 1 und 2 bereitgestellt werden. So kann jeder Ausgang je nach diesen Einstellungen andere Informationen liefern.<br>Möglichkeiten sind:<br>1 – Der Ausgang liefert <strong>Anzahl</strong>. Anzahl der erkannten Entitäten.<br>2 – Der Ausgang liefert <strong>Kategorie</strong>. Bit-Flags der Entitätskategorie 0–3: Spieler, Kreatur, Tier, Wildtier.<br>3 – Der Ausgang liefert <strong>Lebensstatus</strong>. Alle erkannten Entitäten sind: 1–tot, 2–lebendig oder 15–gemischt.<br>4 – Der Ausgang liefert <strong>Geschlecht</strong>. Alle erkannten Entitäten sind: 1–männlich, 2–weiblich oder 15–gemischt.<br>5 – Der Ausgang liefert <strong>Alter</strong>. Alle erkannten Entitäten sind: 1–Jungtier, 2–Erwachsen oder 15–gemischt.<br>6 – Der Ausgang liefert <strong>Art</strong>. Alle erkannten Entitäten sind: 1–Spieler, 2–Tier, 3–Wildtier, 4–Kreatur oder 15–gemischt.<br>7 – Der Ausgang liefert <strong>Fortpflanzungsstatus</strong>. Alle erkannten Entitäten sind: 1–paarungsbereit, 2–trächtig, 3–säugend oder 15–gemischt.<br>8 – Der Ausgang liefert <strong>Flags des Fortpflanzungsstatus</strong>. Bit-Flags 0–2: paarungsbereit, trächtig, säugend.<br>9 – Der Ausgang liefert <strong>Minimale Generation</strong>. Die minimale erkannte Generation ist: 0–15. Anwesende Entitäten ohne festgelegte Generation werden ignoriert.<br>10 – Der Ausgang liefert <strong>Maximale Generation</strong>. Die maximale erkannte Generation ist: 0–15. Anwesende Entitäten ohne festgelegte Generation werden ignoriert.<br>11 – Der Ausgang liefert <strong>Minimales Gewicht</strong>. Das minimale erkannte Gewicht ist: 1–hungrig, 2–niedrig, 3–ordentlich, 4–gut. Anwesende Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.<br>12 – Der Ausgang liefert <strong>Maximales Gewicht</strong>. Das maximale erkannte Gewicht ist: 1–hungrig, 2–niedrig, 3–ordentlich, 4–gut. Anwesende Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.<br>",
  "signalslink:block-handbooktext-managedchute": "Das gesteuerte Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken.<br>",
  "signalslink:block-handbooktext-managedwallchute": "Das in die Wand eingesetzte gesteuerte Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken. Es ermöglicht den Transport von Gegenständen durch Wände, was sehr nützlich für versteckte Transportsysteme sein kann oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu stören, das für die langfristige Lagerung von Lebensmitteln wichtig ist.<br>",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Erweitert den Mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> um zusätzliche Komponenten.<br><br>Um einen Block in der Umgebung zu überwachen, kannst du den <a href=\"handbook://block-signalslink:blocksensor\">Blocksensor</a> verwenden.<br>Wenn du deine Viehherde überwachen musst, eignet sich dafür hervorragend der <a href=\"handbook://block-signalslink:entitysensor\">Entitätensensor</a>.<br>Wenn du einige Arbeiten automatisieren möchtest, ist das <a href=\"handbook://block-signalslink:managedchute\">gesteuerte Rohr</a> eine ausgezeichnete Hilfe: Es kann Gegenstände ähnlich wie eine Rutsche zwischen Blöcken transportieren, wird aber per Signalen gesteuert und gibt dir viel mehr Kontrolle darüber, was transportiert wird. Seine Variante <a href=\"handbook://block-signalslink:managedwallchute\">gesteuertes, in die Wand eingebautes Rohr</a> ermöglicht dann den Transport von Gegenständen durch Wände, was sehr nützlich für versteckte Transportsysteme sein kann oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu stören, das für die langfristige Lagerung von Lebensmitteln wichtig ist."
}
