{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Blocksensor",
  "signals:con-input": "Eingang",
  "signals:con-output": "Ausgang",
  "signalslink:block-entitysensor-*": "Entitätensensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Fehlerzustand",
  "signals:con-output1": "Ausgang 1",
  "signals:con-output2": "Ausgang 2",
  "signals:con-output1-config": "Ausgang 1 konfigurieren",
  "signals:con-output2-config": "Ausgang 2 konfigurieren",
  "signalslink:ai-hour-test": "Testmeldung aus der AI-Stunde.",
  "signalslink:entitysensor-charged": "Geladen. {0} Einheiten hinzugefügt. Das maximale Ladelimit beträgt {1} Einheiten.",
  "signalslink:entitysensor-already-fully-charged": "Dieses Gerät ist bereits vollständig geladen.",
  "signalslink:blockinfo-charge": "Ladung: {0}/{1} Einheiten ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Bei der aktuellen Abdeckung ({0} Blöcke) kann es arbeiten: ~{1} Tage",
  "signalslink:blockinfo-charge-empty": "Ladung: Leer – benötigt ein Temporal Gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink – Erweiterung des Mods Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Erweitert den Mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> um weitere Komponenten.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Ermöglicht das Erkennen der Anwesenheit eines Blocks an einer ausgewählten benachbarten Position und liefert je nach Typ bzw. Eingangssignal am Ausgang Informationen über seinen Zustand oder die Belegung von Slots usw.<br>Der Block Sensor ermittelt, um welchen Block es sich handelt, und gibt entsprechend am Ausgang ein passendes Signal aus.<br><font size=\"20\" color=\"6082B6\">Derzeit unterstützte Blöcke sind:</font><br><strong>Amboss</strong> – wenn sich auf dem Amboss ein ausreichend heißer Barren zum Schmieden befindet, liegt am Ausgang Signal 1 an. Andernfalls sendet er Signal 0.<br><strong>Türen, Tore, Klappen</strong> – Bei Türen und Toren muss der Block am Boden auf der Scharnierseite überwacht werden. Ist der Block geöffnet, liegt am Ausgang Signal 1 an, ist er geschlossen, Signal 0.<br><strong>Truhe oder allgemein ein Behälter oder beliebige Blöcke mit Inventar-Slots</strong> (z. B. Feuerstelle, Fass, Trog usw.). Am Ausgang liegt ein Signal entsprechend dem Eingangssignal an.<br>Das Eingangssignal bestimmt, welcher Slot gescannt werden soll.<br>Signal 1–14 bestimmt die Slots 0–13. Der Ausgang ist eine Information über die Füllung des Slots im Verhältnis zur maximalen Stack-Kapazität des Gegenstands in diesem Slot, umgerechnet in ein Signal 0–15.<br>Signal 15 bedeutet, dass der Sensor die Gesamtfüllung aller Slots erkennen soll, z. B. einer ganzen Truhe.<br><strong>Ein anderer Block, der oben nicht aufgeführt ist</strong> – Wenn im überwachten Raum nichts ist (Luft), liegt am Ausgang Signal 0 an. Ist dort Wasser, liegt am Ausgang 2 für Süßwasser oder 3 für Salzwasser an. Ist dort irgendein anderer Block, liegt am Ausgang Signal 1 an.<br><br><font size=\"21\"><strong>Entitätensensor</strong></font><br>Erkennt die Anwesenheit von Entitäten (Spieler, Tiere, wilde Tiere oder Monster) in einem markierten Bereich und kann an den Ausgängen Informationen über deren Anzahl, Typ oder Zustand liefern. Der Sensor benötigt zum Betrieb eine Aufladung mit einem oder mehreren Zeiträdern (Temporal gears). Die Verbrauchsgeschwindigkeit hängt dann von der Größe des überwachten Bereichs ab.<br><strong>Eingänge x, y, z</strong> bestimmen die Größe des überwachten Bereichs in Blöcken.<br>Am Ausgang <strong>Fehler</strong> liegt Signal 1 an, wenn der Sensor entladen ist, sonst 0.<br>Die Eingänge <strong>Ausgang 1 konfigurieren</strong> und <strong>Ausgang 2 konfigurieren</strong> bestimmen, welche Informationen an den Ausgängen 1 und 2 bereitgestellt werden. An jedem Ausgang können Sie so je nach Einstellung dieser Eingänge unterschiedliche Informationen erhalten.<br>Möglichkeiten sind:<br>1 – Der Ausgang gibt <strong>Anzahl</strong> zurück. Die Anzahl der erkannten Entitäten.<br>2 – Der Ausgang gibt <strong>Kategorie</strong> zurück. Bit-Flags der Entitätskategorie 0–3: Spieler, Kreatur, Tier, wildes Tier.<br>3 – Der Ausgang gibt <strong>Lebenszustand</strong> zurück. Alle erkannten Entitäten sind: 1–tot, 2–lebendig oder 15–gemischt.<br>4 – Der Ausgang gibt <strong>Geschlecht</strong> zurück. Alle erkannten Entitäten sind: 1–männlich, 2–weiblich oder 15–gemischt.<br>5 – Der Ausgang gibt <strong>Alter</strong> zurück. Alle erkannten Entitäten sind: 1–jung, 2–erwachsen oder 15–gemischt.<br>6 – Der Ausgang gibt <strong>Art</strong> zurück. Alle erkannten Entitäten sind: 1–Spieler, 2–Tier, 3–wildes Tier, 4–Kreatur oder 15–gemischt.<br>7 – Der Ausgang gibt <strong>Fortpflanzungszustand</strong> zurück. Alle erkannten Entitäten sind: 1–paarungsbereit, 2–trächtig, 3–säugend oder 15–gemischt.<br>8 – Der Ausgang gibt <strong>Flags des Fortpflanzungszustands</strong> zurück. Bit-Flags 0–2: paarungsbereit, trächtig, säugend.<br>9 – Der Ausgang gibt <strong>Minimale Generation</strong> zurück. Die minimale erkannte Generation ist: 0–15. Vorhandene Entitäten ohne Generationsangabe werden ignoriert.<br>10 – Der Ausgang gibt <strong>Maximale Generation</strong> zurück. Die maximale erkannte Generation ist: 0–15. Vorhandene Entitäten ohne Generationsangabe werden ignoriert.<br>11 – Der Ausgang gibt <strong>Minimales Gewicht</strong> zurück. Das minimale erkannte Gewicht ist: 1–hungrig, 2–niedrig, 3–anständig, 4–gut. Vorhandene Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.<br>12 – Der Ausgang gibt <strong>Maximales Gewicht</strong> zurück. Das maximale erkannte Gewicht ist: 1–hungrig, 2–niedrig, 3–anständig, 4–gut. Vorhandene Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.<br><br><font size=\"20\" color=\"6082B6\">Wir haben eine AI-Stunde</font><br>Wir zeigen, wie die automatisierte Übersetzung von Mod-Texten mit Hilfe von KI funktioniert. Usw.<br>"
}
