{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Blocksensor",
  "signals:con-input": "Eingang",
  "signals:con-output": "Ausgang",
  "signals:con-target": "Ziel",
  "signals:con-source": "Quelle",
  "signalslink:block-entitysensor-*": "Wesenssensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Fehlerzustand",
  "signals:con-output1": "Ausgang 1",
  "signals:con-output2": "Ausgang 2",
  "signals:con-output1-config": "Ausgang 1 konfigurieren",
  "signals:test": "Wir testen Übersetzungen in der KI-Stunde.",
  "signals:con-output2-config": "Ausgang 2 konfigurieren",
  "signalslink:entitysensor-charged": "Aufgeladen. {0} Einheiten hinzugefügt. Das maximale Aufladelimit beträgt {1} Einheiten.",
  "signalslink:entitysensor-already-fully-charged": "Dieses Gerät ist bereits vollständig aufgeladen.",
  "signalslink:blockinfo-charge": "Ladung: {0}/{1} Einheiten ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Bei aktueller Abdeckung ({0} Blöcke) reicht es zum Arbeiten für: ~{1} Tage",
  "signalslink:blockinfo-charge-empty": "Ladung: Leer - benötigt ein Temporal Gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - Erweiterung des Mods Signals",
  "signalslink:block-managedchute-*": "Gesteuertes Rohr",
  "signalslink:block-managedwallchute-wood-*": "Gesteuertes Rohr in Holz eingesetzt",
  "signalslink:block-managedwallchute-rock-*": "Gesteuertes Rohr in Fels eingesetzt",
  "signalslink:block-managedwallchute-cobble-*": "Gesteuertes Rohr in Fliesen eingesetzt",
  "signalslink:managedchute-conditions": "Bedingungen",
  "signalslink:managedchute-info-unlimited": "Transportiert dauerhaft",
  "signalslink:managedchute-info-remaining": "Transportiert {0}",
  "signalslink:block-handbooktitle-signalslink": "Signalfunktionen",
  "signalslink:block-handbooktext-blocksensor": "Der Blocksensor erkennt die Anwesenheit eines Blocks an der ausgewählten benachbarten Position und liefert je nach dessen Typ bzw. dem Eingangssignal am Ausgang eine Information über seinen Zustand oder die Belegung seiner Slots.<br><font size=\"20\" color=\"6082B6\">Derzeit unterstützte Blöcke sind:</font><br><strong>Amboss</strong> – wenn sich auf dem Amboss ein ausreichend glühender Barren zum Schmieden befindet, liegt am Ausgang Signal 1 an. Andernfalls sendet er Signal 0.<br><strong>Türen, Tore, Luken</strong> – bei Türen und Toren muss der Block am Boden auf der Scharnierseite beobachtet werden. Ist der Block geöffnet, liegt am Ausgang Signal 1 an, ist er geschlossen, liegt am Ausgang Signal 0 an.<br><strong>Truhe oder allgemein Container oder beliebige Blöcke, die Inventarslots haben</strong> (z. B. Feuerstelle, Fass, Trog usw.). Am Ausgang liegt ein Signal entsprechend dem Eingangssignal an.<br>Das Eingangssignal bestimmt, welcher Slot gescannt werden soll.<br>Signal 1–14 bestimmt die Slots 0–13. Der Ausgang ist eine Information über die Füllung des Slots im Verhältnis zur maximalen Stack-Kapazität des Gegenstands in diesem Slot, umgerechnet in ein Signal 0–15.<br>Signal 15 bestimmt, dass der Sensor die Gesamtfüllung aller Slots erkennen soll, z. B. einer ganzen Truhe.<br><strong>Ein anderer Block, der oben nicht aufgeführt ist</strong> – wenn sich im überwachten Bereich nichts befindet (dort ist Luft), liegt am Ausgang Signal 0 an. Wenn dort Wasser ist, liegt am Ausgang 2 – Süßwasser oder 3 – Salzwasser an. Wenn dort irgendein anderer Block ist, liegt am Ausgang Signal 1 an.<br>",
  "signalslink:block-handbooktext-entitysensor": "Der Entitätensensor erkennt die Anwesenheit von Entitäten (Spieler, Nutztiere, Wildtiere oder Monster) im markierten Bereich und kann an den Ausgängen Informationen über deren Anzahl, Typ oder Zustand liefern. Für den Betrieb benötigt der Sensor eine Aufladung mit einem oder mehreren Zeit-Zahnrädern (Temporal gears). Die Verbrauchsgeschwindigkeit hängt dann von der Größe des überwachten Bereichs ab.<br><strong>Eingänge x, y, z</strong> bestimmen die Größe des überwachten Bereichs in Blöcken.<br>Am Ausgang <strong>Fehler</strong> liegt Signal 1 an, wenn der Sensor entladen ist, sonst 0.<br>Die Eingänge <strong>Ausgang 1 einstellen</strong> und <strong>Ausgang 2 einstellen</strong> bestimmen, welche Informationen an den Ausgängen 1 und 2 bereitgestellt werden. An jedem Ausgang können Sie somit je nach Einstellung dieser Eingänge unterschiedliche Informationen erhalten.<br>Optionen sind:<br>1 – Der Ausgang liefert <strong>Anzahl</strong>. Anzahl der erkannten Entitäten.<br>2 – Der Ausgang liefert <strong>Kategorie</strong>. Bit-Flags der Entitätskategorie 0–3: Spieler, Kreatur, Tier, Wildtier.<br>3 – Der Ausgang liefert <strong>Lebenszustand</strong>. Alle erkannten Entitäten sind: 1 – tot, 2 – lebendig oder 15 – gemischt.<br>4 – Der Ausgang liefert <strong>Geschlecht</strong>. Alle erkannten Entitäten sind: 1 – männlich, 2 – weiblich oder 15 – gemischt.<br>5 – Der Ausgang liefert <strong>Alter</strong>. Alle erkannten Entitäten sind: 1 – Jungtier, 2 – erwachsen oder 15 – gemischt.<br>6 – Der Ausgang liefert <strong>Art</strong>. Alle erkannten Entitäten sind: 1 – Spieler, 2 – Tier, 3 – Wildtier, 4 – Kreatur oder 15 – gemischt.<br>7 – Der Ausgang liefert <strong>Fortpflanzungszustand</strong>. Alle erkannten Entitäten sind: 1 – paarungsbereit, 2 – trächtig, 3 – säugend oder 15 – gemischt.<br>8 – Der Ausgang liefert <strong>Flags des Fortpflanzungszustands</strong>. Bit-Flags 0–2: paarungsbereit, trächtig, säugend.<br>9 – Der Ausgang liefert <strong>Minimale Generation</strong>. Die minimal erkannte Generation ist: 0–15. Vorhandene Entitäten ohne festgelegte Generation werden ignoriert.<br>10 – Der Ausgang liefert <strong>Maximale Generation</strong>. Die maximal erkannte Generation ist: 0–15. Vorhandene Entitäten ohne festgelegte Generation werden ignoriert.<br>11 – Der Ausgang liefert <strong>Minimales Gewicht</strong>. Das minimal erkannte Gewicht ist: 1 – hungernd, 2 – niedrig, 3 – ordentlich, 4 – gut. Vorhandene Entitäten ohne festgelegtes Gewicht (keine Tiere) werden ignoriert.<br>12 – Der Ausgang liefert <strong>Maximales Gewicht</strong>. Das maximal erkannte Gewicht ist: 1 – hungernd, 2 – niedrig, 3 – ordentlich, 4 – gut. Vorhandene Entitäten ohne festgelegtes Gewicht (keine Tiere) werden ignoriert.<br>",
  "signalslink:block-handbooktext-managedchute": "Ein gesteuertes Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken. Es transportiert Gegenstände nur in eine Richtung, die auf dem Rohr mit einem weißen Pfeil markiert ist.<br>Im Gegensatz zur Rutsche besitzt das gesteuerte Rohr kein eigenes Inventar und transportiert Gegenstände vom Block auf der Quellseite direkt in den Block auf der Zielseite. Das bedeutet, dass die Gegenstände nicht im Rohr gelagert werden, sondern nur hindurchbefördert werden.<br>Das gesteuerte Rohr hat drei Signals‑Anschlüsse: Eingang, Quelle und Ziel.<br><strong>Eingang</strong> dient zur Steuerung des Transports. Liegt am Eingang das Signal 0 an, ist das Rohr inaktiv und transportiert keine Gegenstände. Ein von null verschiedener Wert am Eingang löst den Transport von der Quelle zum Ziel aus. Unterstützt werden folgende Eingangswerte:<br>1 - Transportiere 1 Gegenstand<br>2 - Transportiere 2 Gegenstände<br>3 - Transportiere 4 Gegenstände<br>4 - Transportiere 8 Gegenstände<br>5 - Transportiere 16 Gegenstände<br>6 - Transportiere 32 Gegenstände<br>7 - Transportiere 64 Gegenstände<br>15 - Transportiere dauerhaft.<br>Werte am Eingang 1-7 ermöglichen den Transport in Chargen. Wenn im Quellblock nicht genügend Gegenstände vorhanden sind, um die gewünschte Menge zu transportieren, transportiert das Rohr so viel es kann und den Rest erst, wenn am Eingang ein weiteres Signal anliegt. Wenn Sie eine andere Menge transportieren möchten, können Sie nacheinander verschiedene Signalwerte im Bereich 1 bis 7 an den Eingang senden und so die gewünschte Chargenmenge zusammensetzen.<br>Der Wert 15 am Eingang bewirkt, dass das Rohr Gegenstände dauerhaft von der Quelle zum Ziel transportiert, unabhängig davon, wie viele Gegenstände transportiert werden müssen. Das Rohr setzt den Transport fort, sobald Gegenstände in der Quelle erscheinen, bis das Eingangssignal auf einen anderen Wert geändert wird.<br>Der Transport findet statt, wenn auf der Quellseite etwas zum Transport verfügbar ist und gleichzeitig auf der Zielseite Platz zum Einlagern der Gegenstände vorhanden ist. Wenn eine dieser Bedingungen nicht erfüllt ist, versucht das Rohr zu transportieren, bleibt jedoch inaktiv, solange dies nicht möglich ist, bis sich die Situation ändert (z.B. bis Gegenstände in der Quelle erscheinen oder im Ziel Platz frei wird).<br><strong>Quelle</strong> ist relevant, wenn der Eingangsblock ein Block mit Inventar ist. In diesem Fall bestimmt das Signal an der Quelle, aus welchem Slot die Gegenstände entnommen werden. Signal 1-14 entspricht den Slots 0-13. Signal 15 bedeutet, dass Gegenstände aus dem letzten Slot entnommen werden sollen.<br>Signal 0 bedeutet, dass Gegenstände aus einem beliebigen Slot entnommen werden sollen. In diesem Fall durchsucht das Rohr alle Slots und nimmt Gegenstände aus dem ersten Slot, der nicht leer ist. Wenn der Quellblock kein Inventar hat, wird dieser Eingang ignoriert.<br><strong>Ziel</strong> ist relevant, wenn der Ausgabeblock ein Block mit Inventar oder Luft ist. Bei einem Inventar bestimmt das Signal am Ziel, in welchen Slot die Gegenstände abgelegt werden. Signal 1-15 entspricht den Slots 0-14.<br>Wenn der Zielblock Luft ist und darunter Boden ist, sind folgende Zielwerte relevant: 1 - das Rohr versucht, einen Block aus der Quelle auf den Boden zu setzen, 2 - das Rohr versucht, einen Gegenstand auf den Boden zu legen, sofern er platzierbar ist. Dies funktioniert vorerst nur mit Kohle und eignet sich z.B. zum automatischen Nachlegen unter einem Stahlofen.<br><br>Wenn der Quellblock Luft ist, sammelt das Rohr schwebende Gegenstände aus einem Bereich von 3x3 Blöcken, wobei der mittlere Block dieses Würfels der Block vor der Rohrmündung ist.<br><br>Das gesteuerte Rohr kann, zusätzlich zu dem oben genannten, auch Gegenstände vom Typ Ingot, Iron Bloom und Blister Steel in einen Amboss einlegen, wenn der Amboss auf der Zielseite des Rohres platziert ist. Wenn es Ingots in den Amboss einlegt, wird automatisch das Schmiederezept für eine Platte ausgewählt. Bei Iron Bloom und Blister Steel wird das Ausschmieden der Schlacke ausgewählt, damit daraus Ingots entstehen. Das ist sehr nützlich für die Automatisierung des Schmiedens mit einem automatischen Hammer. Vor dem Einlegen in den Amboss müssen Sie jedoch dafür sorgen, dass Ingot, Iron Bloom oder Blister Steel auf die erforderliche Temperatur erhitzt sind.<br><br><font size=\"20\" color=\"6082B6\">Transport filtern</font><br>Das gesteuerte Rohr ermöglicht das Festlegen von Bedingungen zum Filtern der zu transportierenden Gegenstände. Die Bedingungen werden mit <strong>Bedingungen auf Papier</strong> eingestellt, deren Verwendung <a href=\"handbook://signalslink:usageinfo-paperconditions-text\">auf dieser Seite</a> erklärt wird<br>",
  "signalslink:block-handbooktext-managedwallchute": "Ein in die Wand eingesetztes gesteuertes Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken. Es ermöglicht, Gegenstände durch Wände zu transportieren, was sehr nützlich für versteckte Transportsysteme oder für den Transport von Gegenständen aus dem Keller oder in den Keller sein kann, ohne dabei das kühle Kellerklima zu beeinträchtigen, das für die langfristige Lagerung von Lebensmitteln wichtig ist.<br>Es funktioniert nach dem gleichen Prinzip wie das gesteuerte Rohr. Eine Beschreibung der Verwendung finden Sie daher auf der Seite <a href=\"handbook://block-signalslink:managedchute-north-down\">Beschreibung des gesteuerten Rohres</a>.<br>",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Erweitert den Mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> um weitere Komponenten.<br><br>Zum Überwachen eines Blocks in der Umgebung können Sie den <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor</a> verwenden.<br>Wenn Sie Ihre Rinderherde überwachen müssen, eignet sich dafür hervorragend der <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Entitätensensor</a>.<br>Wenn Sie einige Arbeiten automatisieren möchten, leistet Ihnen das <a href=\"handbook://block-signalslink:managedchute-north-down\">gesteuerte Rohr</a> hervorragende Dienste. Es kann Gegenstände zwischen Blöcken transportieren, ähnlich wie eine Rutsche, aber Sie steuern es mit Signalen und haben viel mehr Kontrolle darüber, was transportiert wird. Seine Variante <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">gesteuertes, in die Wand eingebautes Rohr</a> ermöglicht dann den Transport von Gegenständen durch Wände, was sehr nützlich für versteckte Transportsysteme oder für den Transport von Gegenständen aus dem Keller oder in den Keller sein kann, ohne dabei das kühle Kellerklima zu beeinträchtigen, das für die langfristige Lagerung von Lebensmitteln wichtig ist.",
  "signalslink:usageinfo-paperconditions-text": "Einige Blöcke aus dem Mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink</a> ermöglichen die Verwendung von <strong>Bedingungen auf Papier</strong>:<br>• <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor</a><br>• <a href=\"handbook://block-signalslink:managedchute-north-down\">Gesteuertes Rohr</a><br>• <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">In die Wand eingebautes gesteuertes Rohr</a><br><font size=\"20\" color=\"6082B6\">Bedingungen auf Papier</font><br><strong>Bedingungen auf Papier</strong> sind Bedingungen, die auf <a href=\"handbook://item-paper-parchment\">Pergament</a> geschrieben werden. Diese Bedingungen können verwendet werden, um das Verhalten eines Blocks zu beeinflussen, z.B. zur Steuerung von Ausgangssignalen oder zum Filtern von Gegenständen in Rohren.<br>Die Bedingungen werden in Blöcke (Absätze) geschrieben. Jeder Block besteht aus einer oder mehreren Zeilen, wobei in jeder Zeile eine Bedingung angegeben ist. Alle Bedingungen <strong>in einem Block</strong> werden so ausgewertet, dass zwischen ihnen der logische Operator AND angewendet wird und das Ergebnis den resultierenden Wert des gesamten Blocks ergibt.<br>Einzelne Blöcke sind durch eine Leerzeile voneinander getrennt. Auf die resultierenden Werte der einzelnen Blöcke wird dann der logische Operator OR angewendet. Die Auswertung der einzelnen Bedingungen in einem Block erfolgt in der Reihenfolge von oben nach unten, wie die Bedingungen auf dem Papier angegeben sind. Die Auswertung der Blöcke erfolgt ebenfalls in der Reihenfolge, in der die Blöcke auf dem Papier angegeben sind. Das bedeutet, sobald ein Block als wahr (true) ausgewertet wird, wird dieses Ergebnis an den aufrufenden Block zurückgegeben und mit dem nächsten Block nicht fortgefahren. Dies ist sehr wichtig und muss berücksichtigt werden.<br><br>Wir unterscheiden mehrere Typen von Bedingungen:<br><strong>game:plank-oak</strong> - Es wird geprüft, ob der beobachtete Gegenstand im Inventar oder der beobachtete Block vom angegebenen Typ ist, d.h. ob sein Code genau dem angegebenen Code entspricht. Wenn ja, liefert die Bedingung true.<br><strong>game:plank-*</strong> - Es wird geprüft, ob der beobachtete Gegenstand oder Block vom angegebenen Typ in irgendeiner seiner Varianten (mit Sternchen gekennzeichnet) ist. Wenn ja, liefert die Bedingung true.<br><strong>@.*-plank-.*</strong> - Der Code des beobachteten Gegenstands oder Blocks wird mit diesem regulären Ausdruck ausgewertet. Bei Übereinstimmung liefert die Bedingung true.<br><strong>attribut &gt; 1</strong> - Es wird der Wert des Attributs eines Gegenstands im Inventar oder des beobachteten Blocks ausgewertet. Es können verschiedene Vergleichsoperatoren (größer/kleiner/gleich) verwendet werden. Nach der Auswertung wird das Ergebnis des Vergleichs (true/false) zurückgegeben.<br><strong>attribut</strong> - Wenn in der Bedingung nur der Name des Attributs des Gegenstands angegeben wird, wird ausgewertet, ob es einen Wert hat oder nicht. D.h. Null, NULL, leere Zeichenkette oder false wird als false ausgewertet. Ein von null verschiedener Wert, eine Zeichenkette oder true wird als true ausgewertet.<br><br>Auf alle Bedingungen kann der Negationsoperator <strong>!</strong> angewendet werden. Zum Beispiel wird !game:plank-oak als true ausgewertet, wenn der beobachtete Gegenstand oder Block nicht genau Eichenbretter ist.<br>Am Ende jedes Blocks kann eine Instruktion zum Setzen des Ausgangssignals hinzugefügt werden, z.B. <strong>output 1</strong>, die bestimmt, dass, wenn dieser Block als wahr (true) ausgewertet wird, am Ausgang das Signal 1 gesendet wird. Dies ist nur beim Block <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor</a> relevant, der es ermöglicht festzulegen, welches Signal am Ausgang gesendet wird, falls ein Block oder Gegenstand mit den im Block angegebenen Bedingungen übereinstimmt. Bei anderen Blöcken, die Bedingungen auf Papier unterstützen, wird diese Instruktion ignoriert.<font size=\"20\" color=\"6082B6\">Einstellen der Bedingungen</font><br>Schreiben Sie die Bedingungen auf <a href=\"handbook://item-paper-parchment\">Pergament</a>. Unterschreiben Sie das Pergament nicht, damit Sie den Text erneut bearbeiten können.<br>Übertragen Sie die Bedingungen in einen Block, der dies unterstützt, indem Sie mit diesem Pergament mit der rechten Maustaste auf den jeweiligen Block klicken. Die Bedingungen werden so im Block gespeichert und Sie sehen sie im Informationsfenster, wenn Sie den Block ansehen. <br>Um die Bedingungen aus einem Block zu entfernen, nehmen Sie ein leeres Pergament in die Hand, ducken Sie sich (Shift-Taste) und klicken Sie mit diesem leeren Pergament auf den jeweiligen Block. Damit haben Sie die Bedingungen aus dem Block gelöscht.<br>Wenn Sie die Bedingungen aus einem Block auf ein leeres Pergament kopieren möchten, klicken Sie ohne Ducken mit der rechten Maustaste mit dem leeren Pergament auf den jeweiligen Block.<br>Und schließlich eine Hilfe, um herauszufinden, welchen Code ein Block oder Gegenstand hat und welche Attribute Ihnen für die Verwendung in Bedingungsausdrücken zur Verfügung stehen:<br>Nehmen Sie den Gegenstand, der Sie interessiert, in die Hand, halten Sie die Taste ctrl gedrückt und klicken Sie mit der rechten Maustaste mit diesem Block auf einen Block, der Bedingungen auf Papier unterstützt. Der Code des Gegenstands und seine Attribute, die für Bedingungen auf Papier verfügbar sind, werden in diesen Block gespeichert. Sie können sie nun auf ein leeres Pergament kopieren, wie oben beschrieben, und dort beliebig zu Bedingungsblöcken bearbeiten und zum Einstellen des Blocks verwenden.",
  "signalslink:usageinfo-paperconditions-title": "Bedingungen auf Papier"
}
