{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Blocksensor",
  "signals:con-input": "Eingang",
  "signals:con-output": "Ausgang",
  "signals:con-target": "Ziel",
  "signals:con-source": "Quelle",
  "signalslink:block-entitysensor-*": "Entitätensensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Fehlerzustand",
  "signals:con-output1": "Ausgang 1",
  "signals:con-output2": "Ausgang 2",
  "signals:con-output1-config": "Ausgang-Setup 1",
  "signals:test": "Wir testen Übersetzungen in der KI-Stunde.",
  "signals:con-output2-config": "Ausgang-Setup 2",
  "signalslink:entitysensor-charged": "Aufgeladen. {0} Einheiten hinzugefügt. Das maximale Aufladelimit beträgt {1} Einheiten.",
  "signalslink:entitysensor-already-fully-charged": "Dieses Gerät ist bereits vollständig aufgeladen.",
  "signalslink:blockinfo-charge": "Ladung: {0}/{1} Einheiten ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Bei der aktuellen Abdeckung ({0} Blöcke) kann es arbeiten: ~{1} Tage",
  "signalslink:blockinfo-charge-empty": "Ladung: Leer – benötigt Temporal Gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink – Erweiterung des Mods Signals",
  "signalslink:block-managedchute-*": "Gesteuertes Rohr",
  "signalslink:block-managedwallchute-wood-*": "Gesteuertes Rohr in Holz",
  "signalslink:block-managedwallchute-rock-*": "Gesteuertes Rohr in Stein",
  "signalslink:block-managedwallchute-cobble-*": "Gesteuertes Rohr in Pflaster",
  "signalslink:managedchute-conditions": "Bedingungen",
  "signalslink:managedchute-info-unlimited": "Transportiert dauerhaft",
  "signalslink:managedchute-info-remaining": "Transportiert {0}",
  "signalslink:block-handbooktitle-signalslink": "Signalfunktionen",
  "signalslink:block-handbooktext-blocksensor": "    Der Blocksensor erkennt die Anwesenheit eines Blocks an der ausgewählten benachbarten Position und gibt abhängig von seinem Typ bzw. vom Eingangssignal am Ausgang Informationen über dessen Zustand oder die Füllung seiner Slots aus.    <br>    <font size=\"20\" color=\"6082B6\">Derzeit unterstützte Blöcke sind:<\\/font>    <br>    <strong>Amboss<\\/strong> - Wenn sich ein ausreichend heißer Barren zum Schmieden auf dem Amboss befindet, liegt am Ausgang das Signal 1 an. Andernfalls wird das Signal 0 gesendet.    <br>    <strong>Türen, Tore, Falltüren<\\/strong> - Bei Türen und Toren muss der Block am Boden auf der Scharnierseite überwacht werden. Ist der Block geöffnet, liegt am Ausgang das Signal 1 an, ist er geschlossen, liegt am Ausgang das Signal 0 an.    <br>    <strong>Truhe oder allgemein Container oder beliebige Blöcke mit Inventarslots<\\/strong> (z. B. Feuerstelle, Fass, Trog usw.). Am Ausgang liegt ein Signal entsprechend dem Eingangssignal an.    <br>    Das Eingangssignal bestimmt, welcher Slot gescannt werden soll.    <br>    Die Signale 1–14 stehen für die Slots 0–13. Der Ausgang gibt die Information über die Füllung des Slots im Verhältnis zur maximalen Stapelgröße des Gegenstands in diesem Slot aus, umgerechnet auf ein Signal von 0–15.    <br>    Signal 15 legt fest, dass der Sensor die Gesamtfüllung aller Slots, z. B. einer ganzen Truhe, ermitteln soll.    <br>    <strong>Irgendein anderer Block, der oben nicht aufgeführt ist<\\/strong> - Befindet sich im überwachten Bereich nichts (Luft), liegt am Ausgang Signal 0 an. Befindet sich dort Wasser, liegt am Ausgang 2 – Süßwasser oder 3 – Salzwasser an. Befindet sich dort irgendein anderer Block, liegt am Ausgang Signal 1 an.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    Der Kreaturensensor erkennt die Anwesenheit von Entitäten (Spieler, Nutztiere, Wildtiere oder Monster) im markierten Bereich und kann an den Ausgängen Informationen über deren Anzahl, Typ oder Zustand bereitstellen. Für den Betrieb benötigt der Sensor eine Aufladung mit einem oder mehreren Zeitgetrieben (Temporal Gears). Die Verbrauchsrate hängt von der Größe des überwachten Bereichs ab.    <br>    Die Eingänge <strong>x, y, z<\\/strong> bestimmen die Größe des überwachten Bereichs in Blöcken.    <br>    Am Ausgang <strong>Fehler<\\/strong> liegt Signal 1 an, wenn der Sensor entladen ist, sonst 0.    <br>    Die Eingänge <strong>Ausgang 1 einstellen<\\/strong> und <strong>Ausgang 2 einstellen<\\/strong> legen fest, welche Informationen an den Ausgängen 1 und 2 bereitgestellt werden. An jedem Ausgang können Sie dadurch unterschiedliche Informationen erhalten, abhängig von der Einstellung dieser Eingänge.    <br>    Möglichkeiten sind:    <br>    1 - Der Ausgang gibt die <strong>Anzahl<\\/strong> zurück. Die Anzahl der erkannten Entitäten.    <br>    2 - Der Ausgang gibt die <strong>Kategorie<\\/strong> zurück. Bit-Flags der Entitätskategorie 0–3: Spieler, Kreatur, Nutztier, Wildtier.    <br>    3 - Der Ausgang gibt den <strong>Lebenszustand<\\/strong> zurück. Alle erkannten Entitäten sind: 1 – tot, 2 – lebendig oder 15 – gemischt.    <br>    4 - Der Ausgang gibt das <strong>Geschlecht<\\/strong> zurück. Alle erkannten Entitäten sind: 1 – männlich, 2 – weiblich oder 15 – gemischt.    <br>    5 - Der Ausgang gibt das <strong>Alter<\\/strong> zurück. Alle erkannten Entitäten sind: 1 – Jungtier, 2 – erwachsen oder 15 – gemischt.    <br>    6 - Der Ausgang gibt die <strong>Art<\\/strong> zurück. Alle erkannten Entitäten sind: 1 – Spieler, 2 – Nutztier, 3 – Wildtier, 4 – Kreatur oder 15 – gemischt.    <br>    7 - Der Ausgang gibt den <strong>Reproduktionszustand<\\/strong> zurück. Alle erkannten Entitäten sind: 1 – paarungsbereit, 2 – trächtig, 3 – säugend oder 15 – gemischt.    <br>    8 - Der Ausgang gibt die <strong>Flags des Reproduktionszustands<\\/strong> zurück. Bit-Flags 0–2: paarungsbereit, trächtig, säugend.    <br>    9 - Der Ausgang gibt die <strong>minimale Generation<\\/strong> zurück. Die minimal erkannte Generation ist: 0–15. Vorhandene Entitäten ohne Generationsangabe werden ignoriert.    <br>    10 - Der Ausgang gibt die <strong>maximale Generation<\\/strong> zurück. Die maximal erkannte Generation ist: 0–15. Vorhandene Entitäten ohne Generationsangabe werden ignoriert.    <br>    11 - Der Ausgang gibt das <strong>minimale Gewicht<\\/strong> zurück. Das minimal erkannte Gewicht ist: 1 – verhungernd, 2 – niedrig, 3 – ordentlich, 4 – gut. Vorhandene Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.    <br>    12 - Der Ausgang gibt das <strong>maximale Gewicht<\\/strong> zurück. Das maximal erkannte Gewicht ist: 1 – verhungernd, 2 – niedrig, 3 – ordentlich, 4 – gut. Vorhandene Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.    <br>",
  "signalslink:block-handbooktext-managedchute": "    Das gesteuerte Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken.",
  "signalslink:block-handbooktext-managedwallchute": "    Das gesteuerte Rohr in der Wand ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken. Es erlaubt den Transport von Gegenständen durch Wände hindurch, was sehr nützlich für verdeckte Transportsysteme sein kann oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu stören, das für die langfristige Lagerung von Lebensmitteln wichtig ist.",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink<\\/strong><\\/font>    <br>    Erweitert das Mod <a href=\"handbook://signals:craftinginfo-signals\">Signals<\\/a> um weitere Komponenten.    <br>    <br>    Zur Überwachung eines Blocks in der Umgebung können Sie den <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor<\\/a> verwenden.    <br>    Wenn Sie Ihre Viehherde überwachen müssen, eignet sich dafür hervorragend der <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Kreaturensensor<\\/a>.    <br>    Wenn Sie einige Arbeiten automatisieren möchten, leistet Ihnen das <a href=\"handbook://block-signalslink:managedchute-north-down\">gesteuerte Rohr<\\/a> hervorragende Dienste. Es kann Gegenstände zwischen Blöcken ähnlich wie eine Rutsche transportieren, wird aber von Signalen gesteuert und gibt Ihnen damit eine viel größere Kontrolle darüber, was transportiert wird. Seine Variante, das <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">gesteuerte Rohr in der Wand<\\/a>, ermöglicht dann den Transport von Gegenständen durch Wände hindurch, was sehr nützlich für verdeckte Transportsysteme sein kann oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu stören, das für die langfristige Lagerung von Lebensmitteln wichtig ist.",
  "signalslink:usageinfo-paperconditions-text": "    Einige Blöcke aus dem Mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink<\\/a> ermöglichen die Verwendung von <strong>Bedingungen auf Papier<\\/strong>:    <br>    • <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedchute-north-down\">gesteuertes Rohr<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">gesteuertes Rohr in der Wand<\\/a>    <br>    <font size=\"20\" color=\"6082B6\">Bedingungen auf Papier<\\/font>    <strong>Bedingungen auf Papier<\\/strong> sind Bedingungen, die auf <a href=\"handbook://item-paper-parchment\">Pergament<\\/a> geschrieben sind. Diese Bedingungen können verwendet werden, um das Verhalten eines Blocks zu beeinflussen, zum Beispiel zur Steuerung der Ausgangssignale oder zum Filtern von Gegenständen in Rohren.    <br>    Bedingungen werden in Blöcke (Absätze) geschrieben. Jeder Block besteht aus einer oder mehreren Zeilen, wobei in jeder Zeile eine Bedingung angegeben ist. Alle Bedingungen <strong>in einem Block<\\/strong> werden so ausgewertet, dass zwischen ihnen der logische Operator AND angewendet wird, und das Ergebnis ergibt den Gesamtwert des gesamten Blocks.    <br>    Die einzelnen Blöcke werden durch eine Leerzeile voneinander getrennt. Auf die Ergebniswerte der einzelnen Blöcke wird dann der logische Operator OR angewendet. Die Auswertung der einzelnen Bedingungen in einem Block erfolgt in der Reihenfolge von oben nach unten, wie die Bedingungen auf dem Papier angegeben sind. Die Auswertung der Blöcke erfolgt ebenfalls in der Reihenfolge, in der die Blöcke auf dem Papier angegeben sind. Das bedeutet, dass, sobald ein Block als wahr (true) ausgewertet wird, dieses Ergebnis an den aufrufenden Block zurückgegeben wird und mit dem nächsten Block nicht mehr fortgefahren wird. Dies ist sehr wichtig und muss berücksichtigt werden.    <br>    <br>    Wir unterscheiden mehrere Arten von Bedingungen:    <br>    <strong>game:plank-oak<\\/strong> - Es wird ausgewertet, ob der überwachte Gegenstand im Inventar oder der überwachte Block vom angegebenen Typ ist, d. h. ob sein Code genau dem angegebenen Code entspricht. Wenn ja, gibt die Bedingung true zurück.<br>    <strong>game:plank-*<\\/strong> - Es wird ausgewertet, ob der überwachte Gegenstand oder Block vom angegebenen Typ in einer beliebigen Variante (mit Sternchen markiert) ist. Wenn ja, gibt die Bedingung true zurück.<br>    <strong>@.*-plank-.*<\\/strong> - Der Code des überwachten Gegenstands oder Blocks wird mit diesem regulären Ausdruck ausgewertet. Wenn eine Übereinstimmung vorliegt, gibt die Bedingung true zurück.<br>    <strong>attribut > 1<\\/strong> - Es wird der Wert eines Attributs des Gegenstands im Inventar oder des überwachten Blocks ausgewertet. Hier können verschiedene Vergleichsoperatoren verwendet werden (größer/kleiner/gleich). Nach der Auswertung wird das Ergebnis des Vergleichs (true/false) zurückgegeben.<br>    <strong>attribut<\\/strong> - Wenn in der Bedingung nur der Name eines Attributs des Gegenstands angegeben wird, wird ausgewertet, ob es einen Wert hat oder nicht. Das heißt, Null, NULL, eine leere Zeichenkette oder false werden als false ausgewertet. Ein von Null verschiedener Wert, eine Zeichenkette oder true werden als true ausgewertet.<br>    <br>    Auf alle Bedingungen kann der Negationsoperator <strong>!<\\/strong> angewendet werden. Zum Beispiel wird !game:plank-oak als true ausgewertet, wenn der überwachte Gegenstand oder Block nicht genau Eichenbretter ist.    <br>    An das Ende jedes Blocks kann eine Anweisung zur Einstellung des Ausgangssignals angefügt werden, zum Beispiel <strong>output 1<\\/strong>, die festlegt, dass, wenn dieser Block als wahr (true) ausgewertet wird, am Ausgang Signal 1 gesendet wird. Dies ist nur beim Block <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor<\\/a> von Bedeutung, der es ermöglicht festzulegen, welches Signal an den Ausgang gesendet wird, wenn ein Block oder Gegenstand den im Block angegebenen Bedingungen entspricht. Bei den übrigen Blöcken, die die Verwendung von Bedingungen auf Papier erlauben, wird diese Anweisung ignoriert.    <font size=\"20\" color=\"6082B6\">Einstellen der Bedingungen<\\/font>    Die Bedingungen schreiben Sie auf <a href=\"handbook://item-paper-parchment\">Pergament<\\/a>. Unterschreiben Sie das Pergament nicht, damit Sie den Text später wieder bearbeiten können.<br>    Sie übertragen die Bedingungen in einen Block, der dies unterstützt, indem Sie mit diesem Pergament mit der rechten Maustaste auf den betreffenden Block klicken. Die Bedingungen werden so im Block gespeichert und Sie sehen sie im Informationsfenster, wenn Sie den Block ansehen. <br>    Um die Bedingungen aus einem Block zu entfernen, nehmen Sie ein leeres Pergament in die Hand, hocken sich (Shift-Taste) und klicken mit diesem leeren Pergament auf den betreffenden Block. Dadurch haben Sie die Bedingungen aus dem Block gelöscht.<br>    Wenn Sie die Bedingungen aus einem Block auf ein leeres Pergament kopieren möchten, klicken Sie mit leerem Pergament und der rechten Maustaste auf den betreffenden Block, ohne sich zu hocken.<br>    Und zum Schluss noch eine Hilfe, um herauszufinden, welchen Code ein Block oder Gegenstand hat und welche Attribute Ihnen für die Verwendung in Bedingungsausdrücken zur Verfügung stehen:<br>    Nehmen Sie den Gegenstand, der Sie interessiert, in die Hand, halten Sie die Strg-Taste gedrückt und klicken Sie mit diesem Block mit der rechten Maustaste auf einen Block, der Bedingungen auf Papier unterstützt. Der Code des Gegenstands und seine für Bedingungen auf Papier verfügbaren Attribute werden in diesem Block gespeichert. Sie können sie nun wie oben beschrieben auf ein leeres Pergament kopieren und dort beliebig zu Bedingungsblöcken bearbeiten und zur Einstellung des Blocks verwenden.",
  "signalslink:usageinfo-paperconditions-title": "Bedingungen auf Papier"
}
