{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Blocksensor",
  "signals:con-input": "Eingang",
  "signals:con-output": "Ausgang",
  "signals:con-target": "Ziel",
  "signals:con-source": "Quelle",
  "signalslink:block-entitysensor-*": "Entitätensensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Fehlerzustand",
  "signals:con-output1": "Ausgang 1",
  "signals:con-output2": "Ausgang 2",
  "signals:con-output1-config": "Ausgang-1-Konfiguration",
  "signals:test": "Wir testen Übersetzungen in der KI-Stunde.",
  "signals:con-output2-config": "Ausgang-2-Konfiguration",
  "signalslink:entitysensor-charged": "Aufgeladen. {0} Einheiten hinzugefügt. Das maximale Ladelimit beträgt {1} Einheiten.",
  "signalslink:entitysensor-already-fully-charged": "Dieses Gerät ist bereits vollständig aufgeladen.",
  "signalslink:blockinfo-charge": "Ladung: {0}/{1} Einheiten ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Bei der aktuellen Abdeckung ({0} Blöcke) läuft es: ~{1} Tage",
  "signalslink:blockinfo-charge-empty": "Ladung: Leer – benötigt Temporal Gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink – Erweiterung des Mods Signals",
  "signalslink:block-managedchute-*": "Gesteuertes Rohr",
  "signalslink:block-managedwallchute-wood-*": "Gesteuertes Rohr in Holz eingelassen",
  "signalslink:block-managedwallchute-rock-*": "Gesteuertes Rohr in Stein eingelassen",
  "signalslink:block-managedwallchute-cobble-*": "Gesteuertes Rohr in Pflaster eingelassen",
  "signalslink:managedchute-conditions": "Bedingungen",
  "signalslink:managedchute-info-unlimited": "Transportiert dauerhaft",
  "signalslink:managedchute-info-remaining": "Transportiert {0}",
  "signalslink:block-handbooktitle-signalslink": "Signalfunktionen",
  "signalslink:block-handbooktext-blocksensor": "    Der Blocksensor erkennt die Anwesenheit eines Blocks an der ausgewählten benachbarten Position und liefert abhängig von seinem Typ bzw. dem Eingangssignal am Ausgang eine Information über seinen Zustand oder die Belegung der Slots.    <br>    <font size=\"20\" color=\"6082B6\">Derzeit unterstützte Blöcke sind:</font>    <br>    <strong>Amboss</strong> – wenn sich auf dem Amboss ein ausreichend heißer Barren zum Schmieden befindet, liegt am Ausgang Signal 1 an. Andernfalls sendet er Signal 0.    <br>    <strong>Türen, Tore, Klappen</strong> – Bei Türen und Toren muss der Block am Boden auf der Scharnierseite überwacht werden. Ist der Block offen, liegt am Ausgang Signal 1 an, ist er geschlossen, liegt Signal 0 an.    <br>    <strong>Truhe oder allgemein ein Behälter oder beliebige Blöcke mit Inventarslots</strong> (z. B. Feuerstelle, Fass, Trog usw.). Am Ausgang liegt ein Signal entsprechend dem Eingangssignal an.    <br>    Das Eingangssignal bestimmt, welcher Slot gescannt werden soll.    <br>    Signal 1–14 bestimmt die Slots 0–13. Der Ausgang ist die Füllinformation des Slots relativ zur maximalen Stapelgröße des Gegenstands in diesem Slot, umgerechnet auf Signal 0–15.    <br>    Signal 15 bestimmt, dass der Sensor die Gesamtfüllung aller Slots erkennen soll, z. B. einer ganzen Truhe.    <br>    <strong>Ein anderer Block, der oben nicht aufgeführt ist</strong> – Wenn sich im überwachten Raum nichts befindet (Luft), liegt am Ausgang Signal 0 an. Wenn dort Wasser ist, liegt am Ausgang 2 (Süßwasser) oder 3 (Salzwasser) an. Wenn dort irgendein anderer Block ist, liegt am Ausgang Signal 1 an.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    Der Entitätensensor erkennt die Anwesenheit von Entitäten (Spielern, Tieren, Wildtieren oder Monstern) im markierten Bereich und kann an den Ausgängen Informationen über deren Anzahl, Typ oder Zustand liefern. Für den Betrieb benötigt der Sensor eine Aufladung    mit einem oder mehreren Zeitzahnrädern (Temporal gears). Die Verbrauchsgeschwindigkeit hängt von der Größe des überwachten Bereichs ab.    <br>    <strong>Eingänge x, y, z</strong> bestimmen die Größe des überwachten Bereichs in Blöcken.    <br>    Am Ausgang <strong>Fehler</strong> liegt Signal 1 an, wenn der Sensor entladen ist, andernfalls 0.    <br>    Die Eingänge <strong>Ausgang-1-Konfiguration</strong> und <strong>Ausgang-2-Konfiguration</strong> bestimmen, welche Informationen an den Ausgängen 1 und 2 bereitgestellt werden. An jedem Ausgang kann so anhand dieser Eingänge eine andere Information ausgegeben werden.    <br>    Möglichkeiten sind:    <br>    1 – Der Ausgang liefert <strong>Anzahl</strong>. Anzahl der erkannten Entitäten.    <br>    2 – Der Ausgang liefert <strong>Kategorie</strong>. Bit-Flags der Entitätskategorie 0–3: Spieler, Kreatur, Tier, Wildtier.    <br>    3 – Der Ausgang liefert <strong>Lebenszustand</strong>. Alle erkannten Entitäten sind: 1–tot, 2–lebendig oder 15–gemischt.    <br>    4 – Der Ausgang liefert <strong>Geschlecht</strong>. Alle erkannten Entitäten sind: 1–männlich, 2–weiblich oder 15–gemischt.    <br>    5 – Der Ausgang liefert <strong>Alter</strong>. Alle erkannten Entitäten sind: 1–jung, 2–erwachsen oder 15–gemischt.    <br>    6 – Der Ausgang liefert <strong>Art</strong>. Alle erkannten Entitäten sind: 1–Spieler, 2–Tier, 3–Wildtier, 4–Kreatur oder 15–gemischt.    <br>    7 – Der Ausgang liefert <strong>Fortpflanzungszustand</strong>. Alle erkannten Entitäten sind: 1–paarungsbereit, 2–trächtig, 3–säugend oder 15–gemischt.    <br>    8 – Der Ausgang liefert <strong>Flags des Fortpflanzungszustands</strong>. Bit-Flags 0–2: paarungsbereit, trächtig, säugend.    <br>    9 – Der Ausgang liefert <strong>Minimale Generation</strong>. Die minimale erkannte Generation ist: 0–15. Anwesende Entitäten ohne Generationsangabe werden ignoriert.    <br>    10 – Der Ausgang liefert <strong>Maximale Generation</strong>. Die maximale erkannte Generation ist: 0–15. Anwesende Entitäten ohne Generationsangabe werden ignoriert.    <br>    11 – Der Ausgang liefert <strong>Mindestgewicht</strong>. Das minimale erkannte Gewicht ist: 1–verhungernd, 2–niedrig, 3–anständig, 4–gut. Anwesende Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.    <br>    12 – Der Ausgang liefert <strong>Höchstgewicht</strong>. Das maximale erkannte Gewicht ist: 1–verhungernd, 2–niedrig, 3–anständig, 4–gut. Anwesende Entitäten ohne Gewichtsangabe (keine Tiere) werden ignoriert.    <br>",
  "signalslink:block-handbooktext-managedchute": "    Das gesteuerte Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken.    ",
  "signalslink:block-handbooktext-managedwallchute": "    Das in der Wand eingelassene gesteuerte Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken. Es ermöglicht den Transport von Gegenständen durch Wände, was sehr nützlich für versteckte Transportsysteme sein kann    oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu stören, das für die langfristige Lagerung von Lebensmitteln wichtig ist.    ",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink</strong></font>    <br>    Erweitert den Mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> um weitere Komponenten.    <br>    <br>    Um einen Block in der Umgebung zu überwachen, können Sie den <a href=\"handbook://block-signalslink:blocksensor\">Blocksensor</a> verwenden.    <br>    Wenn Sie Ihre Viehherde überwachen müssen, eignet sich dafür hervorragend der <a href=\"handbook://block-signalslink:entitysensor\">Entitätensensor</a>.    <br>    Wenn Sie einige Arbeiten automatisieren möchten, ist das <a href=\"handbook://block-signalslink:managedchute\">gesteuerte Rohr</a> ideal: Es kann Gegenstände ähnlich wie eine Rutsche zwischen Blöcken transportieren, aber Sie steuern es mit Signalen und haben    viel mehr Kontrolle darüber, was transportiert wird. Seine Variante <a href=\"handbook://block-signalslink:managedwallchute\">gesteuertes, in die Wand eingebautes Rohr</a> ermöglicht dann den Transport von Gegenständen durch Wände, was sehr nützlich für versteckte Transportsysteme sein kann    oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu stören, das für die langfristige Lagerung von Lebensmitteln wichtig ist. "
}
