{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Blocksensor",
  "signals:con-input": "Eingang",
  "signals:con-output": "Ausgang",
  "signals:con-target": "Ziel",
  "signals:con-source": "Quelle",
  "signalslink:block-entitysensor-*": "Wesensensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Fehlerzustand",
  "signals:con-output1": "Ausgang 1",
  "signals:con-output2": "Ausgang 2",
  "signals:con-output1-config": "Einstellungen für Ausgang 1",
  "signals:test": "Wir testen Übersetzungen in einer KI-Stunde.",
  "signals:con-output2-config": "Einstellungen für Ausgang 2",
  "signalslink:entitysensor-charged": "Aufgeladen. {0} Einheiten hinzugefügt. Das maximale Ladelimit beträgt {1} Einheiten.",
  "signalslink:entitysensor-already-fully-charged": "Dieses Gerät ist bereits vollständig aufgeladen.",
  "signalslink:blockinfo-charge": "Ladung: {0}/{1} Einheiten ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Bei aktueller Abdeckung ({0} Blöcke) arbeitet es für: ~{1} Tage",
  "signalslink:blockinfo-charge-empty": "Ladung: Leer - benötigt temporal gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - Erweiterung des Mods Signals",
  "signalslink:block-managedchute-*": "Gesteuerte Röhre",
  "signalslink:block-managedwallchute-wood-*": "Gesteuerte Röhre in Holz eingelassen",
  "signalslink:block-managedwallchute-rock-*": "Gesteuerte Röhre in Fels eingelassen",
  "signalslink:block-managedwallchute-cobble-*": "Gesteuerte Röhre in Fliesen eingelassen",
  "signalslink:managedchute-conditions": "Bedingungen",
  "signalslink:managedchute-info-unlimited": "Transportiert dauerhaft",
  "signalslink:managedchute-info-remaining": "Transportiert {0}",
  "signalslink:block-handbooktitle-signalslink": "Signalfunktionen",
  "signalslink:block-handbooktext-blocksensor": "    Der Blocksensor erkennt die Anwesenheit eines Blocks an der ausgewählten benachbarten Position und liefert je nach seinem Typ bzw. je nach Eingangssignal am Ausgang eine Information über seinen Zustand oder die Belegung der Slots.    <br>    <font size=\"20\" color=\"6082B6\">Derzeit unterstützte Blöcke sind:</font>    <br>    <strong>Amboss</strong> - wenn sich auf dem Amboss ein ausreichend heißer Barren zum Schmieden befindet, liegt am Ausgang Signal 1 an. Andernfalls sendet er Signal 0.    <br>    <strong>Türen, Tore, Fallklappen</strong> - Bei Türen und Toren muss der Block am Boden auf der Scharnierseite überwacht werden. Ist der Block geöffnet, liegt am Ausgang Signal 1 an, ist er geschlossen, liegt am Ausgang Signal 0 an.    <br>    <strong>Truhe oder allgemein ein Behälter oder beliebige Blöcke, die Inventar-Slots haben</strong> (z.B. Feuerstelle, Fass, Trog usw.). Am Ausgang liegt ein Signal entsprechend dem Eingangssignal an.    <br>    Das Eingangssignal bestimmt, welcher Slot gescannt werden soll.    <br>    Signal 1-14 bestimmt die Slots 0-13. Der Ausgang liefert die Information über die Füllung des Slots im Verhältnis zur maximalen Stack-Kapazität des Gegenstands im jeweiligen Slot, umgerechnet in ein Signal 0-15.    <br>    Signal 15 bestimmt, dass der Sensor die Gesamtfüllung aller Slots erkennen soll, z.B. einer ganzen Truhe.    <br>    <strong>Irgendein anderer Block, der oben nicht aufgeführt ist</strong> - Wenn sich im überwachten Bereich nichts befindet (es ist Luft), liegt am Ausgang Signal 0 an. Ist dort Wasser, ist am Ausgang 2–Süßwasser oder 3–Salzwasser. Befindet sich dort irgendein anderer Block, liegt am Ausgang Signal 1 an.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    Der Entitätensensor erkennt die Anwesenheit von Entitäten (Spieler, Tiere, Wildtiere oder Monster) im markierten Bereich und kann an den Ausgängen Informationen über deren Anzahl, Typ oder Zustand bereitstellen. Für den Betrieb benötigt der Sensor eine Aufladung mit einem oder mehreren Zeit-Zahnrädern (Temporal gears). Die Verbrauchsgeschwindigkeit hängt dann von der Größe des überwachten Bereichs ab.    <br>    <strong>Eingänge x, y, z</strong> bestimmen die Größe des überwachten Bereichs in Blöcken.    <br>    Am Ausgang <strong>Fehler</strong> liegt Signal 1 an, wenn der Sensor entladen ist, ansonsten 0.    <br>    Die Eingänge <strong>Ausgang 1 einstellen</strong> und <strong>Ausgang 2 einstellen</strong> bestimmen, welche Informationen an den Ausgängen 1 und 2 bereitgestellt werden. An jedem Ausgang können Sie so, abhängig von der Einstellung dieser Eingänge, eine andere Information erhalten.    <br>    Die Optionen sind:    <br>    1 - Der Ausgang liefert <strong>Anzahl</strong>. Die Anzahl der erkannten Entitäten.    <br>    2 - Der Ausgang liefert <strong>Kategorie</strong>. Bit-Flags der Entitätskategorie 0–3: Spieler, Kreatur, Tier, Wildtier.    <br>    3 - Der Ausgang liefert <strong>Lebenszustand</strong>. Alle erkannten Entitäten sind: 1–tot, 2–lebendig oder 15–gemischt.    <br>    4 - Der Ausgang liefert <strong>Geschlecht</strong>. Alle erkannten Entitäten sind: 1–männlich, 2–weiblich oder 15–gemischt.    <br>    5 - Der Ausgang liefert <strong>Alter</strong>. Alle erkannten Entitäten sind: 1–Jungtier, 2–erwachsen oder 15–gemischt.    <br>    6 - Der Ausgang liefert <strong>Art</strong>. Alle erkannten Entitäten sind: 1–Spieler, 2–Tier, 3–Wildtier, 4–Kreatur oder 15–gemischt.    <br>    7 - Der Ausgang liefert <strong>Fortpflanzungszustand</strong>. Alle erkannten Entitäten sind: 1–paarungsbereit, 2–trächtig, 3–säugend oder 15–gemischt.    <br>    8 - Der Ausgang liefert <strong>Flags des Fortpflanzungszustands</strong>. Bit-Flags 0–2: paarungsbereit, trächtig, säugend.    <br>    9 - Der Ausgang liefert <strong>Minimale Generation</strong>. Die minimal erkannte Generation ist: 0–15. Vorhandene Entitäten ohne Generationsangabe werden ignoriert.    <br>    10 - Der Ausgang liefert <strong>Maximale Generation</strong>. Die maximal erkannte Generation ist: 0–15. Vorhandene Entitäten ohne Generationsangabe werden ignoriert.    <br>    11 - Der Ausgang liefert <strong>Minimales Gewicht</strong>. Das minimal erkannte Gewicht ist: 1–verhungernd, 2–niedrig, 3–ordentlich, 4–gut. Vorhandene Entitäten ohne Gewichtsangabe (sind keine Tiere) werden ignoriert.    <br>    12 - Der Ausgang liefert <strong>Maximales Gewicht</strong>. Das maximal erkannte Gewicht ist: 1–verhungernd, 2–niedrig, 3–ordentlich, 4–gut. Vorhandene Entitäten ohne Gewichtsangabe (sind keine Tiere) werden ignoriert.    <br>",
  "signalslink:block-handbooktext-managedchute": "    Das gesteuerte Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken.",
  "signalslink:block-handbooktext-managedwallchute": "    Ein in die Wand eingesetztes gesteuertes Rohr ermöglicht den automatisierten Transport von Gegenständen zwischen verschiedenen Blöcken. Es ermöglicht den Transport von Gegenständen durch Wände, was für versteckte Transportsysteme sehr nützlich sein kann    oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu beeinträchtigen, das für die langfristige Lagerung von Lebensmitteln wichtig ist.",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink</strong></font>    <br>    Erweitert die Mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> um weitere Komponenten.    <br>    <br>    Um einen Block in der Umgebung zu überwachen, können Sie den <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor</a> verwenden.    <br>    Wenn Sie Ihre Rinderherde überwachen müssen, eignet sich dafür hervorragend der <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Entitätensensor</a>.    <br>    Wenn Sie einige Arbeiten automatisieren möchten, leistet Ihnen das <a href=\"handbook://block-signalslink:managedchute-north-down\">gesteuerte Rohr</a> ausgezeichnete Dienste, das Gegenstände zwischen Blöcken ähnlich wie eine Rutsche transportieren kann, aber Sie steuern es mit Signalen und es gibt Ihnen    viel mehr Kontrolle darüber, was transportiert wird. Seine Variante <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">gesteuertes in die Wand eingebautes Rohr</a> ermöglicht dann den Transport von Gegenständen durch Wände, was für versteckte Transportsysteme sehr nützlich sein kann    oder für den Transport von Gegenständen aus dem Keller oder in den Keller, ohne dabei das kühle Kellerklima zu beeinträchtigen, das für die langfristige Lagerung von Lebensmitteln wichtig ist.",
  "signalslink:usageinfo-paperconditions-text": "    Einige Blöcke aus der Mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink</a> ermöglichen die Verwendung von <strong>Bedingungen auf Papier</strong>:    <br>    • <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor</a>    <br>    • <a href=\"handbook://block-signalslink:managedchute-north-down\">gesteuertes Rohr</a>    <br>    • <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">gesteuertes in die Wand eingebautes Rohr</a>    <br>    <font size=\"20\" color=\"6082B6\">Bedingungen auf Papier</font>    <strong>Bedingungen auf Papier</strong> sind Bedingungen, die auf <a href=\"handbook://item-paper-parchment\">Pergament</a> geschrieben werden. Diese Bedingungen können verwendet werden, um das Verhalten eines Blocks zu beeinflussen, z.B. zur Steuerung der Ausgangssignale oder zum Filtern von Gegenständen in Rohren.    <br>    Die Bedingungen werden in Blöcke (Absätze) geschrieben. Jeder Block besteht aus einer oder mehreren Zeilen, wobei in jeder Zeile eine Bedingung angegeben ist. Alle Bedingungen <strong>in einem Block</strong> werden so ausgewertet, dass zwischen ihnen der logische Operator AND angewendet wird    und das Ergebnis den Endwert des gesamten Blocks ergibt.    <br>    Einzelne Blöcke sind durch eine leere Zeile getrennt. Auf die Endwerte der einzelnen Blöcke wird dann der logische Operator OR angewendet. Die Auswertung der einzelnen Bedingungen in einem Block erfolgt in der Reihenfolge von oben nach unten, wie die Bedingungen auf dem Papier angegeben sind.    Die Auswertung der Blöcke erfolgt ebenfalls in der Reihenfolge, in der die Blöcke auf dem Papier angegeben sind. Das bedeutet, sobald ein Block als wahr (true) ausgewertet wird, wird dieses Ergebnis an den aufrufenden Block zurückgegeben und die weiteren Blöcke werden nicht mehr fortgesetzt.    Das ist sehr wichtig und muss berücksichtigt werden.    <br>    <br>    Wir unterscheiden mehrere Arten von Bedingungen:    <br>    <strong>game:plank-oak</strong> - Es wird ausgewertet, ob der überwachte Gegenstand im Inventar oder der überwachte Block vom angegebenen Typ ist, d.h. sein Code entspricht exakt dem angegebenen Code. Wenn ja, gibt die Bedingung true zurück.<br>    <strong>game:plank-*</strong> - Es wird ausgewertet, ob der überwachte Gegenstand oder Block vom angegebenen Typ ist, in irgendeiner seiner Varianten (mit Sternchen gekennzeichnet). Wenn ja, gibt die Bedingung true zurück.<br>    <strong>@.*-plank-.*</strong> - Der Code des überwachten Gegenstands oder Blocks wird anhand dieses regulären Ausdrucks ausgewertet. Bei Übereinstimmung gibt die Bedingung true zurück.<br>    <strong>attribut > 1</strong> - Es wird der Wert eines Attributs des Gegenstands im Inventar oder des überwachten Blocks ausgewertet. Hier können verschiedene Vergleichsoperatoren (größer/kleiner/gleich) verwendet werden. Nach der Auswertung wird das Ergebnis des Vergleichs (true/false) zurückgegeben.<br>    <strong>attribut</strong> - Wenn in der Bedingung nur der Name des Attributs des Gegenstands angegeben wird, wird ausgewertet, ob es einen Wert hat oder nicht. D.h. null, NULL, leerer String oder false wird als false ausgewertet. Ein nicht-null Wert, String oder true wird als true ausgewertet.<br>    <br>    Auf alle Bedingungen kann der Negationsoperator <strong>!</strong> angewendet werden. Zum Beispiel wird !game:plank-oak als true ausgewertet, wenn der überwachte Gegenstand oder Block nicht exakt Eichenbretter ist.    <br>    Am Ende jedes Blocks kann eine Anweisung zum Setzen des Ausgangssignals hinzugefügt werden, z.B. <strong>output 1</strong>, die bestimmt, dass, wenn dieser Block als wahr (true) ausgewertet wird, am Ausgang Signal 1 gesendet wird.    Das ist nur beim Block <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Blocksensor</a> von Bedeutung, der es ermöglicht festzulegen, welches Signal am Ausgang gesendet wird, falls ein Block oder Gegenstand mit den im Block angegebenen Bedingungen übereinstimmt. Bei anderen Blöcken, die Bedingungen auf Papier unterstützen, wird diese Anweisung ignoriert.    <font size=\"20\" color=\"6082B6\">Einrichten der Bedingungen</font>    Sie schreiben die Bedingungen auf <a href=\"handbook://item-paper-parchment\">Pergament</a>. Unterschreiben Sie das Pergament nicht, damit Sie den Text erneut bearbeiten können.<br>    Sie übertragen die Bedingungen in einen Block, der dies unterstützt, indem Sie mit diesem Pergament mit der rechten Maustaste auf den betreffenden Block klicken. Die Bedingungen werden so im Block gespeichert und Sie sehen sie im Informationsfenster, wenn Sie den Block ansehen. <br>    Um die Bedingungen aus dem Block zu entfernen, nehmen Sie ein leeres Pergament in die Hand, ducken Sie sich (Shift-Taste) und klicken Sie mit diesem leeren Pergament auf den betreffenden Block. Damit haben Sie die Bedingungen aus dem Block gelöscht.<br>    Wenn Sie die Bedingungen aus dem Block auf ein leeres Pergament kopieren möchten, klicken Sie mit einem leeren Pergament mit der rechten Maustaste auf den betreffenden Block, ohne sich zu ducken.<br>    Und zum Schluss ein Hinweis, wie Sie herausfinden, welchen Code ein Block oder Gegenstand hat und welche Attribute Ihnen für die Verwendung in Bedingungsausdrücken zur Verfügung stehen:<br>    Nehmen Sie den Gegenstand, für den Sie sich interessieren, in die Hand, halten Sie die Strg-Taste gedrückt und klicken Sie mit der rechten Maustaste mit diesem Block auf einen Block, der Bedingungen auf Papier unterstützt. Der Code des Gegenstands und seine Attribute, die für Bedingungen auf Papier verfügbar sind, werden in diesem Block gespeichert. Sie können sie nun auf ein     leeres Pergament kopieren, wie oben beschrieben, und dort beliebig in Bedingungsblöcke bearbeiten und zur Einstellung des Blocks verwenden.",
  "signalslink:usageinfo-paperconditions-title": "Bedingungen auf Papier"
}
