{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Block Sensor",
  "signals:con-input": "Input",
  "signals:con-output": "Output",
  "signals:con-target": "Target",
  "signals:con-source": "Source",
  "signalslink:block-entitysensor-*": "Entity Sensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Error state",
  "signals:con-output1": "Output 1",
  "signals:con-output2": "Output 2",
  "signals:con-output1-config": "Output 1 configuration",
  "signals:test": "We are testing translations in the AI lesson.",
  "signals:con-output2-config": "Output 2 configuration",
  "signalslink:entitysensor-charged": "Charged. Added {0} units. The maximum charge limit is {1} units.",
  "signalslink:entitysensor-already-fully-charged": "This device is already fully charged.",
  "signalslink:blockinfo-charge": "Charge: {0}/{1} units ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "At the current coverage ({0} blocks) it will operate for: ~{1} days",
  "signalslink:blockinfo-charge-empty": "Charge: Empty - needs a temporal gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extension for the Signals mod",
  "signalslink:block-managedchute-*": "Managed Chute",
  "signalslink:block-managedwallchute-wood-*": "Managed chute embedded in wood",
  "signalslink:block-managedwallchute-rock-*": "Managed chute embedded in rock",
  "signalslink:block-managedwallchute-cobble-*": "Managed chute embedded in tiles",
  "signalslink:managedchute-conditions": "Conditions",
  "signalslink:managedchute-info-unlimited": "Transports indefinitely",
  "signalslink:managedchute-info-remaining": "Transports {0}",
  "signalslink:block-handbooktitle-signalslink": "Signal functions",
  "signalslink:block-handbooktext-blocksensor": "The block sensor detects the presence of a block at the selected adjacent position and, based on its type or the input signal, provides output information about its state or the fill level of its slots.<br><font size=\"20\" color=\"6082B6\">Currently supported blocks are:</font><br><strong>Anvil</strong> - if there is an ingot hot enough for forging on the anvil, the output is signal 1. Otherwise it sends signal 0.<br><strong>Doors, gates, trapdoors</strong> - for doors and gates you need to monitor the ground block on the hinge side. If the block is open, the output is signal 1; if it is closed, the output is signal 0.<br><strong>Chest or generally a container or any blocks that have inventory slots</strong> (e.g. firepit, barrel, trough, etc.). The output signal depends on the input signal.<br>The input signal determines which slot should be scanned.<br>Signal 1-14 determines slots 0-13. The output is information about how full the slot is relative to the item's maximum stack capacity in that slot, converted to a signal 0-15.<br>Signal 15 means the sensor should detect the total fill level of all slots, e.g. an entire chest.<br><strong>Some other block not listed above</strong> - if there is nothing in the monitored space (air), the output is signal 0. If there is water, the output is 2 for fresh water or 3 for salt water. If there is any other block, the output is signal 1.<br>",
  "signalslink:block-handbooktext-entitysensor": "The entity sensor detects the presence of entities (players, animals, wild animals, or monsters) in the marked area and can provide information about their count, type, or status on its outputs. The sensor requires charging with one or more temporal gears to operate. The consumption rate depends on the size of the monitored area.<br><strong>Inputs x, y, z</strong> determine the size of the monitored area in blocks.<br>On the <strong>Error</strong> output, the signal is 1 if the sensor is discharged, otherwise 0.<br>The <strong>Output 1 configuration</strong> and <strong>Output 2 configuration</strong> inputs determine what information will be provided on outputs 1 and 2. Each output can thus provide different information based on these input settings.<br>Options are:<br>1 - Output returns <strong>Count</strong>. Number of detected entities.<br>2 - Output returns <strong>Category</strong>. Bit flags of entity category 0–3: player, creature, animal, wild animal.<br>3 - Output returns <strong>Life status</strong>. All detected entities are: 1–dead, 2–alive, or 15–mixed.<br>4 - Output returns <strong>Sex</strong>. All detected entities are: 1–male, 2–female, or 15–mixed.<br>5 - Output returns <strong>Age</strong>. All detected entities are: 1–young, 2–adult, or 15–mixed.<br>6 - Output returns <strong>Species</strong>. All detected entities are: 1–player, 2–animal, 3–wild animal, 4–creature, or 15–mixed.<br>7 - Output returns <strong>Reproductive status</strong>. All detected entities are: 1–ready to mate, 2–pregnant, 3–lactating, or 15–mixed.<br>8 - Output returns <strong>Reproductive status flags</strong>. Bit flags 0–2: ready to mate, pregnant, lactating.<br>9 - Output returns <strong>Minimum generation</strong>. The minimum detected generation is: 0–15. Present entities without a defined generation are ignored.<br>10 - Output returns <strong>Maximum generation</strong>. The maximum detected generation is: 0–15. Present entities without a defined generation are ignored.<br>11 - Output returns <strong>Minimum weight</strong>. The minimum detected weight is: 1–starving, 2–low, 3–decent, 4–good. Present entities without a weight value (not animals) are ignored.<br>12 - Output returns <strong>Maximum weight</strong>. The maximum detected weight is: 1–starving, 2–low, 3–decent, 4–good. Present entities without a weight value (not animals) are ignored.<br>",
  "signalslink:block-handbooktext-managedchute": "The managed chute allows automated transport of items between different blocks.<br>",
  "signalslink:block-handbooktext-managedwallchute": "The wall-embedded managed chute allows automated transport of items between different blocks. It allows transporting items through walls, which can be very useful for hidden transport systems or for transporting items from the cellar or into the cellar without disrupting the cool cellar environment, which is important for long-term food preservation.<br>",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Extends the <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> mod with additional components.<br><br>To monitor a nearby block, you can use the <a href=\"handbook://block-signalslink:blocksensor\">Block Sensor</a>.<br>If you need to monitor your herd of livestock, the <a href=\"handbook://block-signalslink:entitysensor\">Entity Sensor</a> is great for that.<br>If you want to automate some tasks, the <a href=\"handbook://block-signalslink:managedchute\">Managed Chute</a> will serve you well: it can move items between blocks similarly to a chute, but you control it with signals and it gives you much greater control over what gets transported. Its variant, the <a href=\"handbook://block-signalslink:managedwallchute\">wall-embedded Managed Chute</a>, then allows transporting items through walls, which can be very useful for hidden transport systems or for transporting items from the cellar or into the cellar without disrupting the cool cellar environment, important for long-term food preservation."
}
