{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Block Sensor",
  "signals:con-input": "Input",
  "signals:con-output": "Output",
  "signalslink:block-entitysensor-*": "Entity Sensor",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Error state",
  "signals:con-output1": "Output 1",
  "signals:con-output2": "Output 2",
  "signals:con-output1-config": "Output 1 configuration",
  "signals:con-output2-config": "Output 2 configuration",
  "signalslink:ai-hour-test": "Test message from the AI hour.",
  "signalslink:entitysensor-charged": "Charged. Added {0} units. The maximum charge limit is {1} units.",
  "signalslink:entitysensor-already-fully-charged": "This device is already fully charged.",
  "signalslink:blockinfo-charge": "Charge: {0}/{1} units ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "At the current coverage ({0} blocks) it will operate for: ~{1} days",
  "signalslink:blockinfo-charge-empty": "Charge: Empty - needs a temporal gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extension for the Signals mod",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Extends the <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> mod with additional components.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Allows detecting the presence of a block at a selected adjacent position and, based on its type and optionally the input signal, provides information at the output about its state or how full its slots are, etc.<br>Block Sensor determines what block it is and outputs the corresponding signal accordingly.<br><font size=\"20\" color=\"6082B6\">Currently supported blocks are:</font><br><strong>Anvil</strong> - if there is a sufficiently hot ingot on the anvil for forging, the output signal is 1. Otherwise it sends signal 0.<br><strong>Doors, gates, trapdoors</strong> - For doors and gates, you need to monitor the block at ground level on the hinge side. If the block is open, the output signal is 1; if it is closed, the output signal is 0.<br><strong>Chest or generally a container or any blocks that have inventory slots</strong> (e.g. firepit, barrel, trough, etc.). The output signal depends on the input signal.<br>The input signal determines which slot should be scanned.<br>Signal 1-14 selects slots 0-13. The output is information about how full the slot is relative to the maximum stack capacity of the item in that slot, converted to a 0-15 signal.<br>Signal 15 specifies that the sensor should detect the total fill of all slots, e.g. an entire chest.<br><strong>Any other block not listed above</strong> - If there is nothing in the monitored space (air), the output signal is 0. If there is water, the output is 2 for fresh water or 3 for salt water. If there is any other block, the output signal is 1.<br><br><font size=\"21\"><strong>Entity Sensor</strong></font><br>Detects the presence of entities (players, animals, wild animals, or monsters) in the marked area and can provide information on outputs about their count, type, or state. The sensor requires charging for operation using one or more temporal gears. The consumption rate then depends on the size of the monitored area.<br><strong>Inputs x, y, z</strong> determine the size of the monitored area in blocks.<br>On the <strong>Error</strong> output, the signal is 1 if the sensor is discharged, otherwise 0.<br>Inputs <strong>Output 1 configuration</strong> and <strong>Output 2 configuration</strong> determine what information will be provided on outputs 1 and 2. You can obtain different information on each output based on these settings.<br>Options are:<br>1 - Output returns <strong>Count</strong>. The number of detected entities.<br>2 - Output returns <strong>Category</strong>. Bit flags of entity category 0–3: player, creature, animal, wild animal.<br>3 - Output returns <strong>Life state</strong>. All detected entities are: 1–dead, 2–alive, or 15–mixed.<br>4 - Output returns <strong>Gender</strong>. All detected entities are: 1–male, 2–female, or 15–mixed.<br>5 - Output returns <strong>Age</strong>. All detected entities are: 1–young, 2–adult, or 15–mixed.<br>6 - Output returns <strong>Species</strong>. All detected entities are: 1–player, 2–animal, 3–wild animal, 4–creature, or 15–mixed.<br>7 - Output returns <strong>Reproductive state</strong>. All detected entities are: 1–ready to mate, 2–pregnant, 3–lactating, or 15–mixed.<br>8 - Output returns <strong>Reproductive state flags</strong>. Bit flags 0–2: ready to mate, pregnant, lactating.<br>9 - Output returns <strong>Minimum generation</strong>. The minimum detected generation is: 0–15. Present entities without a specified generation are ignored.<br>10 - Output returns <strong>Maximum generation</strong>. The maximum detected generation is: 0–15. Present entities without a specified generation are ignored.<br>11 - Output returns <strong>Minimum weight</strong>. The minimum detected weight is: 1–starving, 2–low, 3–decent, 4–good. Present entities without a specified weight (not animals) are ignored.<br>12 - Output returns <strong>Maximum weight</strong>. The maximum detected weight is: 1–starving, 2–low, 3–decent, 4–good. Present entities without a specified weight (not animals) are ignored.<br><br><font size=\"20\" color=\"6082B6\">We have an AI hour</font><br>We demonstrate how automated translation of mod texts works using AI. <br>"
}
