{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de bloques",
  "signals:con-input": "Entrada",
  "signals:con-output": "Salida",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de error",
  "signals:con-output1": "Salida 1",
  "signals:con-output2": "Salida 2",
  "signals:con-output1-config": "Configuración de salida 1",
  "signals:con-output2-config": "Configuración de salida 2",
  "signalslink:entitysensor-charged": "Cargado. Se añadieron {0} unidades. El límite máximo de carga es {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo ya está completamente cargado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Con la cobertura actual ({0} bloques) funcionará durante: ~{1} días",
  "signalslink:blockinfo-charge-empty": "Carga: Vacía - necesita un engranaje temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensión del mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Amplía el mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> con componentes adicionales.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Permite detectar la presencia de un bloque en una posición adyacente seleccionada y, en función de su tipo y/o de la señal de entrada, proporciona en la salida información sobre su estado o el nivel de llenado de ranuras, etc.<br>El Block Sensor identifica de qué bloque se trata y emite la señal correspondiente en la salida.<br><font size=\"20\" color=\"6082B6\">Los bloques compatibles por ahora son:</font><br><strong>Yunque</strong> - si hay un lingote en el yunque lo suficientemente caliente para forjar, la salida es la señal 1. De lo contrario envía la señal 0.<br><strong>Puertas, portones, trampillas</strong> - En puertas y portones debes vigilar el bloque a ras de suelo en el lado de las bisagras. Si el bloque está abierto, la salida es la señal 1; si está cerrado, la salida es la señal 0.<br><strong>Cofre o, en general, un contenedor o cualquier bloque que tenga ranuras de inventario</strong> (p. ej., hoguera, barril, comedero, etc.). La señal de salida depende de la señal de entrada.<br>La señal de entrada determina qué ranura debe escanearse.<br>La señal 1-14 selecciona las ranuras 0-13. La salida es información sobre el nivel de llenado de la ranura con respecto a la capacidad máxima de apilado del objeto en esa ranura, convertida a una señal 0-15.<br>La señal 15 indica que el sensor debe detectar el llenado total de todas las ranuras, por ejemplo, de un cofre entero.<br><strong>Algún otro bloque no mencionado arriba</strong> - Si no hay nada en el espacio observado (aire), la salida es la señal 0. Si hay agua, la salida es 2 para agua dulce o 3 para agua salada. Si hay cualquier otro bloque, la salida es la señal 1.<br><br><font size=\"21\"><strong>Sensor de criaturas</strong></font><br>Detecta la presencia de entidades (jugadores, animales, animales salvajes o monstruos) en el área marcada y puede proporcionar en las salidas información sobre su cantidad, tipo o estado. El sensor requiere carga para funcionar usando uno o más engranajes temporales (Temporal Gears). La velocidad de consumo depende del tamaño del área observada.<br><strong>Entradas x, y, z</strong> determinan el tamaño del área observada en bloques.<br>En la salida <strong>Error</strong>, la señal es 1 si el sensor está descargado; de lo contrario 0.<br>Las entradas <strong>Configuración de salida 1</strong> y <strong>Configuración de salida 2</strong> determinan qué información se proporcionará en las salidas 1 y 2. Así, cada salida puede proporcionar información distinta en función de estos ajustes de entrada.<br>Las opciones son:<br>1 - La salida devuelve <strong>Cantidad</strong>. Número de entidades detectadas.<br>2 - La salida devuelve <strong>Categoría</strong>. Banderas de bits de la categoría de entidad 0–3: jugador, criatura, animal, animal salvaje.<br>3 - La salida devuelve <strong>Estado vital</strong>. Todas las entidades detectadas son: 1–muertas, 2–vivas o 15–mixtas.<br>4 - La salida devuelve <strong>Sexo</strong>. Todas las entidades detectadas son: 1–macho, 2–hembra o 15–mixtas.<br>5 - La salida devuelve <strong>Edad</strong>. Todas las entidades detectadas son: 1–cría, 2–adulto o 15–mixtas.<br>6 - La salida devuelve <strong>Especie</strong>. Todas las entidades detectadas son: 1–jugador, 2–animal, 3–animal salvaje, 4–criatura o 15–mixtas.<br>7 - La salida devuelve <strong>Estado reproductivo</strong>. Todas las entidades detectadas son: 1–listas para aparearse, 2–preñadas, 3–lactando o 15–mixtas.<br>8 - La salida devuelve <strong>Banderas del estado reproductivo</strong>. Banderas de bits 0–2: listas para aparearse, preñadas, lactando.<br>9 - La salida devuelve <strong>Generación mínima</strong>. La generación mínima detectada es: 0–15. Las entidades presentes sin generación especificada se ignoran.<br>10 - La salida devuelve <strong>Generación máxima</strong>. La generación máxima detectada es: 0–15. Las entidades presentes sin generación especificada se ignoran.<br>11 - La salida devuelve <strong>Peso mínimo</strong>. El peso mínimo detectado es: 1–hambriento, 2–bajo, 3–decente, 4–bueno. Las entidades presentes sin peso especificado (no son animales) se ignoran.<br>12 - La salida devuelve <strong>Peso máximo</strong>. El peso máximo detectado es: 1–hambriento, 2–bajo, 3–decente, 4–bueno. Las entidades presentes sin peso especificado (no son animales) se ignoran.<br><br><font size=\"21\"><strong>Prueba de localización</strong></font><br>Permite presentar la localización con ayuda de IA. Etc.<br>"
}
