{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de bloques",
  "signals:con-input": "Entrada",
  "signals:con-output": "Salida",
  "signals:con-target": "Objetivo",
  "signals:con-source": "Origen",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de error",
  "signals:con-output1": "Salida 1",
  "signals:con-output2": "Salida 2",
  "signals:con-output1-config": "Configuración de salida 1",
  "signals:test": "Estamos probando traducciones en la lección de IA.",
  "signals:con-output2-config": "Configuración de salida 2",
  "signalslink:entitysensor-charged": "Cargado. Se han añadido {0} unidades. El límite máximo de carga es de {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo ya está completamente cargado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Con la cobertura actual ({0} bloques) funcionará: ~{1} días",
  "signalslink:blockinfo-charge-empty": "Carga: Vacía - necesita un engranaje temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensión del mod Signals",
  "signalslink:block-managedchute-*": "Conducto controlado",
  "signalslink:block-managedwallchute-wood-*": "Conducto controlado empotrado en madera",
  "signalslink:block-managedwallchute-rock-*": "Conducto controlado empotrado en roca",
  "signalslink:block-managedwallchute-cobble-*": "Conducto controlado empotrado en baldosas",
  "signalslink:managedchute-conditions": "Condiciones",
  "signalslink:managedchute-info-unlimited": "Transporta de forma permanente",
  "signalslink:managedchute-info-remaining": "Transporta {0}",
  "signalslink:block-handbooktitle-signalslink": "Funciones de señales",
  "signalslink:block-handbooktext-blocksensor": "El sensor de bloques detecta la presencia de un bloque en la posición adyacente seleccionada y, según su tipo o la señal de entrada, proporciona en la salida información sobre su estado o el llenado de sus ranuras.<br><font size=\"20\" color=\"6082B6\">Los bloques compatibles por ahora son:</font><br><strong>Yunque</strong> - si hay un lingote lo bastante caliente para forjar en el yunque, la salida es la señal 1. De lo contrario envía la señal 0.<br><strong>Puertas, portones, trampillas</strong> - en puertas y portones hay que vigilar el bloque del suelo en el lado de las bisagras. Si el bloque está abierto, la salida es la señal 1; si está cerrado, la salida es la señal 0.<br><strong>Cofre o, en general, un contenedor o cualquier bloque que tenga ranuras de inventario</strong> (p. ej., hogar, barril, comedero, etc.). En la salida hay una señal según la señal de entrada.<br>La señal de entrada determina qué ranura debe escanearse.<br>La señal 1-14 determina las ranuras 0-13. La salida es información del llenado de la ranura respecto a la capacidad máxima de la pila del objeto en esa ranura, convertida a una señal 0-15.<br>La señal 15 determina que el sensor debe detectar el llenado total de todas las ranuras, p. ej. de un cofre entero.<br><strong>Algún otro bloque no indicado arriba</strong> - si no hay nada en el espacio vigilado (hay aire), la salida es la señal 0. Si hay agua, la salida es 2-agua dulce o 3-agua salada. Si hay cualquier otro bloque, la salida es la señal 1.<br>",
  "signalslink:block-handbooktext-entitysensor": "El sensor de entidades detecta la presencia de entidades (jugadores, animales, animales salvajes o monstruos) en el área marcada y puede proporcionar en sus salidas información sobre su cantidad, tipo o estado. Para funcionar, el sensor requiere cargarse con uno o más engranajes temporales (Temporal gears). La velocidad de consumo depende del tamaño del área vigilada.<br><strong>Entradas x, y, z</strong> determinan el tamaño del área vigilada en bloques.<br>En la salida <strong>Error</strong> hay señal 1 si el sensor está descargado; en caso contrario, 0.<br>Las entradas <strong>Configuración de salida 1</strong> y <strong>Configuración de salida 2</strong> determinan qué información se proporcionará en las salidas 1 y 2. Así, en cada salida puedes obtener información distinta según estas configuraciones.<br>Las opciones son:<br>1 - La salida devuelve <strong>Cantidad</strong>. Número de entidades detectadas.<br>2 - La salida devuelve <strong>Categoría</strong>. Indicadores de bits de la categoría de entidad 0–3: jugador, criatura, animal, animal salvaje.<br>3 - La salida devuelve <strong>Estado de vida</strong>. Todas las entidades detectadas son: 1–muertas, 2–vivas o 15–mixtas.<br>4 - La salida devuelve <strong>Sexo</strong>. Todas las entidades detectadas son: 1–macho, 2–hembra o 15–mixtas.<br>5 - La salida devuelve <strong>Edad</strong>. Todas las entidades detectadas son: 1–cría, 2–adulto o 15–mixtas.<br>6 - La salida devuelve <strong>Especie</strong>. Todas las entidades detectadas son: 1–jugador, 2–animal, 3–animal salvaje, 4–criatura o 15–mixtas.<br>7 - La salida devuelve <strong>Estado reproductivo</strong>. Todas las entidades detectadas son: 1–listas para aparearse, 2–preñadas, 3–lactando o 15–mixtas.<br>8 - La salida devuelve <strong>Indicadores de estado reproductivo</strong>. Indicadores de bits 0–2: listas para aparearse, preñadas, lactando.<br>9 - La salida devuelve <strong>Generación mínima</strong>. La generación mínima detectada es: 0–15. Las entidades presentes sin generación definida se ignoran.<br>10 - La salida devuelve <strong>Generación máxima</strong>. La generación máxima detectada es: 0–15. Las entidades presentes sin generación definida se ignoran.<br>11 - La salida devuelve <strong>Peso mínimo</strong>. El peso mínimo detectado es: 1–hambriento, 2–bajo, 3–decente, 4–bueno. Las entidades presentes sin valor de peso (no son animales) se ignoran.<br>12 - La salida devuelve <strong>Peso máximo</strong>. El peso máximo detectado es: 1–hambriento, 2–bajo, 3–decente, 4–bueno. Las entidades presentes sin valor de peso (no son animales) se ignoran.<br>",
  "signalslink:block-handbooktext-managedchute": "El conducto controlado permite el transporte automatizado de objetos entre distintos bloques.<br>",
  "signalslink:block-handbooktext-managedwallchute": "El conducto controlado empotrado en la pared permite el transporte automatizado de objetos entre distintos bloques. Permite transportar objetos a través de paredes, lo cual puede ser muy útil para sistemas de transporte ocultos o para transportar objetos desde el sótano o hacia el sótano sin alterar el ambiente fresco del sótano, importante para la conservación de alimentos a largo plazo.<br>",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Amplía el mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> con componentes adicionales.<br><br>Para vigilar algún bloque cercano, puedes usar el <a href=\"handbook://block-signalslink:blocksensor\">Sensor de bloques</a>.<br>Si necesitas vigilar tu rebaño de ganado, el <a href=\"handbook://block-signalslink:entitysensor\">Sensor de entidades</a> es perfecto para ello.<br>Si quieres automatizar algunas tareas, te vendrá muy bien el <a href=\"handbook://block-signalslink:managedchute\">Conducto controlado</a>, que puede transportar objetos entre bloques de forma similar a un conducto, pero lo controlas con señales y te da mucho mayor control sobre lo que se transporta. Su variante, el <a href=\"handbook://block-signalslink:managedwallchute\">Conducto controlado empotrado en la pared</a>, permite transportar objetos a través de paredes, lo cual puede ser muy útil para sistemas de transporte ocultos o para transportar objetos desde el sótano o hacia el sótano sin alterar el ambiente fresco del sótano, importante para la conservación de alimentos a largo plazo."
}
