{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Capteur de blocs",
  "signals:con-input": "Entrée",
  "signals:con-output": "Sortie",
  "signalslink:block-entitysensor-*": "Capteur d'entités",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "État d'erreur",
  "signals:con-output1": "Sortie 1",
  "signals:con-output2": "Sortie 2",
  "signals:con-output1-config": "Configuration de la sortie 1",
  "signals:con-output2-config": "Configuration de la sortie 2",
  "signalslink:ai-hour-test": "Message de test de l'heure IA.",
  "signalslink:entitysensor-charged": "Chargé. {0} unités ajoutées. La limite de charge maximale est de {1} unités.",
  "signalslink:entitysensor-already-fully-charged": "Cet appareil est déjà entièrement chargé.",
  "signalslink:blockinfo-charge": "Charge : {0}/{1} unités ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Avec la couverture actuelle ({0} blocs), il fonctionnera : ~{1} jours",
  "signalslink:blockinfo-charge-empty": "Charge : Vide - nécessite un engrenage temporel",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extension du mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Étend le mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> avec des composants supplémentaires.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Permet de détecter la présence d'un bloc sur une position voisine sélectionnée et, selon son type et éventuellement le signal d'entrée, fournit en sortie des informations sur son état ou le remplissage des emplacements, etc.<br>Le Block Sensor détermine de quel bloc il s'agit et fournit en sortie le signal correspondant.<br><font size=\"20\" color=\"6082B6\">Blocs pris en charge pour l'instant :</font><br><strong>Enclume</strong> - s'il y a sur l'enclume un lingot suffisamment chaud pour le forgeage, le signal de sortie est 1. Sinon, il envoie le signal 0.<br><strong>Portes, portails, trappes</strong> - Pour les portes et portails, il faut surveiller le bloc au niveau du sol du côté des gonds. Si le bloc est ouvert, le signal de sortie est 1 ; s'il est fermé, le signal de sortie est 0.<br><strong>Coffre ou plus généralement conteneur ou tout bloc ayant des emplacements d'inventaire</strong> (p. ex. foyer, tonneau, auge, etc.). Le signal de sortie dépend du signal d'entrée.<br>Le signal d'entrée détermine quel emplacement doit être scanné.<br>Le signal 1-14 correspond aux emplacements 0-13. La sortie donne l'information de remplissage de l'emplacement par rapport à la capacité maximale de pile de l'objet dans cet emplacement, convertie en un signal 0-15.<br>Le signal 15 indique que le capteur doit détecter le remplissage total de tous les emplacements, par ex. d'un coffre entier.<br><strong>Tout autre bloc non mentionné ci-dessus</strong> - S'il n'y a rien dans l'espace surveillé (air), le signal de sortie est 0. S'il y a de l'eau, la sortie est 2-eau douce ou 3-eau salée. S'il y a n'importe quel autre bloc, le signal de sortie est 1.<br><br><font size=\"21\"><strong>Capteur de créatures</strong></font><br>Détecte la présence d'entités (joueurs, animaux, animaux sauvages ou monstres) dans la zone marquée et peut fournir en sortie des informations sur leur nombre, leur type ou leur état. Pour fonctionner, le capteur nécessite une charge via un ou plusieurs engrenages temporels (Temporal gears). La vitesse de consommation dépend ensuite de la taille de la zone surveillée.<br><strong>Entrées x, y, z</strong> déterminent la taille de la zone surveillée en blocs.<br>Sur la sortie <strong>Erreur</strong>, le signal est 1 si le capteur est déchargé, sinon 0.<br>Les entrées <strong>Configuration de la sortie 1</strong> et <strong>Configuration de la sortie 2</strong> déterminent quelles informations seront fournies sur les sorties 1 et 2. Vous pouvez ainsi obtenir une information différente sur chaque sortie, selon le réglage de ces entrées.<br>Options :<br>1 - La sortie renvoie <strong>Nombre</strong>. Nombre d'entités détectées.<br>2 - La sortie renvoie <strong>Catégorie</strong>. Drapeaux de bits de catégorie d'entités 0–3 : joueur, créature, animal, animal sauvage.<br>3 - La sortie renvoie <strong>État de vie</strong>. Toutes les entités détectées sont : 1–mortes, 2–vivantes ou 15–mixtes.<br>4 - La sortie renvoie <strong>Sexe</strong>. Toutes les entités détectées sont : 1–mâle, 2–femelle ou 15–mixtes.<br>5 - La sortie renvoie <strong>Âge</strong>. Toutes les entités détectées sont : 1–jeune, 2–adulte ou 15–mixtes.<br>6 - La sortie renvoie <strong>Espèce</strong>. Toutes les entités détectées sont : 1–joueur, 2–animal, 3–animal sauvage, 4–créature ou 15–mixtes.<br>7 - La sortie renvoie <strong>État reproductif</strong>. Toutes les entités détectées sont : 1–prêtes à s'accoupler, 2–gestantes, 3–allaitantes ou 15–mixtes.<br>8 - La sortie renvoie <strong>Drapeaux de l'état reproductif</strong>. Drapeaux de bits 0–2 : prêtes à s'accoupler, gestantes, allaitantes.<br>9 - La sortie renvoie <strong>Génération minimale</strong>. La génération minimale détectée est : 0–15. Les entités présentes sans génération définie sont ignorées.<br>10 - La sortie renvoie <strong>Génération maximale</strong>. La génération maximale détectée est : 0–15. Les entités présentes sans génération définie sont ignorées.<br>11 - La sortie renvoie <strong>Poids minimal</strong>. Le poids minimal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans poids défini (pas des animaux) sont ignorées.<br>12 - La sortie renvoie <strong>Poids maximal</strong>. Le poids maximal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans poids défini (pas des animaux) sont ignorées.<br><br><font size=\"20\" color=\"6082B6\">Nous avons une heure IA</font><br>Nous montrons comment fonctionne la traduction automatisée des textes du mod à l'aide de l'IA. <br>"
}
