{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Capteur de blocs",
  "signals:con-input": "Entrée",
  "signals:con-output": "Sortie",
  "signals:con-target": "Cible",
  "signals:con-source": "Source",
  "signalslink:block-entitysensor-*": "Capteur d'entités",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "État d'erreur",
  "signals:con-output1": "Sortie 1",
  "signals:con-output2": "Sortie 2",
  "signals:con-output1-config": "Configuration de la sortie 1",
  "signals:test": "Nous testons des traductions pendant le cours d'IA.",
  "signals:con-output2-config": "Configuration de la sortie 2",
  "signalslink:entitysensor-charged": "Chargé. {0} unités ajoutées. La limite maximale de charge est de {1} unités.",
  "signalslink:entitysensor-already-fully-charged": "Cet appareil est déjà entièrement chargé.",
  "signalslink:blockinfo-charge": "Charge : {0}/{1} unités ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Avec la couverture actuelle ({0} blocs), il fonctionnera : ~{1} jours",
  "signalslink:blockinfo-charge-empty": "Charge : Vide - nécessite un engrenage temporel",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extension du mod Signals",
  "signalslink:block-managedchute-*": "Goulotte contrôlée",
  "signalslink:block-managedwallchute-wood-*": "Goulotte contrôlée encastrée dans le bois",
  "signalslink:block-managedwallchute-rock-*": "Goulotte contrôlée encastrée dans la pierre",
  "signalslink:block-managedwallchute-cobble-*": "Goulotte contrôlée encastrée dans les dalles",
  "signalslink:managedchute-conditions": "Conditions",
  "signalslink:managedchute-info-unlimited": "Transporte en continu",
  "signalslink:managedchute-info-remaining": "Transporte {0}",
  "signalslink:block-handbooktitle-signalslink": "Fonctions de signal",
  "signalslink:block-handbooktext-blocksensor": "Le capteur de blocs détecte la présence d'un bloc à la position adjacente sélectionnée et, selon son type ou le signal d'entrée, fournit en sortie des informations sur son état ou le remplissage des emplacements.<br><font size=\"20\" color=\"6082B6\">Les blocs pris en charge pour l'instant sont :</font><br><strong>Enclume</strong> - s'il y a un lingot suffisamment chaud pour forger sur l'enclume, la sortie est le signal 1. Sinon, il envoie le signal 0.<br><strong>Portes, portails, trappes</strong> - pour les portes et portails, il faut surveiller le bloc au sol du côté des charnières. Si le bloc est ouvert, la sortie est le signal 1 ; s'il est fermé, la sortie est le signal 0.<br><strong>Coffre ou, plus généralement, un conteneur ou n'importe quel bloc ayant des emplacements d'inventaire</strong> (p. ex. foyer, tonneau, auge, etc.). En sortie, le signal dépend du signal d'entrée.<br>Le signal d'entrée détermine quel emplacement doit être scanné.<br>Le signal 1-14 correspond aux emplacements 0-13. La sortie est l'information de remplissage de l'emplacement par rapport à la capacité maximale de pile de l'objet dans cet emplacement, convertie en un signal 0-15.<br>Le signal 15 indique que le capteur doit détecter le remplissage total de tous les emplacements, par ex. d'un coffre entier.<br><strong>Un autre bloc non listé ci-dessus</strong> - s'il n'y a rien dans l'espace surveillé (air), la sortie est le signal 0. S'il y a de l'eau, la sortie est 2-eau douce ou 3-eau salée. S'il y a n'importe quel autre bloc, la sortie est le signal 1.<br>",
  "signalslink:block-handbooktext-entitysensor": "Le capteur d'entités détecte la présence d'entités (joueurs, animaux, animaux sauvages ou monstres) dans la zone marquée et peut fournir sur ses sorties des informations sur leur nombre, leur type ou leur état. Pour fonctionner, le capteur nécessite une charge avec un ou plusieurs engrenages temporels (Temporal gears). La vitesse de consommation dépend de la taille de la zone surveillée.<br><strong>Entrées x, y, z</strong> déterminent la taille de la zone surveillée en blocs.<br>Sur la sortie <strong>Erreur</strong>, le signal est 1 si le capteur est déchargé, sinon 0.<br>Les entrées <strong>Configuration de la sortie 1</strong> et <strong>Configuration de la sortie 2</strong> déterminent quelles informations seront fournies sur les sorties 1 et 2. Chaque sortie peut ainsi fournir des informations différentes selon ces réglages.<br>Options :<br>1 - La sortie renvoie <strong>Nombre</strong>. Nombre d'entités détectées.<br>2 - La sortie renvoie <strong>Catégorie</strong>. Drapeaux binaires de la catégorie d'entité 0–3 : joueur, créature, animal, animal sauvage.<br>3 - La sortie renvoie <strong>État de vie</strong>. Toutes les entités détectées sont : 1–mortes, 2–vivantes ou 15–mixtes.<br>4 - La sortie renvoie <strong>Sexe</strong>. Toutes les entités détectées sont : 1–mâle, 2–femelle ou 15–mixtes.<br>5 - La sortie renvoie <strong>Âge</strong>. Toutes les entités détectées sont : 1–jeune, 2–adulte ou 15–mixtes.<br>6 - La sortie renvoie <strong>Espèce</strong>. Toutes les entités détectées sont : 1–joueur, 2–animal, 3–animal sauvage, 4–créature ou 15–mixtes.<br>7 - La sortie renvoie <strong>Statut reproductif</strong>. Toutes les entités détectées sont : 1–prêtes à s'accoupler, 2–gestantes, 3–allaitantes ou 15–mixtes.<br>8 - La sortie renvoie <strong>Drapeaux du statut reproductif</strong>. Drapeaux binaires 0–2 : prêtes à s'accoupler, gestantes, allaitantes.<br>9 - La sortie renvoie <strong>Génération minimale</strong>. La génération minimale détectée est : 0–15. Les entités présentes sans génération définie sont ignorées.<br>10 - La sortie renvoie <strong>Génération maximale</strong>. La génération maximale détectée est : 0–15. Les entités présentes sans génération définie sont ignorées.<br>11 - La sortie renvoie <strong>Poids minimal</strong>. Le poids minimal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans valeur de poids (pas des animaux) sont ignorées.<br>12 - La sortie renvoie <strong>Poids maximal</strong>. Le poids maximal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans valeur de poids (pas des animaux) sont ignorées.<br>",
  "signalslink:block-handbooktext-managedchute": "La goulotte contrôlée permet le transport automatisé d'objets entre différents blocs.<br>",
  "signalslink:block-handbooktext-managedwallchute": "La goulotte contrôlée encastrée dans le mur permet le transport automatisé d'objets entre différents blocs. Elle permet de transporter des objets à travers les murs, ce qui peut être très utile pour des systèmes de transport cachés ou pour transporter des objets depuis la cave ou vers la cave sans perturber l'environnement frais de la cave, important pour la conservation des aliments à long terme.<br>",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Étend le mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> avec des composants supplémentaires.<br><br>Pour surveiller un bloc à proximité, vous pouvez utiliser le <a href=\"handbook://block-signalslink:blocksensor\">Capteur de blocs</a>.<br>Si vous devez surveiller votre troupeau de bétail, le <a href=\"handbook://block-signalslink:entitysensor\">Capteur d'entités</a> est parfait pour cela.<br>Si vous voulez automatiser certaines tâches, la <a href=\"handbook://block-signalslink:managedchute\">goulotte contrôlée</a> vous sera très utile : elle peut transporter des objets entre des blocs un peu comme une goulotte, mais vous la contrôlez avec des signaux et elle vous donne bien plus de contrôle sur ce qui est transporté. Sa variante, la <a href=\"handbook://block-signalslink:managedwallchute\">goulotte contrôlée encastrée dans le mur</a>, permet ensuite de transporter des objets à travers les murs, ce qui peut être très utile pour des systèmes de transport cachés ou pour transporter des objets depuis la cave ou vers la cave sans perturber l'environnement frais de la cave, important pour la conservation des aliments à long terme."
}
