{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Capteur de blocs",
  "signals:con-input": "Entrée",
  "signals:con-output": "Sortie",
  "signalslink:block-entitysensor-*": "Capteur d'entités",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "État d'erreur",
  "signals:con-output1": "Sortie 1",
  "signals:con-output2": "Sortie 2",
  "signals:con-output1-config": "Configuration de la sortie 1",
  "signals:con-output2-config": "Configuration de la sortie 2",
  "signalslink:entitysensor-charged": "Chargé. {0} unités ajoutées. La limite maximale de charge est de {1} unités.",
  "signalslink:entitysensor-already-fully-charged": "Cet appareil est déjà complètement chargé.",
  "signalslink:blockinfo-charge": "Charge : {0}/{1} unités ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Avec la couverture actuelle ({0} blocs), il fonctionnera pendant : ~{1} jours",
  "signalslink:blockinfo-charge-empty": "Charge : Vide - nécessite un engrenage temporel",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extension du mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Étend le mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> avec des composants supplémentaires.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Permet de détecter la présence d'un bloc sur une position adjacente sélectionnée et, selon son type ou le signal d'entrée, fournit en sortie des informations sur son état ou le remplissage des emplacements, etc.<br>Le Block Sensor identifie de quel bloc il s'agit et fournit en sortie un signal correspondant.<br><font size=\"20\" color=\"6082B6\">Les blocs actuellement pris en charge sont :</font><br><strong>Enclume</strong> - S'il y a sur l'enclume un lingot suffisamment chaud pour forger, la Sortie est le signal 1. Sinon, il envoie le signal 0.<br><strong>Portes, portails, trappes</strong> - Pour les portes et portails, il faut surveiller le bloc au sol du côté des charnières. Si le bloc est ouvert, la Sortie est le signal 1 ; s'il est fermé, la Sortie est le signal 0.<br><strong>Coffre ou, plus généralement, un conteneur ou tout bloc possédant des emplacements d'inventaire</strong> (p. ex. foyer, tonneau, auge, etc.). En sortie, le signal dépend du signal d'entrée.<br>Le signal d'entrée détermine quel emplacement doit être scanné.<br>Le signal 1-14 sélectionne les emplacements 0-13. La sortie est l'information de remplissage de l'emplacement par rapport à la capacité maximale de pile de l'objet dans cet emplacement, convertie en un signal 0-15.<br>Le signal 15 indique que le capteur doit détecter le remplissage total de tous les emplacements, p. ex. d'un coffre entier.<br><strong>Un autre bloc non listé ci-dessus</strong> - S'il n'y a rien dans l'espace surveillé (air), la Sortie est le signal 0. S'il y a de l'eau, la sortie est 2 pour l'eau douce ou 3 pour l'eau salée. S'il y a n'importe quel autre bloc, la Sortie est le signal 1.<br><br><font size=\"21\"><strong>Capteur d'entités</strong></font><br>Détecte la présence d'entités (joueurs, animaux, animaux sauvages ou monstres) dans une zone marquée et peut fournir en sortie des informations sur leur nombre, leur type ou leur état. Pour fonctionner, le capteur nécessite d'être chargé avec un ou plusieurs engrenages temporels (Temporal gears). La vitesse de consommation dépend de la taille de la zone surveillée.<br><strong>Entrées x, y, z</strong> déterminent la taille de la zone surveillée en blocs.<br>Sur la sortie <strong>Erreur</strong>, le signal est 1 si le capteur est déchargé, sinon 0.<br>Les entrées <strong>Configuration de la sortie 1</strong> et <strong>Configuration de la sortie 2</strong> déterminent quelles informations seront fournies sur les sorties 1 et 2. Vous pouvez ainsi obtenir des informations différentes sur chaque sortie, en fonction de ces réglages d'entrée.<br>Options :<br>1 - La sortie renvoie <strong>Nombre</strong>. Nombre d'entités détectées.<br>2 - La sortie renvoie <strong>Catégorie</strong>. Drapeaux de bits de la catégorie d'entité 0–3 : joueur, créature, animal, animal sauvage.<br>3 - La sortie renvoie <strong>État de vie</strong>. Toutes les entités détectées sont : 1–mortes, 2–vivantes ou 15–mixtes.<br>4 - La sortie renvoie <strong>Sexe</strong>. Toutes les entités détectées sont : 1–mâle, 2–femelle ou 15–mixtes.<br>5 - La sortie renvoie <strong>Âge</strong>. Toutes les entités détectées sont : 1–jeune, 2–adulte ou 15–mixtes.<br>6 - La sortie renvoie <strong>Espèce</strong>. Toutes les entités détectées sont : 1–joueur, 2–animal, 3–animal sauvage, 4–créature ou 15–mixtes.<br>7 - La sortie renvoie <strong>État reproductif</strong>. Toutes les entités détectées sont : 1–prêtes à s'accoupler, 2–gestantes, 3–allaitantes ou 15–mixtes.<br>8 - La sortie renvoie <strong>Drapeaux de l'état reproductif</strong>. Drapeaux de bits 0–2 : prêtes à s'accoupler, gestantes, allaitantes.<br>9 - La sortie renvoie <strong>Génération minimale</strong>. La génération minimale détectée est : 0–15. Les entités présentes sans génération sont ignorées.<br>10 - La sortie renvoie <strong>Génération maximale</strong>. La génération maximale détectée est : 0–15. Les entités présentes sans génération sont ignorées.<br>11 - La sortie renvoie <strong>Poids minimum</strong>. Le poids minimum détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans poids (non des animaux) sont ignorées.<br>12 - La sortie renvoie <strong>Poids maximum</strong>. Le poids maximum détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans poids (non des animaux) sont ignorées.<br><br>"
}
