{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Capteur de blocs",
  "signals:con-input": "Entrée",
  "signals:con-output": "Sortie",
  "signals:con-target": "Cible",
  "signals:con-source": "Source",
  "signalslink:block-entitysensor-*": "Capteur d'entités",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "État d'erreur",
  "signals:con-output1": "Sortie 1",
  "signals:con-output2": "Sortie 2",
  "signals:con-output1-config": "Configuration de la sortie 1",
  "signals:test": "Nous testons des traductions pendant le cours d'IA.",
  "signals:con-output2-config": "Configuration de la sortie 2",
  "signalslink:entitysensor-charged": "Chargé. {0} unités ajoutées. La limite maximale de charge est de {1} unités.",
  "signalslink:entitysensor-already-fully-charged": "Cet appareil est déjà entièrement chargé.",
  "signalslink:blockinfo-charge": "Charge : {0}/{1} unités ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Avec la couverture actuelle ({0} blocs), il fonctionnera : ~{1} jours",
  "signalslink:blockinfo-charge-empty": "Charge : Vide - nécessite un engrenage temporel",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extension du mod Signals",
  "signalslink:block-managedchute-*": "Goulotte contrôlée",
  "signalslink:block-managedwallchute-wood-*": "Goulotte contrôlée encastrée dans le bois",
  "signalslink:block-managedwallchute-rock-*": "Goulotte contrôlée encastrée dans la pierre",
  "signalslink:block-managedwallchute-cobble-*": "Goulotte contrôlée encastrée dans les dalles",
  "signalslink:managedchute-conditions": "Conditions",
  "signalslink:managedchute-info-unlimited": "Transporte en continu",
  "signalslink:managedchute-info-remaining": "Transporte {0}",
  "signalslink:block-handbooktitle-signalslink": "Fonctions de signal",
  "signalslink:block-handbooktext-blocksensor": "    Le capteur de blocs détecte la présence d’un bloc à une position voisine sélectionnée et, en fonction de son type et éventuellement du signal d’entrée, fournit en sortie une information sur son état ou sur le remplissage de ses emplacements.    <br>    <font size=\"20\" color=\"6082B6\">Les blocs actuellement pris en charge sont :<\\/font>    <br>    <strong>Enclume<\\/strong> - s’il y a sur l’enclume un lingot suffisamment chauffé pour la forge, la sortie envoie le signal 1. Sinon, elle envoie le signal 0.    <br>    <strong>Portes, portails, trappes<\\/strong> - pour les portes et les portails, il faut surveiller le bloc au niveau du sol, du côté des gonds. Si le bloc est ouvert, la sortie envoie le signal 1 ; s’il est fermé, la sortie envoie le signal 0.    <br>    <strong>Coffre ou, plus généralement, conteneur, ou tout bloc possédant des emplacements d’inventaire<\\/strong> (par ex. foyer, tonneau, auge, etc.). La sortie envoie un signal selon le signal d’entrée.    <br>    Le signal d’entrée détermine quel emplacement doit être analysé.    <br>    Un signal de 1 à 14 désigne les emplacements 0 à 13. La sortie fournit une information sur le remplissage de l’emplacement par rapport à la capacité maximale de pile de l’objet dans cet emplacement, convertie en un signal de 0 à 15.    <br>    Un signal de 15 indique que le capteur doit détecter le remplissage global de tous les emplacements, par ex. de tout un coffre.    <br>    <strong>Tout autre bloc non mentionné ci‑dessus<\\/strong> - s’il n’y a rien dans l’espace surveillé (c’est-à-dire de l’air), la sortie envoie le signal 0. S’il y a de l’eau, la sortie envoie 2 pour l’eau douce ou 3 pour l’eau salée. S’il y a tout autre bloc, la sortie envoie le signal 1.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    Le capteur d’entités détecte la présence d’entités (joueurs, animaux domestiques, animaux sauvages ou monstres) dans une zone définie et peut fournir en sortie des informations sur leur nombre, leur type ou leur état. Pour fonctionner, le capteur doit être chargé avec une ou plusieurs <em>Temporal gears<\\/em>. La vitesse de consommation dépend ensuite de la taille de la zone surveillée.    <br>    Les entrées <strong>x, y, z<\\/strong> déterminent la taille de la zone surveillée en blocs.    <br>    Sur la sortie <strong>Erreur<\\/strong>, le signal est 1 si le capteur est déchargé, sinon 0.    <br>    Les entrées <strong>Réglage de la sortie 1<\\/strong> et <strong>Réglage de la sortie 2<\\/strong> déterminent quelles informations seront fournies sur les sorties 1 et 2. Chaque sortie peut donc fournir une information différente, selon le réglage de ces entrées.    <br>    Les options sont :    <br>    1 - La sortie renvoie le <strong>Nombre<\\/strong>. Nombre d’entités détectées.    <br>    2 - La sortie renvoie la <strong>Catégorie<\\/strong>. Indicateurs de bits pour la catégorie des entités 0–3 : joueur, créature, animal domestique, animal sauvage.    <br>    3 - La sortie renvoie l’<strong>État de vie<\\/strong>. Toutes les entités détectées sont : 1–mortes, 2–vivantes ou 15–mixtes.    <br>    4 - La sortie renvoie le <strong>Sexe<\\/strong>. Toutes les entités détectées sont : 1–mâles, 2–femelles ou 15–mixtes.    <br>    5 - La sortie renvoie l’<strong>Âge<\\/strong>. Toutes les entités détectées sont : 1–jeunes, 2–adultes ou 15–mixtes.    <br>    6 - La sortie renvoie l’<strong>Espèce<\\/strong>. Toutes les entités détectées sont : 1–joueur, 2–animal domestique, 3–animal sauvage, 4–créature ou 15–mixtes.    <br>    7 - La sortie renvoie l’<strong>État de reproduction<\\/strong>. Toutes les entités détectées sont : 1–prêtes à s’accoupler, 2–gestantes, 3–allaitantes ou 15–mixtes.    <br>    8 - La sortie renvoie les <strong>Indicateurs d’état de reproduction<\\/strong>. Indicateurs de bits 0–2 : prêtes à s’accoupler, gestantes, allaitantes.    <br>    9 - La sortie renvoie la <strong>Génération minimale<\\/strong>. La génération minimale détectée est comprise entre 0 et 15. Les entités présentes sans génération définie sont ignorées.    <br>    10 - La sortie renvoie la <strong>Génération maximale<\\/strong>. La génération maximale détectée est comprise entre 0 et 15. Les entités présentes sans génération définie sont ignorées.    <br>    11 - La sortie renvoie le <strong>Poids minimal<\\/strong>. Le poids minimal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans indication de poids (qui ne sont pas des animaux) sont ignorées.    <br>    12 - La sortie renvoie le <strong>Poids maximal<\\/strong>. Le poids maximal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans indication de poids (qui ne sont pas des animaux) sont ignorées.    <br>",
  "signalslink:block-handbooktext-managedchute": "    Le conduit géré permet le transport automatisé d’objets entre différents blocs.",
  "signalslink:block-handbooktext-managedwallchute": "    Le conduit géré intégré dans un mur permet le transport automatisé d’objets entre différents blocs. Il permet de transporter des objets à travers les murs, ce qui peut être très utile pour des systèmes de transport cachés    ou pour transporter des objets depuis ou vers une cave sans compromettre l’environnement frais de la cave, important pour la conservation à long terme des denrées alimentaires.",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink<\\/strong><\\/font>    <br>    Étend le mod <a href=\"handbook://signals:craftinginfo-signals\">Signals<\\/a> avec des composants supplémentaires.    <br>    <br>    Pour surveiller un bloc dans les environs, vous pouvez utiliser le <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Capteur de blocs<\\/a>.    <br>    Si vous avez besoin de surveiller votre troupeau de bétail, le <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Capteur d’entités<\\/a> s’y prête parfaitement.    <br>    Si vous souhaitez automatiser certaines tâches, le <a href=\"handbook://block-signalslink:managedchute-north-down\">Conduit géré<\\/a>, qui peut transporter des objets entre les blocs de manière similaire à un toboggan mais que vous contrôlez par signaux, vous sera très utile    et vous donne un contrôle bien plus important sur ce qui est transporté. Sa variante <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Conduit géré intégré dans un mur<\\/a> permet ensuite de transporter des objets à travers les murs, ce qui peut être très utile pour des systèmes de transport cachés    ou pour transporter des objets depuis ou vers une cave sans compromettre l’environnement frais de la cave, important pour la conservation à long terme des denrées alimentaires.",
  "signalslink:usageinfo-paperconditions-text": "    Certains blocs du mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink<\\/a> permettent d’utiliser des <strong>conditions sur parchemin<\\/strong> :    <br>    • <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Capteur de blocs<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedchute-north-down\">Conduit géré<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Conduit géré intégré dans un mur<\\/a>    <br>    <font size=\"20\" color=\"6082B6\">Conditions sur parchemin<\\/font>    Les <strong>conditions sur parchemin<\\/strong> sont des conditions écrites sur un <a href=\"handbook://item-paper-parchment\">parchemin<\\/a>. Ces conditions peuvent être utilisées pour influencer le comportement d’un bloc, par exemple pour piloter les signaux de sortie ou pour filtrer les objets dans les conduits.    <br>    Les conditions sont écrites en blocs (paragraphes). Chaque bloc se compose d’une ou de plusieurs lignes, chaque ligne contenant une condition. Toutes les conditions <strong>d’un même bloc<\\/strong> sont évaluées en appliquant entre elles l’opérateur logique AND,    et le résultat donne la valeur finale de tout le bloc.    <br>    Les différents blocs sont séparés par une ligne vide. Les valeurs résultantes de chaque bloc sont ensuite combinées à l’aide de l’opérateur logique OR. L’évaluation des conditions individuelles dans un bloc se fait de haut en bas, dans l’ordre où les conditions sont écrites sur le parchemin.    L’évaluation des blocs se fait également dans l’ordre dans lequel ils sont inscrits sur le parchemin. Cela signifie qu’une fois qu’un bloc est évalué à vrai (true), ce résultat est renvoyé au bloc appelant et l’évaluation ne continue pas avec le bloc suivant.    C’est très important et il faut en tenir compte.    <br>    <br>    On distingue plusieurs types de conditions :    <br>    <strong>game:plank-oak<\\/strong> - On évalue si l’objet surveillé dans l’inventaire ou le bloc surveillé est du type spécifié, c’est-à-dire si son code correspond exactement au code indiqué. Si oui, la condition renvoie true.<br>    <strong>game:plank-*<\\/strong> - On évalue si l’objet ou le bloc surveillé est du type spécifié, dans n’importe quelle de ses variantes (indiquées par un astérisque). Si oui, la condition renvoie true.<br>    <strong>@.*-plank-.*<\\/strong> - Le code de l’objet ou du bloc surveillé est évalué par cette expression régulière. S’il y a correspondance, la condition renvoie true.<br>    <strong>attribut > 1<\\/strong> - On évalue la valeur d’un attribut de l’objet dans l’inventaire ou du bloc surveillé. On peut utiliser différents opérateurs de comparaison (supérieur/inférieur/égal). Après l’évaluation, le résultat de la comparaison (true/false) est renvoyé.<br>    <strong>attribut<\\/strong> - Si la condition contient uniquement le nom de l’attribut de l’objet, on évalue s’il a ou non une valeur. C’est‑à‑dire que zéro, NULL, une chaîne vide ou false sont évalués comme false. Une valeur non nulle, une chaîne ou true sont évalués comme true.<br>    <br>    On peut appliquer l’opérateur de négation <strong>!<\\/strong> à toutes les conditions. Par exemple, !game:plank-oak est évalué comme true si l’objet ou le bloc surveillé n’est pas exactement une planche de chêne.    <br>    À la fin de chaque bloc, on peut ajouter une instruction pour définir le signal de sortie, par exemple <strong>output 1<\\/strong>, qui indique que si ce bloc est évalué comme vrai (true), un signal 1 sera envoyé en sortie.    Cela n’a de sens que pour le bloc <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Capteur de blocs<\\/a>, qui permet de définir quel signal sera envoyé en sortie si un bloc ou un objet correspond aux conditions énoncées dans le bloc. Pour les autres blocs qui permettent d’utiliser des conditions sur parchemin, cette instruction est ignorée.    <font size=\"20\" color=\"6082B6\">Configuration des conditions<\\/font>    Vous écrivez les conditions sur un <a href=\"handbook://item-paper-parchment\">parchemin<\\/a>. Ne signez pas le parchemin afin de pouvoir modifier le texte ultérieurement.<br>    Pour transférer les conditions dans un bloc qui les prend en charge, cliquez avec le bouton droit de la souris en tenant ce parchemin sur le bloc en question. Les conditions sont alors enregistrées dans le bloc et vous pourrez les voir dans la fenêtre d’information lorsque vous regarderez le bloc. <br>    Pour supprimer les conditions d’un bloc, prenez un parchemin vierge en main, accroupissez‑vous (touche Maj) et cliquez avec ce parchemin vierge sur le bloc concerné. Vous effacerez ainsi les conditions du bloc.<br>    Si vous souhaitez copier les conditions d’un bloc vers un parchemin vierge, cliquez avec le bouton droit de la souris en tenant un parchemin vierge sur le bloc sans vous accroupir.<br>    Enfin, une aide pour découvrir le code d’un bloc ou d’un objet et les attributs dont vous disposez pour les utiliser dans des expressions conditionnelles :<br>    Prenez en main l’objet qui vous intéresse, maintenez la touche Ctrl enfoncée et cliquez avec le bouton droit de la souris en tenant cet objet sur un bloc qui prend en charge les conditions sur parchemin. Le code de l’objet et ses attributs, disponibles pour les conditions sur parchemin, seront enregistrés dans ce bloc. Vous pouvez maintenant les copier sur    un parchemin vierge, comme décrit ci‑dessus, puis les modifier librement en blocs de conditions et les utiliser pour configurer le bloc.",
  "signalslink:usageinfo-paperconditions-title": "Conditions sur parchemin"
}
