{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Capteur de blocs",
  "signals:con-input": "Entrée",
  "signals:con-output": "Sortie",
  "signalslink:block-entitysensor-*": "Capteur d'entités",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "État d'erreur",
  "signals:con-output1": "Sortie 1",
  "signals:con-output2": "Sortie 2",
  "signals:con-output1-config": "Configuration de sortie 1",
  "signals:con-output2-config": "Configuration de sortie 2",
  "signalslink:entitysensor-charged": "Chargé. {0} unités ajoutées. La limite de charge maximale est de {1} unités.",
  "signalslink:entitysensor-already-fully-charged": "Cet appareil est déjà entièrement chargé.",
  "signalslink:blockinfo-charge": "Charge : {0}/{1} unités ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Avec la couverture actuelle ({0} blocs), il fonctionnera : ~{1} jours",
  "signalslink:blockinfo-charge-empty": "Charge : Vide - nécessite un engrenage temporel",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extension du mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Étend le mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> avec des composants supplémentaires.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Permet de détecter la présence d'un bloc sur une position adjacente sélectionnée et, selon son type et éventuellement le signal d'entrée, fournit en sortie des informations sur son état ou le remplissage des emplacements, etc.<br>Le Block Sensor identifie le bloc et fournit en sortie le signal correspondant.<br><font size=\"20\" color=\"6082B6\">Blocs pris en charge pour l'instant :</font><br><strong>Enclume</strong> - si un lingot suffisamment chaud se trouve sur l'enclume pour forger, le signal de Sortie est 1. Sinon, il envoie le signal 0.<br><strong>Portes, portails, trappes</strong> - Pour les portes et portails, il faut surveiller le bloc au sol du côté des charnières. Si le bloc est ouvert, le signal de Sortie est 1 ; s'il est fermé, le signal de Sortie est 0.<br><strong>Coffre ou, plus généralement, un conteneur ou n'importe quel bloc possédant des emplacements d'inventaire</strong> (p. ex. foyer, tonneau, auge, etc.). En Sortie, le signal dépend du signal d'entrée.<br>Le signal d'entrée détermine quel emplacement doit être scanné.<br>Le signal 1-14 sélectionne les emplacements 0-13. La sortie indique le niveau de remplissage de l'emplacement par rapport à la capacité maximale de pile de l'objet dans cet emplacement, converti en un signal 0-15.<br>Le signal 15 indique que le capteur doit détecter le remplissage total de tous les emplacements, p. ex. d'un coffre entier.<br><strong>Un autre bloc non listé ci-dessus</strong> - S'il n'y a rien dans l'espace surveillé (air), le signal de Sortie est 0. S'il y a de l'eau, la sortie est 2-eau douce ou 3-eau salée. S'il y a n'importe quel autre bloc, le signal de Sortie est 1.<br><br><font size=\"21\"><strong>Capteur d'entités</strong></font><br>Détecte la présence d'entités (joueurs, animaux, animaux sauvages ou monstres) dans la zone marquée et peut fournir en sortie des informations sur leur nombre, leur type ou leur état. Le capteur nécessite une charge pour fonctionner à l'aide d'un ou plusieurs engrenages temporels (Temporal gears). La vitesse de consommation dépend de la taille de la zone surveillée.<br><strong>Entrées x, y, z</strong> déterminent la taille de la zone surveillée en blocs.<br>Sur la sortie <strong>Erreur</strong>, le signal est 1 si le capteur est déchargé, sinon 0.<br>Les entrées <strong>Configuration de sortie 1</strong> et <strong>Configuration de sortie 2</strong> déterminent quelles informations seront fournies sur les sorties 1 et 2. Vous pouvez ainsi obtenir des informations différentes sur chaque sortie, selon le réglage de ces entrées.<br>Options :<br>1 - La sortie renvoie <strong>Nombre</strong>. Nombre d'entités détectées.<br>2 - La sortie renvoie <strong>Catégorie</strong>. Drapeaux binaires de la catégorie d'entité 0–3 : joueur, créature, animal, animal sauvage.<br>3 - La sortie renvoie <strong>État de vie</strong>. Toutes les entités détectées sont : 1–mortes, 2–vivantes ou 15–mixte.<br>4 - La sortie renvoie <strong>Sexe</strong>. Toutes les entités détectées sont : 1–mâle, 2–femelle ou 15–mixte.<br>5 - La sortie renvoie <strong>Âge</strong>. Toutes les entités détectées sont : 1–jeune, 2–adulte ou 15–mixte.<br>6 - La sortie renvoie <strong>Espèce</strong>. Toutes les entités détectées sont : 1–joueur, 2–animal, 3–animal sauvage, 4–créature ou 15–mixte.<br>7 - La sortie renvoie <strong>État reproductif</strong>. Toutes les entités détectées sont : 1–prêtes à s'accoupler, 2–enceintes, 3–allaitantes ou 15–mixte.<br>8 - La sortie renvoie <strong>Drapeaux d'état reproductif</strong>. Drapeaux binaires 0–2 : prêtes à s'accoupler, enceintes, allaitantes.<br>9 - La sortie renvoie <strong>Génération minimale</strong>. La génération minimale détectée est : 0–15. Les entités présentes sans génération spécifiée sont ignorées.<br>10 - La sortie renvoie <strong>Génération maximale</strong>. La génération maximale détectée est : 0–15. Les entités présentes sans génération spécifiée sont ignorées.<br>11 - La sortie renvoie <strong>Poids minimal</strong>. Le poids minimal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans poids spécifié (pas des animaux) sont ignorées.<br>12 - La sortie renvoie <strong>Poids maximal</strong>. Le poids maximal détecté est : 1–affamé, 2–faible, 3–correct, 4–bon. Les entités présentes sans poids spécifié (pas des animaux) sont ignorées.<br><br><font size=\"21\"><strong>Test de localisation</strong></font><br>Permet de présenter la localisation à l'aide de l'IA, etc. Je montre ici à mes collègues comment fonctionne la traduction avec l'IA.<br>"
}
