{
  "game:tabname-signalslink": "Collegamento dei segnali",
  "signalslink:block-blocksensor-*": "Sensore di blocchi",
  "signals:con-input": "Ingresso",
  "signals:con-output": "Uscita",
  "signals:con-target": "Obiettivo",
  "signals:con-source": "Sorgente",
  "signalslink:block-entitysensor-*": "Sensore di entità",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Stato di errore",
  "signals:con-output1": "Uscita 1",
  "signals:con-output2": "Uscita 2",
  "signals:con-output1-config": "Impostazioni uscita 1",
  "signals:test": "Stiamo testando le traduzioni nell’orologio AI.",
  "signals:con-output2-config": "Impostazioni uscita 2",
  "signalslink:entitysensor-charged": "Caricato. Aggiunte {0} unità. Il limite massimo di carica è {1} unità.",
  "signalslink:entitysensor-already-fully-charged": "Questo dispositivo è già completamente carico.",
  "signalslink:blockinfo-charge": "Carica: {0}/{1} unità ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Con la copertura attuale ({0} blocchi) continuerà a funzionare per: ~{1} giorni",
  "signalslink:blockinfo-charge-empty": "Carica: Vuoto - richiede un temporal gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - estensione della mod Signals",
  "signalslink:block-managedchute-*": "Condotto controllato",
  "signalslink:block-managedwallchute-wood-*": "Condotto controllato incassato nel legno",
  "signalslink:block-managedwallchute-rock-*": "Condotto controllato incassato nella roccia",
  "signalslink:block-managedwallchute-cobble-*": "Condotto controllato incassato nelle piastrelle",
  "signalslink:managedchute-conditions": "Condizioni",
  "signalslink:managedchute-info-unlimited": "Trasporta in modo continuo",
  "signalslink:managedchute-info-remaining": "Trasporta {0}",
  "signalslink:block-handbooktitle-signalslink": "Funzioni dei segnali",
  "signalslink:block-handbooktext-blocksensor": "    Il sensore di blocchi rileva la presenza di un blocco nella posizione adiacente selezionata e, in base al suo tipo o al segnale di ingresso, fornisce in uscita informazioni sul suo stato o sul riempimento degli slot.    <br>    <font size=\"20\" color=\"6082B6\">I blocchi attualmente supportati sono:<\\/font>    <br>    <strong>Incudine<\\/strong> - se sull'incudine è presente un lingotto sufficientemente incandescente per la forgiatura, in uscita c'è il segnale 1. Altrimenti invia il segnale 0.    <br>    <strong>Porte, cancelli, botole<\\/strong> - Per porte e cancelli è necessario monitorare il blocco a livello del suolo sul lato delle cerniere. Se il blocco è aperto, in uscita c'è il segnale 1, se è chiuso, in uscita c'è il segnale 0.    <br>    <strong>Baule o in generale contenitore o qualsiasi blocco che abbia degli slot di inventario<\\/strong> (ad es. focolare, botte, mangiatoia ecc.). In uscita c'è il segnale secondo il segnale di ingresso.    <br>    Il segnale di ingresso determina quale slot deve essere scansionato.    <br>    Il segnale 1-14 determina gli slot 0-13. L'uscita è l'informazione sul riempimento dello slot rispetto alla capacità massima dello stack dell'oggetto in tale slot, convertita in un segnale 0-15.    <br>    Il segnale 15 stabilisce che il sensore deve rilevare il riempimento complessivo di tutti gli slot, ad es. di un baule intero.    <br>    <strong>Qualsiasi altro blocco non elencato sopra<\\/strong> - Se nello spazio monitorato non c'è nulla (c'è aria), in uscita c'è il segnale 0. Se c'è acqua, in uscita c'è 2 - acqua dolce oppure 3 - acqua salata. Se c'è qualsiasi altro blocco, in uscita c'è il segnale 1.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    Il sensore di entità rileva la presenza di entità (giocatori, animali domestici, animali selvatici o mostri) nell'area indicata e può fornire in uscita informazioni sul loro numero, tipo o stato. Il sensore per il suo funzionamento richiede di essere caricato con una o più ruote temporali (Temporal gears). La velocità di consumo dipende poi dalla dimensione dell'area monitorata.    <br>    Gli ingressi <strong>x, y, z<\\/strong> determinano la dimensione dell'area monitorata in blocchi.    <br>    All'uscita <strong>Errore<\\/strong> c'è il segnale 1 se il sensore è scarico, altrimenti 0.    <br>    Gli ingressi <strong>Impostazione uscita 1<\\/strong> e <strong>Impostazione uscita 2<\\/strong> determinano quali informazioni saranno fornite alle uscite 1 e 2. Su ogni uscita potete così ottenere una diversa informazione, in base all'impostazione di questi ingressi.    <br>    Le possibilità sono:    <br>    1 - L'uscita restituisce il <strong>Numero<\\/strong>. Numero di entità rilevate.    <br>    2 - L'uscita restituisce la <strong>Categoria<\\/strong>. Flag di bit della categoria di entità 0–3: giocatore, creatura, animale domestico, animale selvatico.    <br>    3 - L'uscita restituisce lo <strong>Stato di vita<\\/strong>. Tutte le entità rilevate sono: 1–morte, 2–vive oppure 15–miste.    <br>    4 - L'uscita restituisce il <strong>Sesso<\\/strong>. Tutte le entità rilevate sono: 1–maschio, 2–femmina oppure 15–miste.    <br>    5 - L'uscita restituisce l'<strong>Età<\\/strong>. Tutte le entità rilevate sono: 1–cucciolo, 2–adulto oppure 15–miste.    <br>    6 - L'uscita restituisce la <strong>Specie<\\/strong>. Tutte le entità rilevate sono: 1–giocatore, 2–animale domestico, 3–animale selvatico, 4–creatura oppure 15–miste.    <br>    7 - L'uscita restituisce lo <strong>Stato riproduttivo<\\/strong>. Tutte le entità rilevate sono: 1–pronte all'accoppiamento, 2–gravide, 3–in allattamento oppure 15–miste.    <br>    8 - L'uscita restituisce i <strong>Flag dello stato riproduttivo<\\/strong>. Flag di bit 0–2: pronte all'accoppiamento, gravide, in allattamento.    <br>    9 - L'uscita restituisce la <strong>Generazione minima<\\/strong>. La generazione minima rilevata è: 0–15. Le entità presenti senza generazione specificata vengono ignorate.    <br>    10 - L'uscita restituisce la <strong>Generazione massima<\\/strong>. La generazione massima rilevata è: 0–15. Le entità presenti senza generazione specificata vengono ignorate.    <br>    11 - L'uscita restituisce il <strong>Peso minimo<\\/strong>. Il peso minimo rilevato è: 1–denutrito, 2–basso, 3–discreto, 4–buono. Le entità presenti senza peso specificato (non sono animali) vengono ignorate.    <br>    12 - L'uscita restituisce il <strong>Peso massimo<\\/strong>. Il peso massimo rilevato è: 1–denutrito, 2–basso, 3–discreto, 4–buono. Le entità presenti senza peso specificato (non sono animali) vengono ignorate.    <br>",
  "signalslink:block-handbooktext-managedchute": "    Il tubo controllato consente il trasporto automatico di oggetti tra vari blocchi.",
  "signalslink:block-handbooktext-managedwallchute": "    Il tubo controllato inserito nel muro consente il trasporto automatico di oggetti tra vari blocchi. Permette di trasportare oggetti attraverso i muri, il che può essere molto utile per sistemi di trasporto nascosti o per il trasporto di oggetti dalla cantina o in cantina, senza compromettere l'ambiente fresco della cantina, importante per la conservazione a lungo termine degli alimenti.",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink<\\/strong><\\/font>    <br>    Estende la mod <a href=\"handbook://signals:craftinginfo-signals\">Signals<\\/a> con ulteriori componenti.    <br>    <br>    Per monitorare un blocco nell'area circostante potete usare il <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensore di blocchi<\\/a>.    <br>    Se avete bisogno di monitorare la vostra mandria di bestiame, è perfetto il <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Sensore di entità<\\/a>.    <br>    Se volete automatizzare alcuni lavori, vi servirà egregiamente il <a href=\"handbook://block-signalslink:managedchute-north-down\">Tubo controllato<\\/a>, che può trasportare oggetti tra i blocchi in modo simile allo scivolo, ma lo controllate tramite segnali e vi offre un controllo molto maggiore su ciò che viene trasportato. La sua variante <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Tubo controllato integrato nel muro<\\/a> permette poi di trasportare oggetti attraverso i muri, il che può essere molto utile per sistemi di trasporto nascosti o per il trasporto di oggetti dalla cantina o in cantina, senza compromettere l'ambiente fresco della cantina, importante per la conservazione a lungo termine degli alimenti.",
  "signalslink:usageinfo-paperconditions-text": "    Alcuni blocchi della mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink<\\/a> permettono di usare le <strong>condizioni sulla pergamena<\\/strong>:    <br>    • <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensore di blocchi<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedchute-north-down\">Tubo controllato<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Tubo controllato integrato nel muro<\\/a>    <br>    <font size=\"20\" color=\"6082B6\">Condizioni sulla pergamena<\\/font>    Le <strong>condizioni sulla pergamena<\\/strong> sono condizioni scritte su un <a href=\"handbook://item-paper-parchment\">pergamena<\\/a>. Queste condizioni possono essere usate per influenzare il comportamento del blocco, ad esempio per controllare i segnali di uscita o per filtrare gli oggetti nei tubi.    <br>    Le condizioni si scrivono in blocchi (paragrafi). Ogni blocco è composto da una o più righe, con una condizione indicata in ogni riga. Tutte le condizioni <strong>in un blocco<\\/strong> vengono valutate applicando tra loro l'operatore logico AND e il risultato dà il valore finale dell'intero blocco.    <br>    I singoli blocchi sono separati da una riga vuota. Ai valori risultanti dei singoli blocchi viene poi applicato l'operatore logico OR. La valutazione delle singole condizioni in un blocco avviene nell'ordine dall'alto verso il basso, come sono elencate sulla pergamena. La valutazione dei blocchi avviene anche nell'ordine in cui sono indicati sulla pergamena. Ciò significa che non appena un blocco viene valutato come vero (true), questo risultato viene restituito al blocco chiamante e non si prosegue con il blocco successivo. Questo è molto importante ed è necessario tenerne conto.    <br>    <br>    Distinguiamo diversi tipi di condizioni:    <br>    <strong>game:plank-oak<\\/strong> - Si valuta se l'oggetto monitorato nell'inventario o il blocco monitorato è del tipo indicato, cioè se il suo codice corrisponde esattamente al codice specificato. In tal caso, la condizione restituisce true.<br>    <strong>game:plank-*<\\/strong> - Si valuta se l'oggetto o il blocco monitorato è del tipo indicato, in una qualsiasi delle sue varianti (contrassegnate con un asterisco). In tal caso, la condizione restituisce true.<br>    <strong>@.*-plank-.*<\\/strong> - Il codice dell'oggetto o del blocco monitorato viene valutato con questa espressione regolare. Se c'è corrispondenza, la condizione restituisce true.<br>    <strong>attribut > 1<\\/strong> - Si valuta il valore di un attributo dell'oggetto nell'inventario o del blocco monitorato. È possibile usare vari operatori di confronto (maggiore/minore/uguale). Dopo la valutazione viene restituito il risultato del confronto (true/false).<br>    <strong>attribut<\\/strong> - Se nella condizione si indica solo il nome dell'attributo dell'oggetto, si valuta se ha o non ha un valore. Cioè zero, NULL, stringa vuota o false vengono valutati come false. Un valore diverso da zero, una stringa o true vengono valutati come true.<br>    <br>    A tutte le condizioni è possibile applicare l'operatore di negazione <strong>!<\\/strong>. Ad esempio !game:plank-oak viene valutato come true se l'oggetto o il blocco monitorato non è esattamente assi di quercia.    <br>    Alla fine di ogni blocco è possibile aggiungere un'istruzione per impostare il segnale di uscita, ad esempio <strong>output 1<\\/strong>, che stabilisce che, se questo blocco viene valutato come vero (true), verrà inviato il segnale 1 all'uscita. Questo ha significato solo per il blocco <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensore di blocchi<\\/a>, che permette di impostare quale segnale sarà inviato all'uscita nel caso in cui un blocco o un oggetto corrisponda alle condizioni indicate nel blocco. Negli altri blocchi che permettono di usare condizioni sulla pergamena, questa istruzione viene ignorata.    <font size=\"20\" color=\"6082B6\">Impostazione delle condizioni<\\/font>    Scrivete le condizioni sulla <a href=\"handbook://item-paper-parchment\">pergamena<\\/a>. Non firmate la pergamena, così da poter modificare nuovamente il testo.<br>    Trasferite le condizioni nel blocco che lo supporta cliccando con il tasto destro del mouse con questa pergamena sul blocco in questione. Le condizioni vengono così salvate nel blocco e le vedrete nella finestra informativa quando guardate il blocco. <br>    Per rimuovere le condizioni dal blocco, prendete in mano una pergamena vuota, accovacciatevi (tasto shift) e cliccate con questa pergamena vuota sul blocco in questione. In questo modo avete cancellato le condizioni dal blocco.<br>    Se volete copiare le condizioni dal blocco su una pergamena vuota, cliccate con la pergamena vuota con il tasto destro del mouse sul blocco in questione senza accovacciarvi.<br>    E infine un aiuto per scoprire quale codice ha un determinato blocco o oggetto e quali attributi avete a disposizione per l'uso nelle espressioni condizionali:<br>    Prendete in mano l'oggetto che vi interessa, tenete premuto il tasto ctrl e cliccate con il tasto destro del mouse con questo oggetto sul blocco che supporta le condizioni sulla pergamena. Il codice dell'oggetto e i suoi attributi disponibili per le condizioni sulla pergamena verranno salvati in quel blocco. Ora potete copiarli su una pergamena vuota, come descritto sopra, e lì modificarli liberamente in blocchi di condizioni e usarli per impostare il blocco.",
  "signalslink:usageinfo-paperconditions-title": "Condizioni sulla pergamena"
}
