{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensore di blocchi",
  "signals:con-input": "Ingresso",
  "signals:con-output": "Uscita",
  "signalslink:block-entitysensor-*": "Sensore di entità",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Stato errore",
  "signals:con-output1": "Uscita 1",
  "signals:con-output2": "Uscita 2",
  "signals:con-output1-config": "Configurazione uscita 1",
  "signals:con-output2-config": "Configurazione uscita 2",
  "signalslink:entitysensor-charged": "Caricato. Aggiunte {0} unità. Il limite massimo di carica è {1} unità.",
  "signalslink:entitysensor-already-fully-charged": "Questo dispositivo è già completamente carico.",
  "signalslink:blockinfo-charge": "Carica: {0}/{1} unità ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Con la copertura attuale ({0} blocchi) funzionerà per: ~{1} giorni",
  "signalslink:blockinfo-charge-empty": "Carica: Vuota - serve un ingranaggio temporale",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - estensione della mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Estende la mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> con componenti aggiuntivi.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Consente di rilevare la presenza di un blocco in una posizione adiacente selezionata e, in base al suo tipo o al segnale di ingresso, fornisce in uscita informazioni sul suo stato o sul riempimento degli slot, ecc.<br>Il Block Sensor identifica di che blocco si tratta e fornisce in uscita un segnale corrispondente.<br><font size=\"20\" color=\"6082B6\">I blocchi supportati al momento sono:</font><br><strong>Incudine</strong> - Se sull'incudine c'è un lingotto abbastanza caldo da forgiare, in uscita c'è il segnale 1. Altrimenti invia il segnale 0.<br><strong>Porte, cancelli, botole</strong> - Per porte e cancelli bisogna monitorare il blocco a livello del terreno sul lato delle cerniere. Se il blocco è aperto, in uscita c'è il segnale 1; se è chiuso, in uscita c'è il segnale 0.<br><strong>Baule o in generale un contenitore o qualsiasi blocco che abbia slot di inventario</strong> (ad es. focolare, botte, abbeveratoio, ecc.). In uscita c'è un segnale in base al segnale di ingresso.<br>Il segnale di ingresso determina quale slot deve essere scansionato.<br>Il segnale 1-14 determina gli slot 0-13. L'uscita è l'informazione di riempimento dello slot rispetto alla capacità massima della pila dell'oggetto in quello slot, convertita in un segnale 0-15.<br>Il segnale 15 indica che il sensore deve rilevare il riempimento totale di tutti gli slot, ad es. di un intero baule.<br><strong>Un altro blocco non elencato sopra</strong> - Se nello spazio monitorato non c'è nulla (aria), in uscita c'è il segnale 0. Se c'è acqua, l'uscita è 2 per acqua dolce o 3 per acqua salata. Se c'è qualsiasi altro blocco, in uscita c'è il segnale 1.<br><br><font size=\"21\"><strong>Sensore di entità</strong></font><br>Rileva la presenza di entità (giocatori, animali, animali selvatici o mostri) in un'area marcata e può fornire in uscita informazioni sul loro numero, tipo o stato. Per funzionare, il sensore richiede una carica usando uno o più ingranaggi temporali (Temporal gears). La velocità di consumo dipende dalla dimensione dell'area monitorata.<br><strong>Ingressi x, y, z</strong> determinano la dimensione dell'area monitorata in blocchi.<br>Sull'uscita <strong>Errore</strong> c'è il segnale 1 se il sensore è scarico, altrimenti 0.<br>Gli ingressi <strong>Configurazione uscita 1</strong> e <strong>Configurazione uscita 2</strong> determinano quali informazioni saranno fornite sulle uscite 1 e 2. In questo modo puoi ottenere informazioni diverse su ciascuna uscita, in base a queste impostazioni di ingresso.<br>Opzioni:<br>1 - L'uscita restituisce <strong>Conteggio</strong>. Numero di entità rilevate.<br>2 - L'uscita restituisce <strong>Categoria</strong>. Flag di bit della categoria entità 0–3: giocatore, creatura, animale, animale selvatico.<br>3 - L'uscita restituisce <strong>Stato vitale</strong>. Tutte le entità rilevate sono: 1–morte, 2–vive o 15–miste.<br>4 - L'uscita restituisce <strong>Sesso</strong>. Tutte le entità rilevate sono: 1–maschio, 2–femmina o 15–miste.<br>5 - L'uscita restituisce <strong>Età</strong>. Tutte le entità rilevate sono: 1–cucciolo, 2–adulto o 15–miste.<br>6 - L'uscita restituisce <strong>Specie</strong>. Tutte le entità rilevate sono: 1–giocatore, 2–animale, 3–animale selvatico, 4–creatura o 15–miste.<br>7 - L'uscita restituisce <strong>Stato riproduttivo</strong>. Tutte le entità rilevate sono: 1–pronte all'accoppiamento, 2–incinte, 3–in allattamento o 15–miste.<br>8 - L'uscita restituisce <strong>Flag dello stato riproduttivo</strong>. Flag di bit 0–2: pronte all'accoppiamento, incinte, in allattamento.<br>9 - L'uscita restituisce <strong>Generazione minima</strong>. La generazione minima rilevata è: 0–15. Le entità presenti senza generazione vengono ignorate.<br>10 - L'uscita restituisce <strong>Generazione massima</strong>. La generazione massima rilevata è: 0–15. Le entità presenti senza generazione vengono ignorate.<br>11 - L'uscita restituisce <strong>Peso minimo</strong>. Il peso minimo rilevato è: 1–affamato, 2–basso, 3–discreto, 4–buono. Le entità presenti senza peso (non animali) vengono ignorate.<br>12 - L'uscita restituisce <strong>Peso massimo</strong>. Il peso massimo rilevato è: 1–affamato, 2–basso, 3–discreto, 4–buono. Le entità presenti senza peso (non animali) vengono ignorate.<br><br>"
}
