{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Czujnik bloków",
  "signals:con-input": "Wejście",
  "signals:con-output": "Wyjście",
  "signalslink:block-entitysensor-*": "Czujnik istot",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Stan błędu",
  "signals:con-output1": "Wyjście 1",
  "signals:con-output2": "Wyjście 2",
  "signals:con-output1-config": "Ustawienia wyjścia 1",
  "signals:con-output2-config": "Ustawienia wyjścia 2",
  "signalslink:entitysensor-charged": "Naładowano. Dodano {0} jednostek. Maksymalny limit naładowania to {1} jednostek.",
  "signalslink:entitysensor-already-fully-charged": "To urządzenie jest już w pełni naładowane.",
  "signalslink:blockinfo-charge": "Naładowanie: {0}/{1} jednostek ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Przy aktualnym zasięgu ({0} bloków) będzie działać: ~{1} dni",
  "signalslink:blockinfo-charge-empty": "Naładowanie: Puste - potrzebuje przekładni temporalnej",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - rozszerzenie moda Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Rozszerza mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> o dodatkowe komponenty.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Umożliwia wykrywanie obecności bloku na wybranej sąsiedniej pozycji i na podstawie jego typu i/lub sygnału wejściowego dostarcza na wyjściu informacje o jego stanie lub wypełnieniu slotów itd.<br>Block Sensor rozpoznaje, jaki to blok, i odpowiednio wystawia na wyjściu właściwy sygnał.<br><font size=\"20\" color=\"6082B6\">Aktualnie obsługiwane bloki:</font><br><strong>Kowadło</strong> - jeśli na kowadle znajduje się wlew wystarczająco rozgrzany do kucia, na wyjściu jest sygnał 1. W przeciwnym razie wysyła sygnał 0.<br><strong>Drzwi, bramy, klapy</strong> - W przypadku drzwi i bram należy obserwować blok przy ziemi po stronie zawiasów. Jeśli blok jest otwarty, na wyjściu jest sygnał 1; jeśli zamknięty, na wyjściu jest sygnał 0.<br><strong>Skrzynia lub ogólnie pojemnik albo dowolne bloki posiadające sloty ekwipunku</strong> (np. palenisko, beczka, koryto itp.). Na wyjściu jest sygnał zależny od sygnału wejściowego.<br>Sygnał wejściowy określa, który slot ma być skanowany.<br>Sygnał 1-14 wybiera sloty 0-13. Wyjściem jest informacja o wypełnieniu slotu względem maksymalnej pojemności stosu przedmiotu w tym slocie, przeliczona na sygnał 0-15.<br>Sygnał 15 oznacza, że czujnik ma wykrywać łączne wypełnienie wszystkich slotów, np. całej skrzyni.<br><strong>Inny blok niewymieniony powyżej</strong> - Jeśli w obserwowanej przestrzeni nie ma nic (powietrze), na wyjściu jest sygnał 0. Jeśli jest tam woda, na wyjściu jest 2 dla wody słodkiej lub 3 dla słonej. Jeśli jest tam jakikolwiek inny blok, na wyjściu jest sygnał 1.<br><br><font size=\"21\"><strong>Czujnik istot</strong></font><br>Wykrywa obecność bytów (graczy, zwierząt, dzikich zwierząt lub potworów) w zaznaczonym obszarze i potrafi na wyjściach podawać informacje o ich liczbie, typie lub stanie. Czujnik do działania wymaga naładowania jednym lub kilkoma kołami czasowymi (Temporal gears). Szybkość zużycia zależy od wielkości obserwowanego obszaru.<br><strong>Wejścia x, y, z</strong> określają rozmiar obserwowanego obszaru w blokach.<br>Na wyjściu <strong>Błąd</strong> jest sygnał 1, jeśli czujnik jest rozładowany, w przeciwnym razie 0.<br>Wejścia <strong>Ustawienia wyjścia 1</strong> i <strong>Ustawienia wyjścia 2</strong> określają, jakie informacje będą podawane na wyjściach 1 i 2. Każde wyjście może więc zwracać inne informacje, zależnie od tych ustawień wejściowych.<br>Opcje:<br>1 - Wyjście zwraca <strong>Liczbę</strong>. Liczba wykrytych bytów.<br>2 - Wyjście zwraca <strong>Kategorię</strong>. Flagi bitowe kategorii bytów 0–3: gracz, istota, zwierzę, dzikie zwierzę.<br>3 - Wyjście zwraca <strong>Stan życia</strong>. Wszystkie wykryte byty są: 1–martwe, 2–żywe lub 15–mieszane.<br>4 - Wyjście zwraca <strong>Płeć</strong>. Wszystkie wykryte byty są: 1–samiec, 2–samica lub 15–mieszane.<br>5 - Wyjście zwraca <strong>Wiek</strong>. Wszystkie wykryte byty są: 1–młode, 2–dorosłe lub 15–mieszane.<br>6 - Wyjście zwraca <strong>Gatunek</strong>. Wszystkie wykryte byty są: 1–gracz, 2–zwierzę, 3–dzikie zwierzę, 4–istota lub 15–mieszane.<br>7 - Wyjście zwraca <strong>Stan rozrodczy</strong>. Wszystkie wykryte byty są: 1–gotowe do rozrodu, 2–ciężarne, 3–karmiące lub 15–mieszane.<br>8 - Wyjście zwraca <strong>Flagi stanu rozrodczego</strong>. Flagi bitowe 0–2: gotowe do rozrodu, ciężarne, karmiące.<br>9 - Wyjście zwraca <strong>Minimalną generację</strong>. Minimalna wykryta generacja to: 0–15. Obecne byty bez określonej generacji są ignorowane.<br>10 - Wyjście zwraca <strong>Maksymalną generację</strong>. Maksymalna wykryta generacja to: 0–15. Obecne byty bez określonej generacji są ignorowane.<br>11 - Wyjście zwraca <strong>Minimalną wagę</strong>. Minimalna wykryta waga to: 1–głodujący, 2–niska, 3–przyzwoita, 4–dobra. Obecne byty bez określonej wagi (nie zwierzęta) są ignorowane.<br>12 - Wyjście zwraca <strong>Maksymalną wagę</strong>. Maksymalna wykryta waga to: 1–głodujący, 2–niska, 3–przyzwoita, 4–dobra. Obecne byty bez określonej wagi (nie zwierzęta) są ignorowane.<br><br><font size=\"21\"><strong>Test lokalizacji</strong></font><br>Pozwala zaprezentować lokalizację przy pomocy SI. Itp.<br>"
}
