{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Czujnik bloków",
  "signals:con-input": "Wejście",
  "signals:con-output": "Wyjście",
  "signals:con-target": "Cel",
  "signals:con-source": "Źródło",
  "signalslink:block-entitysensor-*": "Czujnik istot",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Stan błędu",
  "signals:con-output1": "Wyjście 1",
  "signals:con-output2": "Wyjście 2",
  "signals:con-output1-config": "Konfiguracja wyjścia 1",
  "signals:test": "Testujemy tłumaczenia na lekcji AI.",
  "signals:con-output2-config": "Konfiguracja wyjścia 2",
  "signalslink:entitysensor-charged": "Naładowano. Dodano {0} jednostek. Maksymalny limit ładowania to {1} jednostek.",
  "signalslink:entitysensor-already-fully-charged": "To urządzenie jest już w pełni naładowane.",
  "signalslink:blockinfo-charge": "Ładunek: {0}/{1} jednostek ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Przy aktualnym zasięgu ({0} bloków) będzie działać: ~{1} dni",
  "signalslink:blockinfo-charge-empty": "Ładunek: Pusty - wymaga temporal gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - rozszerzenie moda Signals",
  "signalslink:block-managedchute-*": "Sterowana rura",
  "signalslink:block-managedwallchute-wood-*": "Sterowana rura osadzona w drewnie",
  "signalslink:block-managedwallchute-rock-*": "Sterowana rura osadzona w skale",
  "signalslink:block-managedwallchute-cobble-*": "Sterowana rura osadzona w płytkach",
  "signalslink:managedchute-conditions": "Warunki",
  "signalslink:managedchute-info-unlimited": "Transportuje bez ograniczeń",
  "signalslink:managedchute-info-remaining": "Transportuje {0}",
  "signalslink:block-handbooktitle-signalslink": "Funkcje sygnałów",
  "signalslink:block-handbooktext-blocksensor": "    Czujnik bloków wykrywa obecność bloku w wybranej sąsiedniej pozycji i na podstawie jego typu, ewentualnie sygnału wejściowego, przekazuje na wyjściu informację o jego stanie lub zapełnieniu slotów.    <br>    <font size=\"20\" color=\"6082B6\">Obecnie obsługiwane bloki to:<\\/font>    <br>    <strong>Kowadło<\\/strong> - jeśli na kowadle znajduje się wystarczająco rozgrzany do kucia wlew, na wyjściu jest sygnał 1. W przeciwnym razie wysyła sygnał 0.    <br>    <strong>Drzwi, bramy, włazy<\\/strong> - w przypadku drzwi i bram należy obserwować blok przy ziemi po stronie zawiasów. Jeśli blok jest otwarty, na wyjściu jest sygnał 1, jeśli jest zamknięty, na wyjściu jest sygnał 0.    <br>    <strong>Skrzynia lub ogólnie kontener albo dowolne bloki, które mają jakieś sloty ekwipunku<\\/strong> (np. palenisko, beczka, koryto itp.). Na wyjściu jest sygnał zgodny z sygnałem wejściowym.    <br>    Sygnał wejściowy określa, który slot ma być skanowany.    <br>    Sygnał 1-14 określa sloty 0-13. Wyjściem jest informacja o zapełnieniu slotu względem maksymalnej pojemności stosu przedmiotu w danym slocie, przeliczona na sygnał 0-15.    <br>    Sygnał 15 określa, że czujnik ma wykrywać całkowite zapełnienie wszystkich slotów, np. całej skrzyni.    <br>    <strong>Jakiś inny blok, niewymieniony powyżej<\\/strong> - jeśli w obserwowanej przestrzeni nic nie ma (jest tam powietrze), na wyjściu jest sygnał 0. Jeśli jest tam woda, na wyjściu jest 2–woda słodka lub 3–woda słona. Jeśli znajduje się tam jakikolwiek inny blok, na wyjściu jest sygnał 1.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    Czujnik istot wykrywa obecność encji (graczy, zwierząt, dzikich zwierząt lub potworów) w zaznaczonym obszarze i potrafi na wyjściach przekazywać informacje o ich liczbie, typie lub stanie. Do działania czujnik wymaga naładowania    jednym lub większą liczbą kół zębatych czasu (Temporal gears). Szybkość zużycia zależy od wielkości obserwowanego obszaru.    <br>    <strong>Wejścia x, y, z<\\/strong> określają wielkość obserwowanego obszaru w blokach.    <br>    Na wyjściu <strong>Błąd<\\/strong> jest sygnał 1, jeśli czujnik jest rozładowany, w przeciwnym razie 0.    <br>    Wejścia <strong>Ustawienie wyjścia 1<\\/strong> i <strong>Ustawienie wyjścia 2<\\/strong> określają, jakie informacje będą przekazywane na wyjściach 1 i 2. Na każdym wyjściu możesz więc uzyskać inną informację, w zależności od ustawienia tych wejść.    <br>    Możliwości są następujące:    <br>    1 - Wyjście zwraca <strong>Liczbę<\\/strong>. Liczbę wykrytych encji.    <br>    2 - Wyjście zwraca <strong>Kategorię<\\/strong>. Bitowe flagi kategorii encji 0–3: gracz, istota, zwierzę, dzikie zwierzę.    <br>    3 - Wyjście zwraca <strong>Stan życia<\\/strong>. Wszystkie wykryte encje są: 1–martwe, 2–żywe lub 15–mieszane.    <br>    4 - Wyjście zwraca <strong>Płeć<\\/strong>. Wszystkie wykryte encje są: 1–samiec, 2–samica lub 15–mieszane.    <br>    5 - Wyjście zwraca <strong>Wiek<\\/strong>. Wszystkie wykryte encje są: 1–młode, 2–dorosłe lub 15–mieszane.    <br>    6 - Wyjście zwraca <strong>Rodzaj<\\/strong>. Wszystkie wykryte encje są: 1–gracz, 2–zwierzę, 3–dzikie zwierzę, 4–istota lub 15–mieszane.    <br>    7 - Wyjście zwraca <strong>Stan reprodukcyjny<\\/strong>. Wszystkie wykryte encje są: 1–gotowe do rozrodu, 2–ciężarne, 3–karmiące lub 15–mieszane.    <br>    8 - Wyjście zwraca <strong>Flagi stanu reprodukcyjnego<\\/strong>. Bitowe flagi 0–2: gotowe do rozrodu, ciężarne, karmiące.    <br>    9 - Wyjście zwraca <strong>Minimalne pokolenie<\\/strong>. Minimalne wykryte pokolenie to: 0–15. Obecne encje bez określonego pokolenia są ignorowane.    <br>    10 - Wyjście zwraca <strong>Maksymalne pokolenie<\\/strong>. Maksymalne wykryte pokolenie to: 0–15. Obecne encje bez określonego pokolenia są ignorowane.    <br>    11 - Wyjście zwraca <strong>Minimalną masę<\\/strong>. Minimalna wykryta masa to: 1–wygłodniała, 2–niska, 3–przyzwoita, 4–dobra. Obecne encje bez określonej wagi (nie są zwierzętami) są ignorowane.    <br>    12 - Wyjście zwraca <strong>Maksymalną masę<\\/strong>. Maksymalna wykryta masa to: 1–wygłodniała, 2–niska, 3–przyzwoita, 4–dobra. Obecne encje bez określonej wagi (nie są zwierzętami) są ignorowane.    <br>",
  "signalslink:block-handbooktext-managedchute": "    Sterowana rura umożliwia zautomatyzowany transport przedmiotów między różnymi blokami.",
  "signalslink:block-handbooktext-managedwallchute": "    Sterowana rura osadzona w ścianie umożliwia zautomatyzowany transport przedmiotów między różnymi blokami. Pozwala transportować przedmioty przez ściany, co może być bardzo przydatne dla ukrytych systemów transportu    lub do transportu przedmiotów z piwnicy lub do piwnicy, bez naruszania chłodnego piwnicznego środowiska, ważnego dla długotrwałego przechowywania żywności.",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink<\\/strong><\\/font>    <br>    Rozszerza moda <a href=\"handbook://signals:craftinginfo-signals\">Signals<\\/a> o kolejne komponenty.    <br>    <br>    Do monitorowania jakiegoś bloku w okolicy możesz użyć <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Czujnika bloków<\\/a>.    <br>    Jeśli potrzebujesz monitorować swoje stado bydła, świetnie nadaje się do tego <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Czujnik istot<\\/a>.    <br>    Jeśli chcesz zautomatyzować niektóre prace, doskonale posłuży ci <a href=\"handbook://block-signalslink:managedchute-north-down\">Sterowana rura<\\/a>, która potrafi transportować przedmioty między blokami podobnie jak zsyp, ale sterujesz nią sygnałami i daje ci    znacznie większą kontrolę nad tym, co jest transportowane. Jej wariant <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Sterowana rura zabudowana w ścianie<\\/a> pozwala z kolei transportować przedmioty przez ściany, co może być bardzo przydatne dla ukrytych systemów transportu    lub do transportu przedmiotów z piwnicy lub do piwnicy, bez naruszania chłodnego piwnicznego środowiska, ważnego dla długotrwałego przechowywania żywności.",
  "signalslink:usageinfo-paperconditions-text": "    Niektóre bloki z moda <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink<\\/a> umożliwiają używanie <strong>warunków na papierze<\\/strong>:    <br>    • <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Czujnik bloków<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedchute-north-down\">Sterowana rura<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Sterowana rura zabudowana w ścianie<\\/a>    <br>    <font size=\"20\" color=\"6082B6\">Warunki na papierze<\\/font>    <strong>warunki na papierze<\\/strong> to warunki zapisane na <a href=\"handbook://item-paper-parchment\">pergaminie<\\/a>. Warunki te mogą być użyte do wpływania na zachowanie bloku, na przykład do sterowania sygnałami wyjściowymi lub do filtrowania przedmiotów w rurach.    <br>    Warunki zapisuje się w blokach (akapitach). Każdy blok składa się z jednej lub więcej linii, przy czym w każdej linii podany jest jeden warunek. Wszystkie warunki <strong>w jednym bloku<\\/strong> są oceniane z użyciem operatora logicznego AND    i wynik daje końcową wartość całego bloku.    <br>    Poszczególne bloki są od siebie oddzielone pustą linią. Na wynikowe wartości poszczególnych bloków jest następnie stosowany operator logiczny OR. Ocena poszczególnych warunków w bloku odbywa się w kolejności od góry do dołu, w takiej kolejności, w jakiej warunki zostały podane na papierze.    Ocena bloków również odbywa się w kolejności, w jakiej bloki zostały podane na papierze. Oznacza to, że gdy tylko jakiś blok zostanie oceniony jako prawda (true), ten wynik jest zwracany do bloku wywołującego i do kolejnego bloku już się nie przechodzi.    Jest to bardzo ważne i trzeba to brać pod uwagę.    <br>    <br>    Rozróżniamy kilka typów warunków:    <br>    <strong>game:plank-oak<\\/strong> - Ocenia się, czy obserwowany przedmiot w ekwipunku lub obserwowany blok jest danego typu, tzn. jego kod dokładnie odpowiada podanemu kodowi. Jeśli tak, warunek zwraca true.<br>    <strong>game:plank-*<\\/strong> - Ocenia się, czy obserwowany przedmiot lub blok jest danego typu w dowolnym jego wariancie (oznaczonym gwiazdką). Jeśli tak, warunek zwraca true.<br>    <strong>@.*-plank-.*<\\/strong> - Kod obserwowanego przedmiotu lub bloku jest oceniany tym wyrażeniem regularnym. Jeśli występuje dopasowanie, warunek zwraca true.<br>    <strong>attribut > 1<\\/strong> - Oceniana jest wartość atrybutu przedmiotu w ekwipunku lub obserwowanego bloku. Można tu użyć różnych operatorów porównania (większe/mniejsze/równe). Po ocenie zwracany jest wynik porównania (true/false).<br>    <strong>attribut<\\/strong> - Jeśli w warunku zostanie podana tylko nazwa atrybutu przedmiotu, ocenia się, czy ma on lub nie ma wartości. Tzn. zero, NULL, pusty łańcuch znaków lub false są oceniane jako false. Niezerowa wartość, łańcuch znaków lub true są oceniane jako true.<br>    <br>    Na wszystkie warunki można zastosować operator negacji <strong>!<\\/strong>. Na przykład !game:plank-oak jest oceniany jako true, jeśli obserwowany przedmiot lub blok nie jest dokładnie dębową deską.    <br>    Na końcu każdego bloku można dodać instrukcję ustawienia sygnału wyjściowego, na przykład <strong>output 1<\\/strong>, która określa, że jeśli dany blok zostanie oceniony jako prawda (true), na wyjście zostanie wysłany sygnał 1.    Ma to znaczenie tylko w przypadku bloku <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Czujnik bloków<\\/a>, który pozwala ustawić, jaki sygnał zostanie wysłany na wyjście, jeśli jakiś blok lub przedmiot będzie zgodny z warunkami podanymi w bloku. W pozostałych blokach, które umożliwiają używanie warunków na papierze, instrukcja ta jest ignorowana.    <font size=\"20\" color=\"6082B6\">Ustawianie warunków<\\/font>    Warunki zapisujesz na <a href=\"handbook://item-paper-parchment\">pergaminie<\\/a>. Pergaminu nie podpisuj, aby móc ponownie edytować tekst.<br>    Warunki przenosisz do bloku, który to obsługuje, klikając tym pergaminem prawym przyciskiem myszy na dany blok. Warunki zostaną zapisane w bloku i zobaczysz je w oknie informacyjnym, kiedy spojrzysz na blok. <br>    Aby usunąć warunki z bloku, weź do ręki pusty pergamin, przykucnij (klawisz shift) i kliknij tym pustym pergaminem na dany blok. W ten sposób warunki zostaną z bloku usunięte.<br>    Jeśli chcesz skopiować z bloku warunki na pusty pergamin, kliknij pustym pergaminem prawym przyciskiem myszy na dany blok bez kucania.<br>    I na koniec pomoc do ustalenia, jaki kod ma dany blok lub przedmiot i jakie masz do dyspozycji atrybuty do użycia w wyrażeniach warunkowych:<br>    Weź do ręki przedmiot, który cię interesuje, przytrzymaj klawisz ctrl i kliknij prawym przyciskiem myszy tym blokiem na blok, który obsługuje warunki na papierze. Kod przedmiotu i jego atrybuty, dostępne dla warunków na papierze, zostaną zapisane w tym bloku. Możesz je teraz skopiować na     pusty pergamin, jak opisano powyżej, i tam dowolnie przerobić na bloki warunków i użyć ich do ustawienia bloku.",
  "signalslink:usageinfo-paperconditions-title": "Warunki na papierze"
}
