{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Czujnik bloków",
  "signals:con-input": "Wejście",
  "signals:con-output": "Wyjście",
  "signals:con-target": "Cel",
  "signals:con-source": "Źródło",
  "signalslink:block-entitysensor-*": "Czujnik istot",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Stan błędu",
  "signals:con-output1": "Wyjście 1",
  "signals:con-output2": "Wyjście 2",
  "signals:con-output1-config": "Konfiguracja wyjścia 1",
  "signals:test": "Testujemy tłumaczenia na lekcji AI.",
  "signals:con-output2-config": "Konfiguracja wyjścia 2",
  "signalslink:entitysensor-charged": "Naładowano. Dodano {0} jednostek. Maksymalny limit ładowania to {1} jednostek.",
  "signalslink:entitysensor-already-fully-charged": "To urządzenie jest już w pełni naładowane.",
  "signalslink:blockinfo-charge": "Ładunek: {0}/{1} jednostek ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Przy aktualnym zasięgu ({0} bloków) będzie działać: ~{1} dni",
  "signalslink:blockinfo-charge-empty": "Ładunek: Pusty - wymaga temporal gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - rozszerzenie moda Signals",
  "signalslink:block-managedchute-*": "Sterowana rura",
  "signalslink:block-managedwallchute-wood-*": "Sterowana rura osadzona w drewnie",
  "signalslink:block-managedwallchute-rock-*": "Sterowana rura osadzona w skale",
  "signalslink:block-managedwallchute-cobble-*": "Sterowana rura osadzona w płytkach",
  "signalslink:managedchute-conditions": "Warunki",
  "signalslink:managedchute-info-unlimited": "Transportuje bez ograniczeń",
  "signalslink:managedchute-info-remaining": "Transportuje {0}",
  "signalslink:block-handbooktitle-signalslink": "Funkcje sygnałów",
  "signalslink:block-handbooktext-blocksensor": "Czujnik bloków wykrywa obecność bloku na wybranej sąsiedniej pozycji i na podstawie jego typu lub sygnału wejściowego dostarcza na wyjściu informację o jego stanie lub zapełnieniu slotów.<br><font size=\"20\" color=\"6082B6\">Obecnie obsługiwane bloki to:</font><br><strong>Kowadło</strong> - jeśli na kowadle znajduje się wystarczająco rozgrzany sztabka do kucia, na wyjściu jest sygnał 1. W przeciwnym razie wysyła sygnał 0.<br><strong>Drzwi, bramy, klapy</strong> - w przypadku drzwi i bram należy obserwować blok przy ziemi po stronie zawiasów. Jeśli blok jest otwarty, na wyjściu jest sygnał 1, jeśli zamknięty, na wyjściu jest sygnał 0.<br><strong>Skrzynia lub ogólnie pojemnik albo dowolne bloki mające sloty ekwipunku</strong> (np. palenisko, beczka, koryto itp.). Na wyjściu jest sygnał zgodny z sygnałem wejściowym.<br>Sygnał wejściowy określa, który slot ma być skanowany.<br>Sygnał 1-14 określa sloty 0-13. Wyjściem jest informacja o zapełnieniu slotu względem maksymalnej pojemności stosu przedmiotu w danym slocie, przeliczona na sygnał 0-15.<br>Sygnał 15 określa, że czujnik ma wykrywać całkowite zapełnienie wszystkich slotów, np. całej skrzyni.<br><strong>Inny blok, niewymieniony powyżej</strong> - jeśli w obserwowanej przestrzeni nie ma nic (powietrze), na wyjściu jest sygnał 0. Jeśli jest tam woda, na wyjściu jest 2-woda słodka lub 3-woda słona. Jeśli jest tam jakikolwiek inny blok, na wyjściu jest sygnał 1.<br>",
  "signalslink:block-handbooktext-entitysensor": "Czujnik istot wykrywa obecność bytów (graczy, zwierząt, dzikich zwierząt lub potworów) w zaznaczonym obszarze i potrafi na wyjściach podawać informacje o ich liczbie, typie lub stanie. Do działania czujnik wymaga naładowania jednym lub wieloma kołami czasowymi (Temporal gears). Szybkość zużycia zależy od wielkości obserwowanego obszaru.<br><strong>Wejścia x, y, z</strong> określają wielkość obserwowanego obszaru w blokach.<br>Na wyjściu <strong>Błąd</strong> jest sygnał 1, jeśli czujnik jest rozładowany, w przeciwnym razie 0.<br>Wejścia <strong>Konfiguracja wyjścia 1</strong> i <strong>Konfiguracja wyjścia 2</strong> określają, jakie informacje będą podawane na wyjściach 1 i 2. Na każdym wyjściu możesz więc uzyskać inną informację w zależności od tych ustawień.<br>Możliwości:<br>1 - Wyjście zwraca <strong>Liczbę</strong>. Liczba wykrytych bytów.<br>2 - Wyjście zwraca <strong>Kategorię</strong>. Flagi bitowe kategorii bytów 0–3: gracz, stworzenie, zwierzę, dzikie zwierzę.<br>3 - Wyjście zwraca <strong>Stan życia</strong>. Wszystkie wykryte byty są: 1–martwe, 2–żywe lub 15–mieszane.<br>4 - Wyjście zwraca <strong>Płeć</strong>. Wszystkie wykryte byty są: 1–samiec, 2–samica lub 15–mieszane.<br>5 - Wyjście zwraca <strong>Wiek</strong>. Wszystkie wykryte byty są: 1–młode, 2–dorosłe lub 15–mieszane.<br>6 - Wyjście zwraca <strong>Gatunek</strong>. Wszystkie wykryte byty są: 1–gracz, 2–zwierzę, 3–dzikie zwierzę, 4–stworzenie lub 15–mieszane.<br>7 - Wyjście zwraca <strong>Status rozrodczy</strong>. Wszystkie wykryte byty są: 1–gotowe do parzenia, 2–w ciąży, 3–karmiące lub 15–mieszane.<br>8 - Wyjście zwraca <strong>Flagi statusu rozrodczego</strong>. Flagi bitowe 0–2: gotowe do parzenia, w ciąży, karmiące.<br>9 - Wyjście zwraca <strong>Minimalną generację</strong>. Minimalna wykryta generacja to: 0–15. Obecne byty bez określonej generacji są ignorowane.<br>10 - Wyjście zwraca <strong>Maksymalną generację</strong>. Maksymalna wykryta generacja to: 0–15. Obecne byty bez określonej generacji są ignorowane.<br>11 - Wyjście zwraca <strong>Minimalną wagę</strong>. Minimalna wykryta waga to: 1–głodujące, 2–niska, 3–przyzwoita, 4–dobra. Obecne byty bez określonej wagi (to nie są zwierzęta) są ignorowane.<br>12 - Wyjście zwraca <strong>Maksymalną wagę</strong>. Maksymalna wykryta waga to: 1–głodujące, 2–niska, 3–przyzwoita, 4–dobra. Obecne byty bez określonej wagi (to nie są zwierzęta) są ignorowane.<br>",
  "signalslink:block-handbooktext-managedchute": "Sterowana rura umożliwia zautomatyzowany transport przedmiotów między różnymi blokami.<br>",
  "signalslink:block-handbooktext-managedwallchute": "Sterowana rura osadzona w ścianie umożliwia zautomatyzowany transport przedmiotów między różnymi blokami. Umożliwia transport przedmiotów przez ściany, co może być bardzo przydatne w ukrytych systemach transportowych lub do transportu przedmiotów z piwnicy albo do piwnicy bez naruszania chłodnego, piwnicznego środowiska, ważnego dla długotrwałego przechowywania żywności.<br>",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Rozszerza mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> o dodatkowe komponenty.<br><br>Do obserwowania bloku w pobliżu możesz użyć <a href=\"handbook://block-signalslink:blocksensor\">Czujnika bloków</a>.<br>Jeśli musisz obserwować swoje stado bydła, świetnie nadaje się do tego <a href=\"handbook://block-signalslink:entitysensor\">Czujnik istot</a>.<br>Jeśli chcesz zautomatyzować niektóre prace, doskonale sprawdzi się <a href=\"handbook://block-signalslink:managedchute\">Sterowana rura</a>, która potrafi transportować przedmioty między blokami podobnie jak zsuwnia, ale sterujesz nią sygnałami i daje ci znacznie większą kontrolę nad tym, co jest transportowane. Jej wariant <a href=\"handbook://block-signalslink:managedwallchute\">Sterowana rura wbudowana w ścianę</a> umożliwia transport przedmiotów przez ściany, co może być bardzo przydatne w ukrytych systemach transportowych lub do transportu przedmiotów z piwnicy albo do piwnicy bez naruszania chłodnego, piwnicznego środowiska, ważnego dla długotrwałego przechowywania żywności."
}
