{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de blocos",
  "signals:con-input": "Entrada",
  "signals:con-output": "Saída",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de erro",
  "signals:con-output1": "Saída 1",
  "signals:con-output2": "Saída 2",
  "signals:con-output1-config": "Configuração da saída 1",
  "signals:con-output2-config": "Configuração da saída 2",
  "signalslink:entitysensor-charged": "Carregado. Adicionadas {0} unidades. O limite máximo de carga é {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo já está totalmente carregado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Com a cobertura atual ({0} blocos), irá operar por: ~{1} dias",
  "signalslink:blockinfo-charge-empty": "Carga: Vazia - precisa de uma engrenagem temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensão do mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Expande o mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> com componentes adicionais.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Permite detectar a presença de um bloco numa posição adjacente selecionada e, com base no tipo ou no sinal de entrada, fornece na saída informação sobre o seu estado ou o preenchimento de slots, etc.<br>O Block Sensor identifica qual é o bloco e fornece na saída um sinal correspondente.<br><font size=\"20\" color=\"6082B6\">Blocos suportados atualmente:</font><br><strong>Bigorna</strong> - Se houver uma barra suficientemente quente na bigorna para forjar, a Saída é o sinal 1. Caso contrário, envia o sinal 0.<br><strong>Portas, portões, alçapões</strong> - Em portas e portões, é necessário monitorizar o bloco ao nível do chão no lado das dobradiças. Se o bloco estiver aberto, a Saída é o sinal 1; se estiver fechado, a Saída é o sinal 0.<br><strong>Baú ou, em geral, um contentor ou quaisquer blocos que tenham slots de inventário</strong> (por ex., fogueira, barril, cocho, etc.). Na Saída há um sinal de acordo com o sinal de entrada.<br>O sinal de entrada determina qual slot deve ser analisado.<br>O sinal 1-14 determina os slots 0-13. A saída é a informação de preenchimento do slot em relação à capacidade máxima de pilha do item nesse slot, convertida num sinal 0-15.<br>O sinal 15 determina que o sensor deve detetar o preenchimento total de todos os slots, por ex., de um baú inteiro.<br><strong>Algum outro bloco não listado acima</strong> - Se não houver nada no espaço monitorizado (ar), a Saída é o sinal 0. Se houver água, a saída é 2 para água doce ou 3 para água salgada. Se houver qualquer outro bloco, a Saída é o sinal 1.<br><br><font size=\"21\"><strong>Sensor de entidades</strong></font><br>Deteta a presença de entidades (jogadores, animais, animais selvagens ou monstros) numa área marcada e pode fornecer nas saídas informações sobre a sua quantidade, tipo ou estado. Para funcionar, o sensor requer carga usando uma ou mais engrenagens temporais (Temporal gears). A taxa de consumo depende do tamanho da área monitorizada.<br><strong>Entradas x, y, z</strong> determinam o tamanho da área monitorizada em blocos.<br>Na saída <strong>Erro</strong> há o sinal 1 se o sensor estiver sem carga; caso contrário 0.<br>As entradas <strong>Configuração da saída 1</strong> e <strong>Configuração da saída 2</strong> determinam que informações serão fornecidas nas saídas 1 e 2. Assim, pode obter informações diferentes em cada saída, com base nestas definições de entrada.<br>Opções:<br>1 - A saída retorna <strong>Contagem</strong>. Número de entidades detetadas.<br>2 - A saída retorna <strong>Categoria</strong>. Flags de bits da categoria de entidade 0–3: jogador, criatura, animal, animal selvagem.<br>3 - A saída retorna <strong>Estado de vida</strong>. Todas as entidades detetadas são: 1–mortas, 2–vivas ou 15–mistas.<br>4 - A saída retorna <strong>Sexo</strong>. Todas as entidades detetadas são: 1–macho, 2–fêmea ou 15–mistas.<br>5 - A saída retorna <strong>Idade</strong>. Todas as entidades detetadas são: 1–jovem, 2–adulta ou 15–mistas.<br>6 - A saída retorna <strong>Espécie</strong>. Todas as entidades detetadas são: 1–jogador, 2–animal, 3–animal selvagem, 4–criatura ou 15–mistas.<br>7 - A saída retorna <strong>Estado reprodutivo</strong>. Todas as entidades detetadas são: 1–prontas para acasalar, 2–grávidas, 3–a amamentar ou 15–mistas.<br>8 - A saída retorna <strong>Flags do estado reprodutivo</strong>. Flags de bits 0–2: prontas para acasalar, grávidas, a amamentar.<br>9 - A saída retorna <strong>Geração mínima</strong>. A geração mínima detetada é: 0–15. Entidades presentes sem geração são ignoradas.<br>10 - A saída retorna <strong>Geração máxima</strong>. A geração máxima detetada é: 0–15. Entidades presentes sem geração são ignoradas.<br>11 - A saída retorna <strong>Peso mínimo</strong>. O peso mínimo detetado é: 1–faminto, 2–baixo, 3–decente, 4–bom. Entidades presentes sem peso (não são animais) são ignoradas.<br>12 - A saída retorna <strong>Peso máximo</strong>. O peso máximo detetado é: 1–faminto, 2–baixo, 3–decente, 4–bom. Entidades presentes sem peso (não são animais) são ignoradas.<br><br>"
}
