{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de bloco",
  "signals:con-input": "Entrada",
  "signals:con-output": "Saída",
  "signals:con-target": "Alvo",
  "signals:con-source": "Fonte",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de erro",
  "signals:con-output1": "Saída 1",
  "signals:con-output2": "Saída 2",
  "signals:con-output1-config": "Configuração da saída 1",
  "signals:test": "Estamos a testar traduções numa hora de IA.",
  "signals:con-output2-config": "Configuração da saída 2",
  "signalslink:entitysensor-charged": "Carregado. Foram adicionadas {0} unidades. O limite máximo de carga é {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este aparelho já está totalmente carregado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Com a cobertura atual ({0} blocos) conseguirá funcionar: ~{1} dias",
  "signalslink:blockinfo-charge-empty": "Carga: Vazio - precisa de temporal gear",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensão do mod Signals",
  "signalslink:block-managedchute-*": "Conduta controlada",
  "signalslink:block-managedwallchute-wood-*": "Conduta controlada embutida na madeira",
  "signalslink:block-managedwallchute-rock-*": "Conduta controlada embutida na rocha",
  "signalslink:block-managedwallchute-cobble-*": "Conduta controlada embutida em ladrilhos",
  "signalslink:managedchute-conditions": "Condições",
  "signalslink:managedchute-info-unlimited": "Transporta permanentemente",
  "signalslink:managedchute-info-remaining": "Transporta {0}",
  "signalslink:block-handbooktitle-signalslink": "Funções de sinal",
  "signalslink:block-handbooktext-blocksensor": "O Sensor de blocos detecta a presença de um bloco na posição adjacente selecionada e, com base no seu tipo, ou eventualmente no sinal de entrada, fornece na saída informações sobre o seu estado ou o preenchimento de slots.<br><font size=\"20\" color=\"6082B6\">Blocos atualmente suportados:</font><br><strong>Bigorna</strong> - se houver um lingote suficientemente quente na bigorna para forjar, a Saída terá sinal 1. Caso contrário, envia sinal 0.<br><strong>Portas, portões, alçapões</strong> - Para portas e portões, é necessário observar o bloco ao nível do chão do lado das dobradiças. Se o bloco estiver aberto, a Saída terá sinal 1; se estiver fechado, a Saída terá sinal 0.<br><strong>Baú ou, de forma geral, contêiner, ou quaisquer blocos que tenham slots de inventário</strong> (por exemplo, fogueira, barril, cocho etc.). A Saída terá um sinal de acordo com o sinal de entrada.<br>O sinal de entrada determina qual slot deve ser escaneado.<br>Sinal 1-14 determina os slots 0-13. A saída é a informação sobre o preenchimento do slot em relação à capacidade máxima do stack do item nesse slot, convertida para um sinal 0-15.<br>Sinal 15 determina que o sensor deve detectar o preenchimento total de todos os slots, por exemplo, de um baú inteiro.<br><strong>Algum outro bloco não listado acima</strong> - Se não houver nada no espaço observado (há ar), a Saída terá sinal 0. Se houver água, a saída será 2-água doce ou 3-água salgada. Se houver qualquer outro bloco, a Saída terá sinal 1.<br>",
  "signalslink:block-handbooktext-entitysensor": "O Sensor de entidades detecta a presença de entidades (jogadores, animais, animais selvagens ou monstros) na área marcada e consegue fornecer nas saídas informações sobre a sua quantidade, tipo ou estado. Para operar, o sensor requer carga com uma ou mais engrenagens temporais (Temporal gears). A taxa de consumo depende do tamanho da área monitorada.<br><strong>Entradas x, y, z</strong> determinam o tamanho da área monitorada em blocos.<br>Na saída <strong>Erro</strong> há sinal 1 se o sensor estiver descarregado, caso contrário 0.<br>As entradas <strong>Configuração da saída 1</strong> e <strong>Configuração da saída 2</strong> determinam quais informações serão fornecidas nas saídas 1 e 2. Em cada saída, você pode obter uma informação diferente, com base na configuração dessas entradas.<br>As opções são:<br>1 - A saída retorna <strong>Quantidade</strong>. Número de entidades detectadas.<br>2 - A saída retorna <strong>Categoria</strong>. Flags de bits da categoria de entidades 0–3: jogador, criatura, animal, animal selvagem.<br>3 - A saída retorna <strong>Estado de vida</strong>. Todas as entidades detectadas são: 1–mortas, 2–vivas ou 15–mistas.<br>4 - A saída retorna <strong>Sexo</strong>. Todas as entidades detectadas são: 1–macho, 2–fêmea ou 15–mistas.<br>5 - A saída retorna <strong>Idade</strong>. Todas as entidades detectadas são: 1–filhote, 2–adulto ou 15–mistas.<br>6 - A saída retorna <strong>Espécie</strong>. Todas as entidades detectadas são: 1–jogador, 2–animal, 3–animal selvagem, 4–criatura ou 15–mistas.<br>7 - A saída retorna <strong>Estado reprodutivo</strong>. Todas as entidades detectadas são: 1–prontas para acasalar, 2–grávidas, 3–lactantes ou 15–mistas.<br>8 - A saída retorna <strong>Flags do estado reprodutivo</strong>. Flags de bits 0–2: prontas para acasalar, grávidas, lactantes.<br>9 - A saída retorna <strong>Geração mínima</strong>. A geração mínima detectada é: 0–15. Entidades presentes sem determinação de geração são ignoradas.<br>10 - A saída retorna <strong>Geração máxima</strong>. A geração máxima detectada é: 0–15. Entidades presentes sem determinação de geração são ignoradas.<br>11 - A saída retorna <strong>Peso mínimo</strong>. O peso mínimo detectado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem determinação de peso (não são animais) são ignoradas.<br>12 - A saída retorna <strong>Peso máximo</strong>. O peso máximo detectado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem determinação de peso (não são animais) são ignoradas.<br>",
  "signalslink:block-handbooktext-managedchute": "O duto controlado permite o transporte automatizado de itens entre diferentes blocos.",
  "signalslink:block-handbooktext-managedwallchute": "O duto controlado embutido na parede permite o transporte automatizado de itens entre diferentes blocos. Permite transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos ou para transportar itens do porão ou para o porão, sem comprometer o ambiente fresco do porão, importante para a conservação de alimentos a longo prazo.",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Expande o mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> com componentes adicionais.<br><br>Para monitorar algum bloco nas proximidades, você pode usar o <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos</a>.<br>Se você precisar monitorar o seu rebanho de gado, o <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Sensor de entidades</a> é ótimo para isso.<br>Se você quiser automatizar alguns trabalhos, o <a href=\"handbook://block-signalslink:managedchute-north-down\">Duto controlado</a> vai servir muito bem; ele consegue transportar itens entre blocos de forma semelhante a um escorregador, mas você o controla por sinais e ele lhe dá muito mais controle sobre o que é transportado. Sua variante <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Duto controlado embutido na parede</a> então permite transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos ou para transportar itens do porão ou para o porão, sem comprometer o ambiente fresco do porão, importante para a conservação de alimentos a longo prazo.",
  "signalslink:usageinfo-paperconditions-text": "Alguns blocos do mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink</a> permitem usar <strong>condições no papel</strong>:<br>• <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos</a><br>• <a href=\"handbook://block-signalslink:managedchute-north-down\">Duto controlado</a><br>• <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Duto controlado embutido na parede</a><br><font size=\"20\" color=\"6082B6\">Condições no papel</font><strong>condições no papel</strong> são condições, escritas em <a href=\"handbook://item-paper-parchment\">pergaminho</a>. Essas condições podem ser usadas para influenciar o comportamento do bloco, por exemplo, para controlar sinais de saída ou para filtrar itens nos dutos.<br>As condições são escritas em blocos (parágrafos). Cada bloco consiste em uma ou mais linhas, em que em cada linha há uma condição. Todas as condições <strong>em um mesmo bloco</strong> são avaliadas de modo que se aplica entre elas o operador lógico AND, e o resultado fornece o valor final do bloco inteiro.<br>Os blocos individuais são separados por uma linha em branco. Aos valores resultantes dos blocos individuais aplica-se então o operador lógico OR. A avaliação das condições individuais no bloco ocorre na ordem de cima para baixo, conforme as condições estão listadas no papel. A avaliação dos blocos também ocorre na ordem em que os blocos estão listados no papel. Isso significa que, assim que algum bloco for avaliado como verdadeiro (true), esse resultado é retornado ao bloco chamador e os blocos seguintes não são mais processados. Isso é muito importante e é preciso levar isso em conta.<br><br>Distinguimos vários tipos de condições:<br><strong>game:plank-oak</strong> - Avalia-se se o item monitorado no inventário ou o bloco monitorado é do tipo especificado, ou seja, se seu código corresponde exatamente ao código informado. Se sim, a condição retorna true.<br><strong>game:plank-*</strong> - Avalia-se se o item ou bloco monitorado é do tipo especificado, em qualquer uma de suas variantes (marcadas com asterisco). Se sim, a condição retorna true.<br><strong>@.*-plank-.*</strong> - O código do item ou bloco monitorado é avaliado por esta expressão regular. Se houver correspondência, a condição retorna true.<br><strong>attribut > 1</strong> - Avalia-se o valor do atributo do item no inventário ou do bloco monitorado. Podem ser usados vários operadores de comparação (maior/menor/igual). Após a avaliação, retorna-se o resultado da comparação (true/false).<br><strong>attribut</strong> - Se na condição for informado apenas o nome do atributo do item, avalia-se se ele tem ou não valor. Ou seja, zero, NULL, string vazia ou false são avaliados como false. Valor não nulo, string ou true são avaliados como true.<br><br>O operador de negação <strong>!</strong> pode ser aplicado a todas as condições. Por exemplo, !game:plank-oak é avaliada como true se o item ou bloco monitorado não for exatamente tábuas de carvalho.<br>Ao final de cada bloco pode ser adicionada uma instrução para definir o sinal de saída, por exemplo <strong>output 1</strong>, que determina que, se esse bloco for avaliado como verdadeiro (true), será enviado para a saída o sinal 1. Isso faz sentido apenas para o bloco <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos</a>, que permite definir qual sinal será enviado na saída caso algum bloco ou item corresponda às condições listadas no bloco. Nos outros blocos que permitem usar condições no papel, essa instrução é ignorada.<font size=\"20\" color=\"6082B6\">Configuração das condições</font>Você escreve as condições em <a href=\"handbook://item-paper-parchment\">pergaminho</a>. Não assine o pergaminho, para poder editar o texto novamente.<br>Você transfere as condições para um bloco que as suporte clicando com o botão direito do mouse nesse bloco com esse pergaminho. Assim, as condições são salvas no bloco e você as verá na janela de informações quando olhar para o bloco. <br>Para remover as condições do bloco, pegue um pergaminho em branco na mão, agache-se (tecla shift) e clique com esse pergaminho em branco no bloco. Assim, você apagou as condições do bloco.<br>Se quiser copiar as condições do bloco para um pergaminho em branco, clique com o botão direito do mouse com o pergaminho em branco no bloco sem se agachar.<br>E por fim, uma ajuda para descobrir qual é o código de algum bloco ou item e quais atributos você tem disponíveis para usar em expressões condicionais:<br>Pegue na mão o item que lhe interessa, segure a tecla ctrl e clique com o botão direito do mouse com esse item no bloco que suporta condições no papel. O código do item e seus atributos disponíveis para condições no papel serão salvos nesse bloco. Agora você pode copiá-los para um pergaminho em branco, como descrito acima, e então editá-los livremente em blocos de condições e usá-los para configurar o bloco.",
  "signalslink:usageinfo-paperconditions-title": "Condições no papel"
}
