{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de blocos",
  "signals:con-input": "Entrada",
  "signals:con-output": "Saída",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de erro",
  "signals:con-output1": "Saída 1",
  "signals:con-output2": "Saída 2",
  "signals:con-output1-config": "Configuração da saída 1",
  "signals:con-output2-config": "Configuração da saída 2",
  "signalslink:ai-hour-test": "Mensagem de teste da hora de IA.",
  "signalslink:entitysensor-charged": "Carregado. Adicionadas {0} unidades. O limite máximo de carga é {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo já está totalmente carregado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Com a cobertura atual ({0} blocos) irá operar por: ~{1} dias",
  "signalslink:blockinfo-charge-empty": "Carga: Vazia - precisa de uma engrenagem temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensão do mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Estende o mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> com componentes adicionais.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Permite detetar a presença de um bloco numa posição adjacente selecionada e, com base no seu tipo ou no sinal de entrada, fornece na saída informações sobre o seu estado ou o preenchimento de slots, etc.<br>O Block Sensor identifica que bloco é e fornece na saída o sinal correspondente.<br><font size=\"20\" color=\"6082B6\">Blocos atualmente suportados:</font><br><strong>Bigorna</strong> - se houver um lingote suficientemente quente na bigorna para forjar, a saída é o sinal 1. Caso contrário, envia o sinal 0.<br><strong>Portas, portões, alçapões</strong> - Para portas e portões é necessário monitorizar o bloco ao nível do chão no lado das dobradiças. Se o bloco estiver aberto, a saída é o sinal 1; se estiver fechado, a saída é o sinal 0.<br><strong>Baú ou, em geral, um contentor ou quaisquer blocos que tenham slots de inventário</strong> (por ex., fogueira, barril, cocho, etc.). Na saída há um sinal conforme o sinal de entrada.<br>O sinal de entrada determina qual slot deve ser analisado.<br>O sinal 1-14 determina os slots 0-13. A saída é informação sobre o preenchimento do slot em relação à capacidade máxima de pilha do item nesse slot, convertida para um sinal 0-15.<br>O sinal 15 indica que o sensor deve detetar o preenchimento total de todos os slots, por ex. de um baú inteiro.<br><strong>Algum outro bloco não listado acima</strong> - Se não houver nada no espaço monitorizado (ar), a saída é o sinal 0. Se houver água, a saída é 2 - água doce ou 3 - água salgada. Se houver qualquer outro bloco, a saída é o sinal 1.<br><br><font size=\"21\"><strong>Sensor de entidades</strong></font><br>Deteta a presença de entidades (jogadores, animais, animais selvagens ou monstros) na área marcada e pode fornecer nas saídas informações sobre a sua contagem, tipo ou estado. O sensor requer carga para funcionar com uma ou mais engrenagens temporais (Temporal gears). A taxa de consumo depende do tamanho da área monitorizada.<br><strong>Entradas x, y, z</strong> determinam o tamanho da área monitorizada em blocos.<br>Na saída <strong>Erro</strong> há sinal 1 se o sensor estiver descarregado, caso contrário 0.<br>As entradas <strong>Configuração da saída 1</strong> e <strong>Configuração da saída 2</strong> determinam que informações serão fornecidas nas saídas 1 e 2. Em cada saída pode obter informações diferentes, com base nas definições dessas entradas.<br>Opções:<br>1 - A saída devolve <strong>Contagem</strong>. O número de entidades detetadas.<br>2 - A saída devolve <strong>Categoria</strong>. Sinalizadores de bits da categoria de entidade 0–3: jogador, criatura, animal, animal selvagem.<br>3 - A saída devolve <strong>Estado de vida</strong>. Todas as entidades detetadas são: 1–mortas, 2–vivas ou 15–mistas.<br>4 - A saída devolve <strong>Sexo</strong>. Todas as entidades detetadas são: 1–macho, 2–fêmea ou 15–mistas.<br>5 - A saída devolve <strong>Idade</strong>. Todas as entidades detetadas são: 1–jovens, 2–adultas ou 15–mistas.<br>6 - A saída devolve <strong>Espécie</strong>. Todas as entidades detetadas são: 1–jogador, 2–animal, 3–animal selvagem, 4–criatura ou 15–mistas.<br>7 - A saída devolve <strong>Estado reprodutivo</strong>. Todas as entidades detetadas são: 1–prontas para acasalar, 2–grávidas, 3–a amamentar ou 15–mistas.<br>8 - A saída devolve <strong>Sinalizadores do estado reprodutivo</strong>. Sinalizadores de bits 0–2: prontas para acasalar, grávidas, a amamentar.<br>9 - A saída devolve <strong>Geração mínima</strong>. A geração mínima detetada é: 0–15. Entidades presentes sem geração definida são ignoradas.<br>10 - A saída devolve <strong>Geração máxima</strong>. A geração máxima detetada é: 0–15. Entidades presentes sem geração definida são ignoradas.<br>11 - A saída devolve <strong>Peso mínimo</strong>. O peso mínimo detetado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem peso definido (não são animais) são ignoradas.<br>12 - A saída devolve <strong>Peso máximo</strong>. O peso máximo detetado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem peso definido (não são animais) são ignoradas.<br><br><font size=\"20\" color=\"6082B6\">Temos uma hora de IA</font><br>Demonstramos como funciona a tradução automatizada dos textos do mod usando IA. Etc.<br>"
}
