{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de Blocos",
  "signals:con-input": "Entrada",
  "signals:con-output": "Saída",
  "signalslink:block-entitysensor-*": "Sensor de Entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de erro",
  "signals:con-output1": "Saída 1",
  "signals:con-output2": "Saída 2",
  "signals:con-output1-config": "Configuração da saída 1",
  "signals:test": "Estamos testando traduções no relógio de IA.",
  "signals:con-output2-config": "Configuração da saída 2",
  "signalslink:entitysensor-charged": "Carregado. Adicionadas {0} unidades. O limite máximo de carga é {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo já está totalmente carregado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Com a cobertura atual ({0} blocos) funcionará por: ~{1} dias",
  "signalslink:blockinfo-charge-empty": "Carga: Vazia - precisa de uma engrenagem temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensão do mod Signals",
  "signalslink:usageinfo-signalslink-text": "<font size=\"25\"><strong>SignalsLink</strong></font><br>Amplia o mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> com componentes adicionais.<br><br><font size=\"21\"><strong>Block Sensor</strong></font><br>Permite detectar a presença de um bloco em uma posição adjacente selecionada e, com base no seu tipo ou no sinal de entrada, fornece na saída informações sobre seu estado ou nível de preenchimento de slots etc.<br>O Block Sensor identifica qual bloco é e fornece o sinal correspondente na saída.<br><font size=\"20\" color=\"6082B6\">Os blocos atualmente suportados são:</font><br><strong>Bigorna</strong> - se houver um lingote suficientemente quente na bigorna para forjar, a saída é o sinal 1. Caso contrário, envia o sinal 0.<br><strong>Portas, portões, alçapões</strong> - para portas e portões, é preciso monitorar o bloco do chão no lado das dobradiças. Se o bloco estiver aberto, a saída é o sinal 1; se estiver fechado, a saída é o sinal 0.<br><strong>Baú ou, em geral, um contêiner ou quaisquer blocos que tenham slots de inventário</strong> (ex.: fogueira, barril, cocho etc.). Na saída há um sinal de acordo com o sinal de entrada.<br>O sinal de entrada determina qual slot deve ser escaneado.<br>O sinal 1-14 seleciona os slots 0-13. A saída é uma informação sobre o nível de preenchimento do slot em relação à capacidade máxima de empilhamento do item naquele slot, convertida para um sinal 0-15.<br>O sinal 15 faz com que o sensor detecte o preenchimento total de todos os slots, por exemplo de todo o baú.<br><strong>Algum outro bloco não listado acima</strong> - Se não houver nada no espaço monitorado (ar), a saída é o sinal 0. Se houver água, a saída é 2 - doce ou 3 - salgada. Se houver qualquer outro bloco, a saída é o sinal 1.<br><br><font size=\"21\"><strong>Sensor de Entidades</strong></font><br>Detecta a presença de entidades (jogadores, animais, animais selvagens ou monstros) na área marcada e pode fornecer nas saídas informações sobre sua contagem, tipo ou estado. O sensor requer carga para funcionar com uma ou mais engrenagens temporais (Temporal gears). A taxa de consumo depende do tamanho da área monitorada.<br><strong>Entradas x, y, z</strong> determinam o tamanho da área monitorada em blocos.<br>Na saída <strong>Erro</strong> há o sinal 1 se o sensor estiver descarregado, caso contrário 0.<br>As entradas <strong>Configuração da saída 1</strong> e <strong>Configuração da saída 2</strong> determinam quais informações serão fornecidas nas saídas 1 e 2. Em cada saída você pode obter informações diferentes com base nessas configurações.<br>As opções são:<br>1 - A saída retorna <strong>Contagem</strong>. O número de entidades detectadas.<br>2 - A saída retorna <strong>Categoria</strong>. Flags de bits da categoria de entidade 0–3: jogador, criatura, animal, animal selvagem.<br>3 - A saída retorna <strong>Estado de vida</strong>. Todas as entidades detectadas são: 1–mortas, 2–vivas ou 15–mistas.<br>4 - A saída retorna <strong>Sexo</strong>. Todas as entidades detectadas são: 1–macho, 2–fêmea ou 15–mistas.<br>5 - A saída retorna <strong>Idade</strong>. Todas as entidades detectadas são: 1–filhotes, 2–adultas ou 15–mistas.<br>6 - A saída retorna <strong>Espécie</strong>. Todas as entidades detectadas são: 1–jogador, 2–animal, 3–animal selvagem, 4–criatura ou 15–mistas.<br>7 - A saída retorna <strong>Estado reprodutivo</strong>. Todas as entidades detectadas são: 1–prontas para acasalar, 2–prenhas, 3–lactando ou 15–mistas.<br>8 - A saída retorna <strong>Flags do estado reprodutivo</strong>. Flags de bits 0–2: prontas para acasalar, prenhas, lactando.<br>9 - A saída retorna <strong>Geração mínima</strong>. A geração mínima detectada é: 0–15. Entidades presentes sem geração especificada são ignoradas.<br>10 - A saída retorna <strong>Geração máxima</strong>. A geração máxima detectada é: 0–15. Entidades presentes sem geração especificada são ignoradas.<br>11 - A saída retorna <strong>Peso mínimo</strong>. O peso mínimo detectado é: 1–famintas, 2–baixo, 3–decente, 4–bom. Entidades presentes sem peso (não são animais) são ignoradas.<br>12 - A saída retorna <strong>Peso máximo</strong>. O peso máximo detectado é: 1–famintas, 2–baixo, 3–decente, 4–bom. Entidades presentes sem peso (não são animais) são ignoradas.<br><br><font size=\"20\" color=\"6082B6\">Relógio de IA</font><br>Estamos aqui com os caras no relógio de IA e estou mostrando a eles como a IA consegue traduzir textos.<br><br>"
}
