{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de blocos",
  "signals:con-input": "Entrada",
  "signals:con-output": "Saída",
  "signals:con-target": "Alvo",
  "signals:con-source": "Fonte",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de erro",
  "signals:con-output1": "Saída 1",
  "signals:con-output2": "Saída 2",
  "signals:con-output1-config": "Configuração da saída 1",
  "signals:test": "Estamos a testar traduções na aula de IA.",
  "signals:con-output2-config": "Configuração da saída 2",
  "signalslink:entitysensor-charged": "Carregado. Adicionadas {0} unidades. O limite máximo de carga é {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo já está totalmente carregado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Com a cobertura atual ({0} blocos), irá funcionar: ~{1} dias",
  "signalslink:blockinfo-charge-empty": "Carga: Vazia - precisa de uma engrenagem temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensão do mod Signals",
  "signalslink:block-managedchute-*": "Tubo controlado",
  "signalslink:block-managedwallchute-wood-*": "Tubo controlado embutido em madeira",
  "signalslink:block-managedwallchute-rock-*": "Tubo controlado embutido em rocha",
  "signalslink:block-managedwallchute-cobble-*": "Tubo controlado embutido em ladrilhos",
  "signalslink:managedchute-conditions": "Condições",
  "signalslink:managedchute-info-unlimited": "Transporta permanentemente",
  "signalslink:managedchute-info-remaining": "Transporta {0}",
  "signalslink:block-handbooktitle-signalslink": "Funções de sinal",
  "signalslink:block-handbooktext-blocksensor": "    O sensor de blocos detecta a presença de um bloco na posição adjacente selecionada e, com base em seu tipo e, eventualmente, no sinal de entrada, fornece na saída informações sobre seu estado ou ocupação dos slots.    <br>    <font size=\"20\" color=\"6082B6\">Os blocos atualmente suportados são:<\\/font>    <br>    <strong>Bigorna<\\/strong> - se houver um lingote suficientemente incandescente para forja sobre a bigorna, a Saída é o sinal 1. Caso contrário, envia o sinal 0.    <br>    <strong>Portas, portões, alçapões<\\/strong> - Para portas e portões é necessário monitorar o bloco no chão do lado das dobradiças. Se o bloco estiver aberto, a Saída é o sinal 1, se estiver fechado, a Saída é o sinal 0.    <br>    <strong>Baú ou, em geral, qualquer contêiner ou quaisquer blocos que possuam slots de inventário<\\/strong> (por exemplo, fogueira, barril, cocho etc.). A Saída é um sinal conforme o sinal de entrada.    <br>    O sinal de entrada determina qual slot deve ser verificado.    <br>    Sinal 1–14 determina os slots 0–13. A saída é a informação sobre o grau de ocupação do slot em relação à capacidade máxima de pilha do item nesse slot, convertida em um sinal 0–15.    <br>    Sinal 15 determina que o sensor deve detectar a ocupação total de todos os slots, por exemplo, de todo o baú.    <br>    <strong>Algum outro bloco não mencionado acima<\\/strong> - Se não houver nada no espaço monitorado (houver ar), a Saída é o sinal 0. Se houver água, a saída é 2–água doce ou 3–água salgada. Se houver qualquer outro bloco, a Saída é o sinal 1.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    O sensor de entidades detecta a presença de entidades (jogadores, animais domésticos, animais selvagens ou monstros) na área delimitada e consegue fornecer nas saídas informações sobre sua quantidade, tipo ou estado. Para funcionar, o sensor exige ser carregado com    um ou mais Engrenagens temporais (Temporal gears). A velocidade de consumo então depende do tamanho da área monitorada.    <br>    As entradas <strong>x, y, z<\\/strong> determinam o tamanho da área monitorada em blocos.    <br>    Na saída <strong>Erro<\\/strong> o sinal é 1, se o sensor estiver descarregado, caso contrário é 0.    <br>    As entradas <strong>Configuração da saída 1<\\/strong> e <strong>Configuração da saída 2<\\/strong> determinam quais informações serão fornecidas nas saídas 1 e 2. Em cada saída você pode assim obter uma informação diferente, com base na configuração dessas entradas.    <br>    As opções são:    <br>    1 - A saída retorna a <strong>Quantidade<\\/strong>. Quantidade de entidades detectadas.    <br>    2 - A saída retorna a <strong>Categoria<\\/strong>. Flags de bits da categoria de entidades 0–3: jogador, criatura, animal, animal selvagem.    <br>    3 - A saída retorna o <strong>Estado de vida<\\/strong>. Todas as entidades detectadas são: 1–mortas, 2–vivas ou 15–mistas.    <br>    4 - A saída retorna o <strong>Sexo<\\/strong>. Todas as entidades detectadas são: 1–macho, 2–fêmea ou 15–mistas.    <br>    5 - A saída retorna a <strong>Idade<\\/strong>. Todas as entidades detectadas são: 1–filhote, 2–adulto ou 15–mistas.    <br>    6 - A saída retorna o <strong>Tipo<\\/strong>. Todas as entidades detectadas são: 1–jogador, 2–animal, 3–animal selvagem, 4–criatura ou 15–mistas.    <br>    7 - A saída retorna o <strong>Estado reprodutivo<\\/strong>. Todas as entidades detectadas são: 1–prontas para acasalar, 2–prenhes, 3–lactantes ou 15–mistas.    <br>    8 - A saída retorna os <strong>Sinais do estado reprodutivo<\\/strong>. Flags de bits 0–2: prontas para acasalar, prenhes, lactantes.    <br>    9 - A saída retorna a <strong>Geração mínima<\\/strong>. A geração mínima detectada é: 0–15. As entidades presentes sem geração definida são ignoradas.    <br>    10 - A saída retorna a <strong>Geração máxima<\\/strong>. A geração máxima detectada é: 0–15. As entidades presentes sem geração definida são ignoradas.    <br>    11 - A saída retorna o <strong>Peso mínimo<\\/strong>. O peso mínimo detectado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. As entidades presentes sem peso definido (que não são animais) são ignoradas.    <br>    12 - A saída retorna o <strong>Peso máximo<\\/strong>. O peso máximo detectado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. As entidades presentes sem peso definido (que não são animais) são ignoradas.    <br>",
  "signalslink:block-handbooktext-managedchute": "    O tubo controlado permite o transporte automatizado de itens entre vários blocos.",
  "signalslink:block-handbooktext-managedwallchute": "    O tubo controlado embutido na parede permite o transporte automatizado de itens entre vários blocos. Ele possibilita transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos    ou para transportar itens do porão ou para o porão sem comprometer o ambiente frio do porão, importante para a conservação prolongada de alimentos.",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink<\\/strong><\\/font>    <br>    Expande o mod <a href=\"handbook://signals:craftinginfo-signals\">Signals<\\/a> com outros componentes.    <br>    <br>    Para monitorar algum bloco próximo, você pode usar o <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos<\\/a>.    <br>    Se você precisa monitorar seu rebanho de gado, o <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Sensor de entidades<\\/a> é perfeito para isso.    <br>    Se você quiser automatizar alguns trabalhos, o <a href=\"handbook://block-signalslink:managedchute-north-down\">Tubo controlado<\\/a> será ótimo para você, pois consegue transportar itens entre blocos de forma semelhante a uma calha, mas você o controla por sinais e obtém    um controle muito maior sobre o que é transportado. Sua variante, o <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Tubo controlado embutido na parede<\\/a>, então permite transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos    ou para transportar itens do porão ou para o porão, sem comprometer o ambiente frio do porão, importante para a conservação prolongada de alimentos.",
  "signalslink:usageinfo-paperconditions-text": "    Alguns blocos do mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink<\\/a> permitem usar <strong>condições em papel<\\/strong>:    <br>    • <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedchute-north-down\">Tubo controlado<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Tubo controlado embutido na parede<\\/a>    <br>    <font size=\"20\" color=\"6082B6\">Condições em papel<\\/font>    <strong>Condições em papel<\\/strong> são condições escritas em um <a href=\"handbook://item-paper-parchment\">pergaminho<\\/a>. Essas condições podem ser usadas para influenciar o comportamento do bloco, por exemplo, para controlar sinais de saída ou para filtrar itens em tubos.    <br>    As condições são escritas em blocos (parágrafos). Cada bloco é composto de uma ou mais linhas, em que cada linha contém uma condição. Todas as condições <strong>em um bloco<\\/strong> são avaliadas aplicando entre elas o operador lógico AND,    e o resultado fornece o valor final de todo o bloco.    <br>    Blocos individuais são separados por uma linha em branco. Sobre os valores finais dos blocos individuais é então aplicado o operador lógico OR. A avaliação das condições individuais em um bloco ocorre na ordem de cima para baixo, na qual as condições estão escritas no papel.    A avaliação dos blocos também ocorre na ordem em que eles aparecem no papel. Isso significa que, assim que algum bloco for avaliado como verdadeiro (true), esse resultado é retornado ao bloco chamador e o próximo bloco já não é processado.    Isso é muito importante e é preciso levar isso em conta.    <br>    <br>    Distinguimos vários tipos de condições:    <br>    <strong>game:plank-oak<\\/strong> - Avalia se o item monitorado no inventário ou o bloco monitorado é do tipo especificado, ou seja, se seu código corresponde exatamente ao código especificado. Se sim, a condição retorna true.<br>    <strong>game:plank-*<\\/strong> - Avalia se o item ou bloco monitorado é do tipo especificado, em qualquer uma de suas variantes (marcadas com asterisco). Se sim, a condição retorna true.<br>    <strong>@.*-plank-.*<\\/strong> - O código do item ou bloco monitorado é avaliado por esta expressão regular. Se houver correspondência, a condição retorna true.<br>    <strong>atributo > 1<\\/strong> - Avalia o valor de um atributo do item no inventário ou do bloco monitorado. Podem ser usados vários operadores de comparação (maior/menor/igual). Após a avaliação, o resultado da comparação (true/false) é retornado.<br>    <strong>atributo<\\/strong> - Se na condição for indicado apenas o nome do atributo do item, avalia-se se ele tem ou não valor. Ou seja, zero, NULL, string vazia ou false são avaliados como false. Um valor diferente de zero, uma string ou true são avaliados como true.<br>    <br>    Todas as condições podem receber o operador de negação <strong>!<\\/strong>. Por exemplo, !game:plank-oak é avaliada como true se o item ou bloco monitorado não for exatamente uma tábua de carvalho.    <br>    No final de cada bloco pode ser adicionada uma instrução para definir o sinal de saída, por exemplo <strong>output 1<\\/strong>, que determina que, se esse bloco for avaliado como verdadeiro (true), será enviado o sinal 1 na saída.    Isso só tem significado para o bloco <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos<\\/a>, que permite definir qual sinal será enviado à saída caso algum bloco ou item corresponda às condições indicadas no bloco. Nos outros blocos que permitem usar condições em papel, essa instrução é ignorada.    <font size=\"20\" color=\"6082B6\">Configuração das condições<\\/font>    Você escreve as condições em um <a href=\"handbook://item-paper-parchment\">pergaminho<\\/a>. Não assine o pergaminho para poder editar o texto novamente.<br>    Você transfere as condições para o bloco que as suporta clicando com o botão direito do mouse nesse bloco segurando esse pergaminho. As condições são então salvas no bloco e você as verá na janela de informações ao olhar para o bloco. <br>    Para remover as condições de um bloco, pegue um pergaminho vazio na mão, agache (tecla shift) e clique com esse pergaminho vazio no bloco em questão. Assim você apagará as condições do bloco.<br>    Se quiser copiar as condições de um bloco para um pergaminho vazio, clique com o botão direito do mouse com o pergaminho vazio nesse bloco sem se agachar.<br>    E, por fim, uma ajuda para descobrir qual código tem algum bloco ou item e quais atributos você tem disponíveis para usar em expressões condicionais:<br>    Pegue na mão o item do qual você quer saber, mantenha pressionada a tecla Ctrl e clique com o botão direito do mouse com esse item em um bloco que suporta condições em papel. O código do item e seus atributos disponíveis para condições em papel serão salvos nesse bloco. Você pode agora copiá-los para     um pergaminho vazio, como descrito acima, e então ajustá-los livremente em blocos de condições e usá-los para configurar o bloco.",
  "signalslink:usageinfo-paperconditions-title": "Condições em papel"
}
