{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de blocos",
  "signals:con-input": "Entrada",
  "signals:con-output": "Saída",
  "signals:con-target": "Alvo",
  "signals:con-source": "Fonte",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de erro",
  "signals:con-output1": "Saída 1",
  "signals:con-output2": "Saída 2",
  "signals:con-output1-config": "Configuração da saída 1",
  "signals:test": "Estamos testando traduções na aula de IA.",
  "signals:con-output2-config": "Configuração da saída 2",
  "signalslink:entitysensor-charged": "Carregado. Adicionadas {0} unidades. O limite máximo de carga é {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo já está totalmente carregado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Com a cobertura atual ({0} blocos), funcionará por: ~{1} dias",
  "signalslink:blockinfo-charge-empty": "Carga: Vazia - precisa de uma engrenagem temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensão do mod Signals",
  "signalslink:block-managedchute-*": "Duto controlado",
  "signalslink:block-managedwallchute-wood-*": "Duto controlado embutido na madeira",
  "signalslink:block-managedwallchute-rock-*": "Duto controlado embutido na rocha",
  "signalslink:block-managedwallchute-cobble-*": "Duto controlado embutido em lajotas",
  "signalslink:managedchute-conditions": "Condições",
  "signalslink:managedchute-info-unlimited": "Transporta indefinidamente",
  "signalslink:managedchute-info-remaining": "Transporta {0}",
  "signalslink:block-handbooktitle-signalslink": "Funções de sinal",
  "signalslink:block-handbooktext-blocksensor": "    O sensor de blocos detecta a presença de um bloco na posição adjacente selecionada e, com base no seu tipo e/ou no sinal de entrada, fornece na saída informações sobre seu estado ou o preenchimento dos slots.    <br>    <font size=\"20\" color=\"6082B6\">Os blocos atualmente suportados são:</font>    <br>    <strong>Bigorna</strong> - se houver um lingote suficientemente quente para forjar sobre a bigorna, o sinal de saída é 1. Caso contrário, envia o sinal 0.    <br>    <strong>Portas, portões, alçapões</strong> - Para portas e portões, é necessário monitorar o bloco no chão do lado das dobradiças. Se o bloco estiver aberto, o sinal de saída é 1; se estiver fechado, o sinal de saída é 0.    <br>    <strong>Baú ou, em geral, um recipiente ou quaisquer blocos que tenham slots de inventário</strong> (por exemplo, fogueira, barril, cocho etc.). A saída é um sinal de acordo com o sinal de entrada.    <br>    O sinal de entrada determina qual slot deve ser escaneado.    <br>    O sinal 1-14 determina os slots 0-13. A saída é a informação de preenchimento do slot em relação à capacidade máxima de empilhamento do item naquele slot, convertida para um sinal 0-15.    <br>    O sinal 15 determina que o sensor detecte o preenchimento total de todos os slots, por exemplo, de um baú inteiro.    <br>    <strong>Algum outro bloco não listado acima</strong> - Se não houver nada no espaço monitorado (ar), o sinal de saída é 0. Se houver água, a saída é 2-água doce ou 3-água salgada. Se houver qualquer outro bloco, o sinal de saída é 1.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    O sensor de entidades detecta a presença de entidades (jogadores, animais, animais selvagens ou monstros) na área marcada e pode fornecer nas saídas informações sobre sua quantidade, tipo ou estado. Para operar, o sensor requer carga    com uma ou mais engrenagens temporais (Temporal gears). A taxa de consumo depende do tamanho da área monitorada.    <br>    <strong>Entradas x, y, z</strong> determinam o tamanho da área monitorada em blocos.    <br>    Na saída <strong>Erro</strong> o sinal é 1 se o sensor estiver descarregado, caso contrário 0.    <br>    As entradas <strong>Configuração da saída 1</strong> e <strong>Configuração da saída 2</strong> determinam quais informações serão fornecidas nas saídas 1 e 2. Assim, em cada saída você pode obter informações diferentes com base nas configurações dessas entradas.    <br>    As opções são:    <br>    1 - A saída retorna <strong>Quantidade</strong>. Número de entidades detectadas.    <br>    2 - A saída retorna <strong>Categoria</strong>. Flags de bits da categoria de entidade 0–3: jogador, criatura, animal, animal selvagem.    <br>    3 - A saída retorna <strong>Estado de vida</strong>. Todas as entidades detectadas são: 1–mortas, 2–vivas ou 15–mistas.    <br>    4 - A saída retorna <strong>Sexo</strong>. Todas as entidades detectadas são: 1–macho, 2–fêmea ou 15–mistas.    <br>    5 - A saída retorna <strong>Idade</strong>. Todas as entidades detectadas são: 1–filhotes, 2–adultas ou 15–mistas.    <br>    6 - A saída retorna <strong>Espécie</strong>. Todas as entidades detectadas são: 1–jogador, 2–animal, 3–animal selvagem, 4–criatura ou 15–mistas.    <br>    7 - A saída retorna <strong>Estado reprodutivo</strong>. Todas as entidades detectadas são: 1–prontas para acasalar, 2–prenhas, 3–amamentando ou 15–mistas.    <br>    8 - A saída retorna <strong>Flags do estado reprodutivo</strong>. Flags de bits 0–2: prontas para acasalar, prenhas, amamentando.    <br>    9 - A saída retorna <strong>Geração mínima</strong>. A geração mínima detectada é: 0–15. Entidades presentes sem geração determinada são ignoradas.    <br>    10 - A saída retorna <strong>Geração máxima</strong>. A geração máxima detectada é: 0–15. Entidades presentes sem geração determinada são ignoradas.    <br>    11 - A saída retorna <strong>Peso mínimo</strong>. O peso mínimo detectado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem peso determinado (não são animais) são ignoradas.    <br>    12 - A saída retorna <strong>Peso máximo</strong>. O peso máximo detectado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem peso determinado (não são animais) são ignoradas.    <br>",
  "signalslink:block-handbooktext-managedchute": "    O duto controlado permite o transporte automatizado de itens entre diferentes blocos.    ",
  "signalslink:block-handbooktext-managedwallchute": "    O duto controlado embutido na parede permite o transporte automatizado de itens entre diferentes blocos. Ele permite transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos    ou para transportar itens de um porão ou para um porão sem comprometer o ambiente frio do porão, importante para a conservação de alimentos a longo prazo.    ",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink</strong></font>    <br>    Expande o mod <a href=\"handbook://signals:craftinginfo-signals\">Signals</a> com componentes adicionais.    <br>    <br>    Para monitorar um bloco nas proximidades, você pode usar o <a href=\"handbook://block-signalslink:blocksensor\">Sensor de blocos</a>.    <br>    Se você precisa monitorar seu rebanho de gado, o <a href=\"handbook://block-signalslink:entitysensor\">Sensor de entidades</a> é excelente para isso.    <br>    Se você quiser automatizar alguns trabalhos, o <a href=\"handbook://block-signalslink:managedchute\">Duto controlado</a> vai te ajudar muito: ele consegue transportar itens entre blocos de forma parecida com um duto, mas você o controla com sinais e ele te dá    muito mais controle sobre o que está sendo transportado. Sua variante <a href=\"handbook://block-signalslink:managedwallchute\">Duto controlado embutido na parede</a> permite transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos    ou para transportar itens de um porão ou para um porão sem comprometer o ambiente frio do porão, importante para a conservação de alimentos a longo prazo. "
}
