{
  "game:tabname-signalslink": "Signals Link",
  "signalslink:block-blocksensor-*": "Sensor de blocos",
  "signals:con-input": "Entrada",
  "signals:con-output": "Saída",
  "signals:con-target": "Alvo",
  "signals:con-source": "Fonte",
  "signalslink:block-entitysensor-*": "Sensor de entidades",
  "signals:con-x": "X",
  "signals:con-y": "Y",
  "signals:con-z": "Z",
  "signals:con-error-state": "Estado de erro",
  "signals:con-output1": "Saída 1",
  "signals:con-output2": "Saída 2",
  "signals:con-output1-config": "Configuração da saída 1",
  "signals:test": "Estamos a testar traduções numa sessão de IA.",
  "signals:con-output2-config": "Configuração da saída 2",
  "signalslink:entitysensor-charged": "Carregado. Adicionadas {0} unidades. O limite máximo de carga é {1} unidades.",
  "signalslink:entitysensor-already-fully-charged": "Este dispositivo já está totalmente carregado.",
  "signalslink:blockinfo-charge": "Carga: {0}/{1} unidades ({2}%)",
  "signalslink:blockinfo-charge-at-volume": "Com a cobertura atual ({0} blocos), consegue funcionar durante: ~{1} dias",
  "signalslink:blockinfo-charge-empty": "Carga: Vazio - precisa de engrenagem temporal",
  "signalslink:usageinfo-signalslink-title": "SignalsLink - extensão do mod Signals",
  "signalslink:block-managedchute-*": "Tubo controlado",
  "signalslink:block-managedwallchute-wood-*": "Tubo controlado embutido em madeira",
  "signalslink:block-managedwallchute-rock-*": "Tubo controlado embutido na rocha",
  "signalslink:block-managedwallchute-cobble-*": "Tubo controlado embutido em ladrilhos",
  "signalslink:managedchute-conditions": "Condições",
  "signalslink:managedchute-info-unlimited": "Transporta continuamente",
  "signalslink:managedchute-info-remaining": "Transporta {0}",
  "signalslink:block-handbooktitle-signalslink": "Funções de sinal",
  "signalslink:block-handbooktext-blocksensor": "    O sensor de blocos detecta a presença de um bloco na posição vizinha selecionada e, com base no seu tipo ou no sinal de entrada, fornece na saída informação sobre o seu estado ou o preenchimento de slots.    <br>    <font size=\"20\" color=\"6082B6\">Blocos atualmente suportados:<\\/font>    <br>    <strong>Bigorna<\\/strong> - se houver um lingote suficientemente quente na bigorna para forjar, há sinal 1 na Saída. Caso contrário, envia sinal 0.    <br>    <strong>Portas, portões, alçapões<\\/strong> - Para portas e portões é necessário monitorizar o bloco ao nível do chão do lado das dobradiças. Se o bloco estiver aberto, há sinal 1 na Saída; se estiver fechado, há sinal 0 na Saída.    <br>    <strong>Baú ou, em geral, contentor, ou quaisquer blocos que tenham slots de inventário<\\/strong> (por ex. fogueira, barril, cocho, etc.). Na Saída há um sinal conforme o sinal de entrada.    <br>    O sinal de entrada determina qual slot deve ser analisado.    <br>    O sinal 1-14 determina os slots 0-13. A saída é a informação de preenchimento do slot em relação à capacidade máxima de stack do item nesse slot, convertida para um sinal 0-15.    <br>    O sinal 15 determina que o sensor deve detetar o preenchimento total de todos os slots, por ex. de um baú inteiro.    <br>    <strong>Algum outro bloco, não listado acima<\\/strong> - Se não houver nada no espaço monitorizado (há ar), há sinal 0 na Saída. Se houver água, a saída é 2-água doce ou 3-água salgada. Se houver qualquer outro bloco, há sinal 1 na Saída.    <br>",
  "signalslink:block-handbooktext-entitysensor": "    O sensor de entidades deteta a presença de entidades (jogadores, animais, animais selvagens ou monstros) na área demarcada e consegue fornecer nas saídas informações sobre a sua quantidade, tipo ou estado. Para funcionar, o sensor requer carga com    uma ou mais engrenagens temporais (Temporal gears). A velocidade de consumo depende do tamanho da área monitorizada.    <br>    <strong>Entradas x, y, z<\\/strong> determinam o tamanho da área monitorizada em blocos.    <br>    Na saída <strong>Erro<\\/strong> há sinal 1 se o sensor estiver descarregado, caso contrário 0.    <br>    As entradas <strong>Configuração da saída 1<\\/strong> e <strong>Configuração da saída 2<\\/strong> determinam que informações serão fornecidas nas saídas 1 e 2. Assim, em cada saída pode obter uma informação diferente, com base na configuração dessas entradas.    <br>    As opções são:    <br>    1 - A saída retorna <strong>Quantidade<\\/strong>. Número de entidades detetadas.    <br>    2 - A saída retorna <strong>Categoria<\\/strong>. Flags bit a bit da categoria das entidades 0–3: jogador, criatura, animal, animal selvagem.    <br>    3 - A saída retorna <strong>Estado de vida<\\/strong>. Todas as entidades detetadas são: 1–mortas, 2–vivas ou 15–mistas.    <br>    4 - A saída retorna <strong>Sexo<\\/strong>. Todas as entidades detetadas são: 1–macho, 2–fêmea ou 15–mistas.    <br>    5 - A saída retorna <strong>Idade<\\/strong>. Todas as entidades detetadas são: 1–cria, 2–adulta ou 15–mistas.    <br>    6 - A saída retorna <strong>Espécie<\\/strong>. Todas as entidades detetadas são: 1–jogador, 2–animal, 3–animal selvagem, 4–criatura ou 15–mistas.    <br>    7 - A saída retorna <strong>Estado reprodutivo<\\/strong>. Todas as entidades detetadas são: 1–prontas para acasalar, 2–grávidas, 3–a amamentar ou 15–mistas.    <br>    8 - A saída retorna <strong>Flags de estado reprodutivo<\\/strong>. Flags bit a bit 0–2: prontas para acasalar, grávidas, a amamentar.    <br>    9 - A saída retorna <strong>Geração mínima<\\/strong>. A geração mínima detetada é: 0–15. Entidades presentes sem determinação de geração são ignoradas.    <br>    10 - A saída retorna <strong>Geração máxima<\\/strong>. A geração máxima detetada é: 0–15. Entidades presentes sem determinação de geração são ignoradas.    <br>    11 - A saída retorna <strong>Peso mínimo<\\/strong>. O peso mínimo detetado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem determinação de peso (não são animais) são ignoradas.    <br>    12 - A saída retorna <strong>Peso máximo<\\/strong>. O peso máximo detetado é: 1–faminto, 2–baixo, 3–razoável, 4–bom. Entidades presentes sem determinação de peso (não são animais) são ignoradas.    <br>",
  "signalslink:block-handbooktext-managedchute": "    O tubo controlado permite o transporte automatizado de itens entre diferentes blocos.",
  "signalslink:block-handbooktext-managedwallchute": "    O tubo controlado embutido na parede permite o transporte automatizado de itens entre diferentes blocos. Permite transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos    ou para transportar itens de uma cave ou para uma cave, sem perturbar o ambiente fresco da cave, importante para a conservação de alimentos a longo prazo.",
  "signalslink:usageinfo-signalslink-text": "    <font size=\"25\"><strong>SignalsLink<\\/strong><\\/font>    <br>    Expande o mod <a href=\"handbook://signals:craftinginfo-signals\">Signals<\\/a> com componentes adicionais.    <br>    <br>    Para monitorizar algum bloco nas proximidades pode usar o <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos<\\/a>.    <br>    Se precisar de monitorizar o seu rebanho de gado, o <a href=\"handbook://block-signalslink:entitysensor-off-north-down\">Sensor de entidades<\\/a> é perfeito para isso.    <br>    Se quiser automatizar algumas tarefas, o <a href=\"handbook://block-signalslink:managedchute-north-down\">Tubo controlado<\\/a> será uma excelente ajuda, pois consegue transportar itens entre blocos de forma semelhante a uma calha, mas é controlado por sinais e dá-lhe    muito mais controlo sobre o que é transportado. A sua variante <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Tubo controlado embutido na parede<\\/a> permite então transportar itens através de paredes, o que pode ser muito útil para sistemas de transporte ocultos    ou para transportar itens de uma cave ou para uma cave, sem perturbar o ambiente fresco da cave, importante para a conservação de alimentos a longo prazo.",
  "signalslink:usageinfo-paperconditions-text": "    Alguns blocos do mod <a href=\"handbook://signalslink:usageinfo-signalslink\">SignalsLink<\\/a> permitem usar <strong>condições no papel<\\/strong>:    <br>    • <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedchute-north-down\">Tubo controlado<\\/a>    <br>    • <a href=\"handbook://block-signalslink:managedwallchute-rock-granite-north-north\">Tubo controlado embutido na parede<\\/a>    <br>    <font size=\"20\" color=\"6082B6\">Condições no papel<\\/font>    <strong>condições no papel<\\/strong> são condições escritas em <a href=\"handbook://item-paper-parchment\">pergaminho<\\/a>. Estas condições podem ser usadas para influenciar o comportamento de um bloco, por exemplo para controlar sinais de saída ou para filtrar itens nos tubos.    <br>    As condições são escritas em blocos (parágrafos). Cada bloco consiste em uma ou mais linhas, sendo que em cada linha há uma condição. Todas as condições <strong>num único bloco<\\/strong> são avaliadas aplicando-se entre elas o operador lógico AND    e o resultado dá o valor final do bloco.    <br>    Os blocos individuais são separados por uma linha em branco. Aos valores resultantes dos blocos aplica-se então o operador lógico OR. A avaliação das condições individuais num bloco ocorre de cima para baixo, na ordem em que as condições aparecem no papel.    A avaliação dos blocos também ocorre na ordem em que os blocos aparecem no papel. Isto significa que assim que algum bloco for avaliado como verdadeiro (true), esse resultado é devolvido ao bloco chamador e os blocos seguintes já não são processados.    Isto é muito importante e é preciso ter isso em conta.    <br>    <br>    Distinguimos vários tipos de condições:    <br>    <strong>game:plank-oak<\\/strong> - Avalia-se se o item monitorizado no inventário ou o bloco monitorizado é do tipo especificado, ou seja, se o seu código corresponde exatamente ao código indicado. Se sim, a condição retorna true.<br>    <strong>game:plank-*<\\/strong> - Avalia-se se o item ou bloco monitorizado é do tipo especificado, em qualquer uma das suas variantes (marcadas com asterisco). Se sim, a condição retorna true.<br>    <strong>@.*-plank-.*<\\/strong> - O código do item ou do bloco monitorizado é avaliado por esta expressão regular. Se houver correspondência, a condição retorna true.<br>    <strong>attribut > 1<\\/strong> - Avalia-se o valor do atributo do item no inventário ou do bloco monitorizado. Podem ser usados vários operadores de comparação (maior/menor/igual). Após a avaliação, retorna-se o resultado da comparação (true/false).<br>    <strong>attribut<\\/strong> - Se na condição for indicado apenas o nome do atributo do item, avalia-se se ele tem ou não valor. Ou seja, zero, NULL, string vazia ou false avaliam como false. Um valor não nulo, string ou true avaliam como true.<br>    <br>    A todas as condições pode ser aplicado o operador de negação <strong>!<\\/strong>. Por exemplo, !game:plank-oak avalia como true se o item ou bloco monitorizado não for exatamente tábuas de carvalho.    <br>    No fim de cada bloco pode ser adicionada uma instrução para definir o sinal de saída, por exemplo <strong>output 1<\\/strong>, que determina que, se este bloco for avaliado como verdadeiro (true), será enviado para a saída o sinal 1.    Isto tem significado apenas no bloco <a href=\"handbook://block-signalslink:blocksensor-off-fwd-north-down\">Sensor de blocos<\\/a>, que permite definir que sinal será enviado para a saída caso algum bloco ou item corresponda às condições indicadas no bloco. Nos outros blocos que permitem usar condições no papel, esta instrução é ignorada.    <font size=\"20\" color=\"6082B6\">Configuração das condições<\\/font>    Escreva as condições em <a href=\"handbook://item-paper-parchment\">pergaminho<\\/a>. Não assine o pergaminho, para que possa editar o texto novamente.<br>    Transfira as condições para um bloco que as suporte clicando com o botão direito do rato nesse bloco com o pergaminho. Assim, as condições ficam guardadas no bloco e verá-as na janela de informação quando olhar para o bloco. <br>    Para remover as condições do bloco, pegue num pergaminho em branco, agache-se (tecla shift) e clique com o botão direito do rato nesse bloco com o pergaminho em branco. Assim apagou as condições do bloco.<br>    Se quiser copiar as condições do bloco para um pergaminho em branco, clique com o botão direito do rato no bloco com o pergaminho em branco sem se agachar.<br>    E por fim, uma ajuda para descobrir qual é o código de algum bloco ou item e que atributos tem disponíveis para usar nas expressões condicionais:<br>    Pegue no item que lhe interessa, mantenha premida a tecla ctrl e clique com o botão direito do rato com esse bloco no bloco que suporta condições no papel. O código do item e os seus atributos, disponíveis para condições no papel, serão guardados nesse bloco. Pode agora copiá-los para um    pergaminho em branco, como descrito acima, e aqui editá-los livremente em blocos de condições e usá-los para configurar o bloco.",
  "signalslink:usageinfo-paperconditions-title": "Condições no papel"
}
